CREATE PROCEDURE [dbo].[Publisher_Data]
AS
	SET NOCOUNT ON

	SET IDENTITY_INSERT [dbo].[Publisher] ON
	
	MERGE INTO [dbo].[Publisher] AS Target
	USING (VALUES 
		(1, N'МЦНМО', N'Издательство Московского центра непрерывного математического образования', N'RUS', N'Москва')
		, (2, N'Мир', N'Мир', N'RUS', N'Москва')
		, (3, N'Физматгиз', N'Государственное издательство физико-математической литературы', N'RUS', N'Москва')
		, (4, N'Просвещение', N'Просвещение', N'RUS', N'Москва')
		, (5, N'Наука', N'Наука. Главная редакция физико-математической литературы', N'RUS', N'Москва')
		, (6, N'URSS', N'URSS', N'RUS', N'Москва')
		, (7, N'Изд-во МГУ', N'Издательство Московского университета', N'RUS', N'Москва')
		, (8, N'Изд-во ЦПИ при ММ ф-те МГУ', N'Издательство Центра прикладных исследований при механико-математическом факультете МГУ', N'RUS', N'Москва')
		, (9, N'Платон', N'Платон', N'RUS', N'Волгоград')
		, (10, N'ЛКИ', N'ЛКИ партнер URSS', N'RUS', N'Москва')
		, (11, N'Изд-во ММ ф-та МГУ', N'Издательство механико-математического факультета МГУ', N'RUS', N'Москва')
		, (12, N'Агрофирма "Александрия"', N'Агрофирма "Александрия"', N'RUS', N'Киев')
		, (13, N'Факториал', N'Факториал Пресс', N'RUS', N'Москва')
		, (14, N'Вышэйш. школа', N'Вышэйшая школа', N'BLR', N'Минск')
		, (15, N'ВО "Наука"', N'Наука. Сибирское отделение.', N'RUS', N'Москва')
		, (16, N'НИЦ "R&C Dynamics", Ижевский ин-т ком-х исследований', N'НИЦ "Регулярная и хаотическая динамика", Ижевский институт компьютерных исследований', N'RUS', N'Москва-Ижевск')
		, (17, N'Изд-во МАИ', N'Издательство МАИ', N'RUS', N'Москва')
		, (18, N'И*Л', N'Издательство иностранной литературы', N'RUS', N'Москва')
		, (19, N'ФАЗИС', N'Издательство ФАЗИС', N'RUS', N'Москва')
		, (20, N'Альфа-пресс', N'Издательство "Альфа-Пресс"', N'RUS', N'Москва')
		, (21, N'Изд-во РУДН', N'Издательство Российского Университета дружбы народов', N'RUS', N'Москва')
		, (22, N'Янус-К', N'Янус-К', N'RUS', N'Москва')
		, (23, N'ГИТТЛ', N'Государственное издательство технико-теоретической литературы', N'RUS', N'Ленинград')
		, (24, N'Научный мир', N'Научный мир', N'RUS', N'Москва')
		, (25, N'Изд-во ММ ф-та МГУ', N'Издательство механико-математического факультета МГУ', N'RUS', N'Москва')
		, (26, N'Высшая школа', N'Государственное издательство "Высшая школа"', N'RUS', N'Москва')
		, (27, N'Гостехиздат Украины', N'Государственное научно-техническое издательство Украины, ОНТИ, НКТП', N'UKR', N'Харьков,Киев')
		, (28, N'Петроглиф', N'Петроглиф', N'RUS', N'С.-Петербург')
		, (29, N'Виктория плюс', N'Виктория плюс', N'RUS', N'С.-Петербург')
		, (30, N'ГИТТЛ', N'Государственное издательство технико-теоретической литературы', N'RUS', N'Москва,Ленинград')
		, (31, N'Техносфера', N'ЗАО "РИЦ "Техносфера"', N'RUS', N'Москва')
		, (32, N'УЧПЕДГИЗ', N'Государственное учебно-педагогическое издательство', N'RUS', N'Москва')
		, (33, N'КомКнига', N'КомКнига партнер URSS', N'RUS', N'Москва')
		, (34, N'Воронежский госуниверситет', N'Воронежский госуниверситет', N'RUS', N'Воронеж')
		, (35, N'Из-во Харьковского ун-та', N'Издательство харьковского государственного университета им. А.М.Горького', N'RUS', N'Харьков')
		, (36, N'Космосинформ', N'Космосинформ', N'RUS', N'Москва')
		, (37, N'Молодая гвардия', N'Издательство ЦК ВЛКСМ Молодая гвардия', N'RUS', N'Москва')
		, (38, N'Советская наука', N'Государственное издательство "Советская наука"', N'RUS', N'Москва')
		, (39, N'Либроком', N'Книжный дом "Либроком" партнер URSS', N'RUS', N'Москва')
		, (40, N'ИО НФМИ',N'Новокузнецкий физико-математический институт', N'RUS', N'Москва')
		, (41, N'Де Агостини',N'DeAGOSTINI', N'RUS', N'Москва')
		, (42, N'ФИЗМАТЛИТ', N'Издательская фирма "Физико-математическая литература"', N'RUS', N'Москва')
		, (43, N'РИА "Текст"', N'Рекламно-издательское агентство "Текст"', N'UKR', N'Киев')
		, (44, N'МП "ОКО"', N'Малое предприятие "ОКО"', N'UKR', N'Киев')
		, (45, N'Проспект', N'ТК "Велби, Издательство "Проспект"', N'RUS', N'Москва')
		, (46, N'Ленанд', N'ООО "Ленанд" партнер URSS', N'RUS', N'Москва')
		, (47, N'ДМК', N'ДМК Пресс', N'RUS', N'Москва')
		, (48, N'ДЛ', N'Детская литература', N'RUS', N'Москва')
		, (49, N'Интеллект', N'Издательский Дом "Интеллект"', N'RUS', N'Долгопрудный')
		, (50, N'ГОНТИ', N'Государственное, объединенное научно-техническое издательство НКТП СССР', N'RUS', N'Москва, Ленинград')
		, (51, N'Радио и связь', N'Радио и связь', N'RUS', N'Москва')
		, (52, N'НЦ ЭНАС', N'НЦ ЭНАС', N'RUS', N'Москва')
		, (53, N'ВИНИТИ', N'Всесоюзный институт научной и технической информации', N'RUS', N'Москва')


	) 
	AS Source ([Id], [Name], [FullName], [Country], [City]) 
	ON Target.[Id] = Source.[Id] 
	WHEN MATCHED THEN 
		UPDATE SET 
			[Name] = Source.[Name], 
			[FullName] = Source.[FullName], 
			[Country] = Source.[Country], 
			[City] = Source.[City]
	WHEN NOT MATCHED BY TARGET THEN 
		INSERT ([Id], [Name], [FullName], [Country], [City]) 
		VALUES (Source.[Id], Source.[Name], Source.[FullName], Source.[Country], Source.[City]) 
	WHEN NOT MATCHED BY SOURCE THEN 
		DELETE;

	SET IDENTITY_INSERT [dbo].[Publisher] OFF

	RETURN @@ROWCOUNT
