CREATE PROCEDURE [dbo].[Title_Data]
AS
	SET NOCOUNT ON

	SET IDENTITY_INSERT [dbo].[Title] ON

	MERGE INTO [dbo].[Title] AS Target 
	USING (
	VALUES 
		  (1, '51(07)', N'22.1,Р24', '978-5-4439-2683-4', N'Логические задачи', 5, 'S', N'Москва', 1, 2018, 120, 2000, NULL)
		, (2, '51(07)', N'22.1,М42', '978-5-4439-2728-2', N'Чётность', 7, 'S', N'Москва', 1, 2018, 64, 2000, NULL)
		, (3, NULL, N'74.262.21,С32', '978-5-94057-359-3', N'Математика в спецклассах 57-й школы. Математический анализ.', NULL, NULL, N'Москва', 1, 2008, 159, 1000, NULL)
		, (4, '519.4', NULL, NULL, N'Введение в коммутативную алгебру', NULL, NULL, N'Москва', 2, 1972, 160, NULL, N'Число страниц и тираж не указаны.')
		, (5, '511.2', NULL, NULL, N'Курс арифметики', NULL, NULL, N'Москва', 2, 1972, 184, NULL, N'Число страниц и тираж не указаны.')
		, (6, '11-3-4', NULL, NULL, N'Пробуждающаяся наука. Математика древнего Египта Вавилона и Греции.', NULL, NULL, N'Москва', 3, 1959, 460, 6000, N'Число страниц не указано.')
		, (7, NULL, N'517.6,С20', NULL, N'Познакомьтесь с топологией (на подступах к топологии). Книга для внеклассного чтения. VIII-X классы.', NULL, NULL, N'Москва', 4, 1976, 79, 80000, NULL)
		, (8, '517.9(075.8)', N'22.161.6,Ф53', '5-02-014663-3', N'Сборник задач по дифференциальным уравнениям.', 7, 'S', N'Москва', 5, 1992, 128, 20700, NULL)
		, (9, NULL, NULL, '5-88417-134-X', N'Задачи по алгебре', NULL, NULL, N'Москва', 6, 1998, 56, NULL, N'Издатели: МЦНМО, МК НМУ, "УРСС". Тираж не указан')
		, (10, NULL, NULL, NULL, N'Введение показательной, логарифмической и тригонометрических функций и изучение их свойств в первом семестре курса математического анализа',
			NULL, NULL, N'Москва', 8, 2006, 56, 200, NULL)
		, (11, '513.015.7+517.988+519.216', NULL, '5-211-00944-4', N'Континуальные интегралы', NULL, NULL, N'Москва', 7, 1990, 150, 1640, NULL)
		, (12, '511.1', N'22.130,У77', '978-5-94057-492-7', N'Простейшие примеры математических доказательств', NULL, NULL, N'Москва', 1, 2009, 56, 2000, NULL)
		, (13, '512', N'22.14,С88', '978-5-4439-0201-2', N'Студенческие олимпиады по алгебре на мехмате МГУ', NULL, NULL, N'Москва', 1, 2012, 72, 1000, N'2006-2011')
		, (14, NULL, NULL, N'5-80100-106-9', N'Введение в теорию дифференцируемых многообразий', NULL, NULL, N'Волгоград', 9, 1996, 204, NULL, N'Число страниц и тираж не указаны.')
		, (15, '512', N'22.141,К68', NULL, N'Неравенства', 5, 'S', N'Москва', 5, 1974, 72, 100000, NULL)
		, (16, '511.6', N'22.131,Г32', NULL, N'Решение уравнений в целых числах', 4, NULL, N'Москва', 5, 1983, 64, 100000, NULL)
		, (17, '51(091)', N'22,1 г,П70', '5-02-014849-0', N'Три классические задачи на построение: удвоение куба, трисекция угла, квадратура круга.', NULL, NULL, N'Москва', 5, 1992, 80, 9700, NULL)
		, (18, '512', N'22.141,К 93', NULL, N'Алгебраические уравнения произвольных степеней.', 3, NULL, N'Москва', 5, 1983, 32, 150000, NULL)
		, (19, '510.6(023)', N'22.12,У77', '5-02-013735-9', N'Машина Поста', 2, 'R', N'Москва', 5, 1988, 96, 89000, NULL)
		, (20, '512', N'22.14,П 63', NULL, N'Введение в теорию алгебраических чисел', NULL, NULL, N'Москва', 5, 1982, 240, 150000, NULL)
		, (21, '511.8', N'22.13,Г 15', '5-211-03075-3', N'Введение в теорию чисел', 2, NULL, N'Москва', 7, 1995, 160, 2000, NULL)
		, (22, '512.772', N'22.147,П70', '978-5-4439-0197-8', N'Азбука римановых поверхностей', NULL, NULL, N'Москва', 1, 2015, 148, 1000, NULL)
		, (23, '517.53', NULL, NULL, N'Теория функций в поликруге', NULL, NULL, N'Москва', 2, 1974, 160, NULL, NULL)
		, (24, '517.1', NULL, NULL, N'Элементы математической логики', NULL, NULL, N'Москва', 7, 1984, 80, 5660, NULL)
		, (25, '5136', NULL, NULL, N'Введение в алгебраические и абелевы функции', NULL, NULL, N'Москва', 2, 1976, 136, NULL, NULL)
		, (26, '513.83', NULL, NULL, N'Топологические вариационные задачи', NULL, NULL, N'Москва', 7, 1984, 216, 3600, NULL)
		, (27, '372.3/.4:51(072)', N'74.102,К30', '978-5-4439-2670-4', N'Пирог с математикой', 8, 'S', N'Москва', 1, 2018, 96, 3000, NULL)
		, (28, '51(07)', N'22.1,312', '978-5-4439-2754-1', N'Дверца в математику. Увлекательный кружок для 3-4 классов', 2, 'E', N'Москва', 1, 2018, 104, 2000, NULL)
		, (29, '373:51', N'22.1я72,Г68', '978-5-4439-1324-7', N'ЕГЭ 2019. Математика. Геометрия. Стереометрия. Задача 14 (профильный уровень)', NULL, NULL, N'Москва', 1, 2019, 144, 3000, NULL)
		, (30, '512.9', N'517.1,С 44', NULL, N'Элементы теории структур', NULL, NULL, N'Москва', 5, 1970, 148, 12000, NULL)
		, (31, '512.8', N'517.1,К 60', NULL, N'Линейно упорядоченные группы', NULL, NULL, N'Москва', 5, 1972, 200, 6000, NULL)
		, (32, '512.75+512.76', N'22.132+22.147,Г70', '978-5-4439-1271-4', N'Неразветвленная группа Брауэра и ее приложения', NULL, NULL, N'Москва', 1, 2018, 200, 1000, NULL)
		, (33, NULL, N'22.1г', '978-5-382-00156-2', N'Алгебраическая геометрия в работах советских математиков', 2, NULL, N'Москва', 10, 2007, 64, NULL, NULL)
		, (34, '513.83', NULL, NULL, N'Дифференциальная топология. Начальный курс', NULL, NULL, N'Москва', 2, 1972, 280, NULL, NULL)
		, (35, '51', N'22.1,П70', '978-5-4439-1142-7', N'Рассказы о числах, многочленах и фигурах', NULL, 'N', N'Москва', 1, 2017, 88, 2000, NULL)
		, (36, '517', N'22.16,Н33', '978-5-4439-2510-3', N'Краткий курс математического анализа', 3, 'S', N'Москва', 1, 2018, 96, 1000, NULL)
		, (37, '512.7+519.6', N'22.14+22.19,А80', '5-94057-095-X', N'Базисы Грёбнера и системы алгебраических уравнений', NULL, NULL, N'Москва', 1, 2003, 68, 1000, NULL)
		, (38, '512', N'22.14,А86', '978-594057-062-2', N'Теория Галуа', 2, 'S', N'Москва', 1, 2008, 66, 1000, NULL)
		, (39, '514.112', N'22.151.0,Г68', '978-5-4439-2682-7', N'Это должен знать каждый матшкольник', 10, 'S', N'Москва', 1, 2018, 56, 2000, NULL)
		, (40, '519.4', NULL, NULL, N'Геометрия классических групп', NULL, NULL, N'Москва', 2, 1974, 208, NULL, NULL)
		, (41, '510.222', N'222.12,Л73', '978-5-4439-1262-2', N'Элементы теории множеств', NULL, NULL, N'Москва', 1, 2018, 96, 1000, NULL)
		, (42, '514.11,Г27', N'22.151.0', '5-900916-72-3', N'Площади многоугольников', NULL, NULL, N'Москва', 1, 2001, 24, 1500, NULL)
		, (43, '514.112', N'22.151.0,Г68', '978-5-4439-0192-3', N'Теоремы и задачи школьной геометрии. Базовый и профильный уровни', NULL, NULL, N'Москва', 1, 2015, 96, 3000, NULL)
		, (44, '517', N'22.16,В19', '978-5-4439-1143-4', N'Геометрия дискриминанта', NULL, NULL, N'Москва', 1, 2017, 16, 2000, NULL)
		, (45, '51(07)', N'22.1,Ш24', '978-5-4439-0342-2', N'Принцип узких мест', 4, 'S', N'Москва', 1, 2015, 40, 2000, NULL)
		, (46, '519.2', N'22.17,Ч-58', '5-211-00955-X', N'Задачи по математической статистике', NULL, NULL, N'Москва', 1, 1990, 171, 11800, NULL)
		, (47, '514.11,В19', N'22.151.0', '5-900916-60-X', N'Прямые и кривые', 3, 'R', N'Москва', 1, 2000, 128, 3000, NULL)
		, (48, '517.43', NULL, NULL, N'Дифференциальное исчисление в векторных пространствах без нормы', NULL, NULL, N'Москва', 2, 1970, 168, NULL, NULL)
		, (49, NULL, NULL, '5-87597-005-7', N'Программы обязательных курсов. Специальность математика, прикладная математика', NULL, NULL, N'Москва', 11, 1993, 136, 2000, NULL)
		, (50, '512.8', N'517.1,Ц 14', NULL, N'Основы теории категорий', NULL, NULL, N'Москва', 5, 1974, 256, 6400, NULL)
		, (51, '513.83', N'517.6,П56', NULL, N'Основы комбинаторной топологии', 2, NULL, N'Москва', 5, 1976, 136, 17000, NULL)
		, (52, NULL, NULL, NULL, N'Программы обязательных курсов. Специальность механика, прикладная математика', NULL, NULL, N'Москва', 11, 1993, 92, 2000, NULL)
		, (53, '517.9', N'22.162,Х17', NULL, N'Ограниченные интегральные операторы в пространствах L^2', NULL, NULL, N'Москва', 5, 1985, 160, 6100, NULL)
		, (54, '512.817.3', N'22.144,А84', '978-5-94057-282-4', N'Экспериментальное наблюдение математических фактов', NULL, NULL, N'Москва', 1, 2006, 120, 2000, N'Летняя шкла "Современная математика". Дубна, июль 2005')
		, (55, '513.836:513.838', NULL, NULL, N'Теорема об h-кобордизме', NULL, NULL, N'Москва', 2, 1969, 116, NULL, NULL)
		, (56, '519.4', NULL, NULL, N'Введение в алгебраическую K-теорию', NULL, NULL, N'Москва', 2, 1974, 200, NULL, NULL)
		, (57, '517.0(075.8)', NULL, NULL, N'Математический анализ. Второй специальный курс', 2, 'RC', N'Москва', 7, 1984, 208, 11400, NULL)
		, (58, '517.1', NULL, NULL, N'Математическая логика. Дополнительные главы', NULL, NULL, N'Москва', 7, 1984, 120, 13150, NULL)
		, (59, '517.1', NULL, NULL, N'Введение в математическую логику', NULL, NULL, N'Москва', 7, 1982, 120, 29500, NULL)
		, (60, NULL, NULL, NULL, N'Неожиданный шаг или сто тринадцать красивых задач (Методическое пособие)', NULL, NULL, N'Киев', 12, 1993, 64, 25000, NULL)
		, (61, '517.2,Х20', NULL, NULL, N'Ряды Фурье', 2, 'S', N'Москва', 3, 1962, 156, 25000, NULL)
		, (62, '519.50', NULL, NULL, N'Теория множеств и метод форсинга', NULL, NULL, N'Москва', 2, 1973, 152, NULL, NULL)
		, (63, '515.176.3', N'22.15,Н33', '978-5-94057-647-1', N'Введение в пучки, расслоения и классы черна', NULL, NULL, N'Москва', 1, 2010, 48, 1000, NULL)
		, (64, '811.111 (075.8)+510', '81.2Англ.-9+22.1,С66', '978-5-4439-1242-4', N'Mathematical English. Учебник английского для математиков', NULL, NULL, N'Москва', 1, 2017, 88, 2000, NULL)
		, (65, NULL, N'81.2 Англ,С66', '5-88688-032-1', N'Как написать математическую статью по-ангийски', NULL, NULL, N'Москва', 13, 1998, 112, 1000, NULL)
		, (66, NULL, N'22.151,Г73', '5-88688-032-1', N'Решение геометрических задач аналитическим методом. Пособие для учащихся 9 и 10 кл', NULL, NULL, N'Москва', 4, 1979, 128, 455000, 'Библ.')
		, (67, NULL, NULL, NULL, N'Геометрия. Учебник для 9-10 классов средней школы. Часть вторая. Стереометрия.', 27, NULL, N'Москва', 4, 1965, 104, 500000, NULL)
		, (68, '517.94', NULL, NULL, N'Лекции по теории интегральных уравнений', 4, 'R', N'Москва', 7, 1984, 136, 13500, NULL)
		, (69, '519.9', N'517, Ш 47', NULL, N'Степени неразрешимости', NULL, NULL, N'Москва', 5, 1977, 192, 10000, NULL)
		, (70, '51(075.4)', N'51, А 64', NULL, N'Задачи по математике предлагавшиеся в вузах на всткпительных экзаменах (с решениями)', NULL, NULL, N'Минск', 14, 1976, 160, 200000, NULL)
		, (71, '519.6', N'В19,Д93', '5-88688-008-9', N'Десять лекций по физической математике', NULL, NULL, N'Москва', 13, 1997, 64, 1000, NULL)
		, (72, '51', N'22.1,С 48', '5-03-002367-4', N'Математические фантазии. Приложения элементарной математики', NULL, NULL, N'Москва', 2, 1993, 184, 10000, 'Перевод с англ. ISBN 0-939765-004')
		, (73, '512.54', NULL, '5-02-030328-3', N'Слойно конечные группы', NULL, NULL, N'Новосибирск', 2, 1993, 159, 400, NULL)
		, (74, '512.62+512.12', N'22.144+22.152 Х68', '5-94057-266-9', N'Теория Галуа, накрытия и римановы поверхности', NULL, NULL, N'Москва', 1, 2007, 96, 1000, NULL)
		, (75, '511', N'22.13,А84', '5-94057-222-7', N'Динамика, статика и проективная геометрия полей Галуа', NULL, NULL, N'Москва', 1, 2005, 72, 3000, NULL)
		, (76, '51(023)', N'22.12,К19', '978-5-94057-471-2', N'Как решают нестандартные задачи', 5, 'R', N'Москва', 1, 2009, 96, 5000, NULL)
		, (77, '512', N'22.14,П 63', '5-88688-063-1', N'Теория Галуа', NULL, NULL, N'Москва', 13, 2003, 304, 500, NULL)
		, (78, '517.5', N'22.162,С 15', '5-88688-072-0', N'Теория интеграла', NULL, NULL, N'Москва', 13, 2004, 964, 500, N'Воспроизведена по М:ИЛ 1949 г. Ориг. англ. 1939 г.')
		, (79, '512', N'22.14,Л 21', '5-88688-073-9', N'Кольца и модули', NULL, NULL, N'Москва', 13, 2005, 283, 400, N'Рус. М:Мир 1971 г. Ориг. англ. 1966 г.')
		, (80, '512', N'22.14,А 92', '5-88688-067-4', N'Введение в коммутативную алгебру', NULL, NULL, N'Москва', 13, 2003, 144, 700, N'Рус. М:Мир 1972 г. Ориг. англ. 1969 г.')
		, (81, '517.5', N'22.162,Х 17', '5-88688-065-8', N'Теория меры', NULL, NULL, N'Москва', 13, 2003, 256, 1000, N'Воспроизведена по М:ИЛ 1953 г. Ориг. англ. 1950 г.; Халмош Пол')
		, (82, '513.83', NULL, NULL, N'Дифференциальная топология', NULL, NULL, N'Москва', 2, 1979, 280, 10000, NULL)
		, (83, '513.836', N'22.14,Г 51', NULL, N'Когомологии топологических групп и алгебр Ли', NULL, NULL, N'Москва', 2, 1984, 258, 4000, N'Перевод с французского')
		, (84, '514.1', N'22.151.44,М 155', '978-5-4344-0056-5', N'Введение в симплектическую топологию', NULL, NULL, N'Москва-Ижевск', 16, 2012, 568, 4000, N'Перевод со 2-го англ издания 1998 г.')
		, (85, '517.43', NULL, '5-211-037-11-1', N'Геометрические методы в теории спектров', NULL, NULL, N'Москва', 7, 1996, 63, 500, NULL)
		, (86, '51(07)', N'22.1,А 84', '978-5-4439-0164-0', N'Задачи для детей от 5 до 15 лет', 6, 'S', N'Москва', 1, 2014, 16, 3000, NULL)
		, (87, NULL, N'22.141,О 53', '5-211-01572-X', N'Нестандартные методы решения уравнений и неравенств', NULL, NULL, N'Москва', 7, 1991, 144, 28700, NULL)
		, (88, '514.1(023)', N'22.151,К 72', '5-02-014198-4', N'Геометрические построения одним циркулем на плоскости и одним лишь сферографом в пространстве', 3, 'RC&E', N'Москва', 5, 1989, 112, 138000, NULL)
		, (89, '517', N'22.161.6,Д33', '5-211-03079-6', N'Введение в теорию обратных задач', NULL, NULL, N'Москва', 7, 1994, 208, 2000, NULL)
		, (90, '519.61', N'22.193,И42', '5-02-014462-2', N'Несимметричная проблема собственных значений. Численные методы', NULL, NULL, N'Москва', 5, 1991, 240, 1800, NULL)
		, (91, '519.1', N'16.2.12,Н58', '5-7035-0157-X', N'Курс дискретной математики', NULL, NULL, N'Москва', 17, 1992, 264, 20000, NULL)
		, (92, NULL, NULL, NULL, N'Популярная комбинаторика', NULL, NULL, N'Москва', 5, 1975, 208, 100000, NULL)
		, (93, NULL, NULL, NULL, N'Теория связностей в целом и группы голономий', NULL, NULL, N'Москва', 18, 1960, 216, NULL, N'Перевод с фр. издания 1955 г. ROME')
		, (94, '513.83+519.4', NULL, NULL, N'Введение в кусочно линейную топологию', NULL, NULL, N'Москва', 2, 1974, 208, NULL, NULL)
		, (95, NULL, NULL, NULL, N'Комплексные многообразия', NULL, NULL, N'Москва', 18, 1961, 240, NULL, NULL)
		, (96, NULL, NULL, NULL, N'Алгебраические многообразия', NULL, NULL, N'Москва', 18, 1961, 316, NULL, N'Англ. издание 1956 г.')
		, (97, '517.7', NULL, NULL, N'Эллиптические функции по Эйзенштейну и Кронекеру', NULL, NULL, N'Москва', 2, 1978, 112, NULL, NULL)
		, (98, NULL, NULL, NULL, N'Комплексные аналитические многообразия. Эллиптические уравнения с частными производными', NULL, NULL, N'Москва', 2, 1964, 212, NULL, N'Перевод с испанского изд. 1956-го г.')
		, (99, '517.53.57', N'22.16,Л89', '5-94057-137-9', N'Лекции по комплексному анализу', NULL, NULL, N'Москва', 1, 2004, 136, 1000, NULL)
		, (100, '514.132', N'22.151.2,П70', '5-94057-166-2', N'Геометрия Лобачевского', 3, 'R&E', N'Москва', 1, 2004, 88, 2000, NULL)
		, (101, '517.43:519.53+519.2', N'22.162,Р56', NULL, N'Принципы современной математической физики', NULL, NULL, N'Москва', 2, 1982, 488, 20000, N'Перевод с изд. 1978 г.')
		, (102, '513.0', NULL, NULL, N'Геометрия', NULL, NULL, N'Москва', 2, 1970, 240, NULL, N'Перевод с франц. изд. 1964 г.')
		, (103, NULL, NULL, '5-7036-0105-3', N'Экспериментальная математика', NULL, NULL, N'Москва', 19, 2005, 64, NULL, NULL)
		, (104, '519.4', '517.1,М 12', NULL, N'Комбинаторная теория групп. Представление групп в терминах образующих и соотношений', NULL, NULL, N'Москва', 5, 1974, 456, 10800, N'Перевод с изд. 1966 г.')
		, (105, '519.1+519.4', '517.1,М 12', NULL, N'Комбинаторная теория групп', NULL, NULL, N'Москва', 2, 1980, 456, 7700, N'Перевод с изд. 1977 г.')
		, (106, '515.14', N'22.15,П70', '978-5-94057-349-4', N'Задачи по топологии', NULL, NULL, N'Москва', 1, 2008, 40, 1000, NULL)
		, (107, '517.53.57', N'22.16,Н33', '978-5-4439-0101-5', N'Курс комплексного анализа', NULL, NULL, N'Москва', 1, 2012, 48, 1000, NULL)
		, (108, '514/515', N'22.1,А84', '978-5-94057-462-0', N'Геометрия комплексных чисел, кватернионов и спинов', 2, 'S', N'Москва', 1, 2009, 40, 1000, NULL)
		, (109, '513', '517.5,Х 14', NULL, N'Лекции об объеме, площади поверхности и изоперимитрии', 2, 'S', N'Москва', 5, 1966, 416, 7000, N'Перевод с немецк. издания 1957-го г.')
		, (110, '511(075.8)', N'22.13я73,П 82', '978-5-94280-453-4', N'Теория чисел: задачи и решения. Учебно-практическое пособие', NULL, NULL, N'Москва', 20, 2010, 72, 1000, NULL)
		, (111, NULL, NULL, NULL, N'Алгебраическая структура пространства-времени и алгебродинамика', NULL, NULL, N'Москва', 21, 1992, 149, 1000, NULL)
		, (112, '511(075.8)', N'22.14я73,П 82', '978-5-94280-489-3', N'Общая алгебра: задачи и решения. Учебно-практическое пособие', NULL, NULL, N'Москва', 20, 2009, 96, 1000, NULL)
		, (113, '512.62:514.112', N'22.151.5,П56', '5-94057-152-2', N'Алгебра комплексных чисел в геометрических задачах:Книга для учащихся математических классов школ, учителей и студентов педагогических вузов', NULL, NULL, N'Москва', 1, 2004, 160, 2000, NULL)
		, (114, NULL, NULL, '5-80100-120-4', N'Теория Морса', NULL, NULL, N'Москва', 9, 1996, 184, NULL, NULL)
		, (115, '510(023)', '512,Б 12', '', N'Задачи математических олимпиад', NULL, NULL, N'Москва', 5, 1975, 112, NULL, NULL)
		, (116, '517.9', '517.2,Ф53', '5-02-014663-3', N'Сборник задач по дифференциальным уравнениям.', 3, 'S', N'Москва', 5, 1970, 96, 75000, NULL)
		, (117, '514.112', N'22.151.0,В68', '978-5-4439-2818-0', N'Геометрии в задачах. 7-8 классы', 3, 'S', N'Москва', 1, 2019, 208, 1500, NULL)
		, (118, '373.167.1:51', N'22.1я72,С72', '978-5-09-057216-3', N'Тысяча и одна задача по математике. 5-7 классы. Учебное пособие для общеобразовательных организаций', 8, NULL, N'Москва', 4, 2018, 207, 3000, NULL)
		, (119, '51(023)', N'22.1,С72', '978-5-4439-2843-2', N'Математический кружок. 6-7 классы', 10, 'S', N'Москва', 1, 2009, 128, 2000, NULL)
		, (120, '514.11', N'22.151.0,Е45', '978-5-4439-2648-3', N'Задачи на разрезание', 7, 'S', N'Москва', 1, 2018, 120, 2000, NULL)
		, (121, '514.11', N'22.151,К17', '978-5-4439-0381-1', N'Геометрия. 10-11 классы.', 2, 'S', N'Москва', 1, 2015, 640, 1000, N'Учебник для общеобразовательных учреждений. Профильный уровень.')
		, (122, '514.1', N'22.151,К17', '978-5-94057-582-5', N'Сборник задач по геометрии. 10-11 классы.', NULL, NULL, N'Москва', 1, 2011, 160, 1500, N'Учебное пособие для общеобразовательных учреждений. Профильный уровень.')
		, (123, '517.53', '517.2,Г 63', NULL, N'Распределение значений мероморфных функций', NULL, NULL, N'Москва', 5, 1970, 592, 7800, NULL)
		, (124, NULL, NULL, NULL, N'Гомологическая алгебра', NULL, NULL, N'Москва', 18, 1960, 512, NULL, N'Перевод с издания 1956-го г.')
		, (125, '51', '74.200.58:22.1,Э45', '978-5-4439-1239-4', N'Элементы математики в задачах. Через олимпиады и кружки - к профессии', NULL, NULL, N'Москва', 1, 2018, 592, 3000, NULL)
		, (126, '51(07)', N'22.1,Л89', '978-5-4439-1372-8', N'Что не так? Математические парадоксы и софизмы', NULL, NULL, N'Москва', 1, 2019, 56, 3000, NULL)
		, (127, '51(075.4)', N'22.1,П62', '5-02-013745-6', N'Пособие по математике для поступающих в вузы', 3, 'RC', N'Москва', 5, 1988, 720, 300000, NULL)
		, (128, '51', '74.200.58:22.1,М42', '978-5-4439-1107-6', N'Турнир городов: мир математики в задачах', 2, 'R', N'Москва', 1, 2017, 472, 1500, NULL)
		, (129, NULL, NULL, NULL, N'Введение в метаматематику', NULL, NULL, N'Москва', 18, 1957, 528, NULL, NULL)
		, (130, '51', '51,К88', NULL, N'Мысли о современной математике и ее изучении', NULL, NULL, N'Москва', 5, 1977, 112, 100000, NULL)
		, (131, NULL, '512,С58', NULL, N'Путь в современную математику', NULL, NULL, N'Москва', 2, 1972, 200, NULL, NULL)
		, (132, NULL, NULL, NULL, N'Алгебраический подход к схемам отношений теории кодирования', NULL, NULL, N'Москва', 2, 1976, 136, NULL, NULL)
		, (133, NULL, NULL, NULL, N'Математическая смесь', 2, 'S', N'Москва', 5, 1965, 152, 100000, NULL)
		, (134, '51', N'22.1,Л 64', '5-02-014332-4', N'Математическая смесь', 5, 'R', N'Москва', 5, 1990, 144, 200000, NULL)
		, (135, '519.51', N'22.1,К60', '5-02-014453-3', N'Математика в ее историческом развитии', NULL, NULL, N'Москва', 5, 1991, 224, 21000, NULL)
		, (136, '51(07)', N'22.1,А84', '978-5-94057-426-2', N'Что такое математика', 2, 'S', N'Москва', 1, 2008, 104, 1000, NULL)
		, (137, NULL, N'22.1 Г,М77', '5-8037-0047-9', N'Современная математика в отблеске медалей Филдса', NULL, NULL, N'Москва', 22, 2000, 200, 1000, NULL)
		, (138, NULL, '517.8,К66', NULL, N'Математика изучает случайности. Пособие для учащихся', NULL, NULL, N'Москва', 4, 1975, 223, 120000, NULL)
		, (139, '512', NULL, NULL, N'Пособие по математике', NULL, NULL, N'Москва', 7, 1979, 192, 20000, N'для учащихся заочных подготовительных курсов естественных факультетов МГУ')
		, (140, '513.8', '517.5, Б79', NULL, N'Теоремы и задачи комбинаторной геометрии', NULL, NULL, N'Москва', 5, 1965, 108, 23000, NULL)
		, (141, '514.113', N'22.1, П64', '5-211-02670-5', N'Задачи по стереометрии', NULL, NULL, N'Москва', 7, 1992, 16, 53700, NULL)
		, (142, '511', N'22.1,К53', '978-5-4439-1126-7', N'Азы теории чисел', NULL, NULL, N'Москва', 1, 2017, 80, 3000, NULL)
		, (143, '51(07)', N'22.1,Ш24', '978-5-4439-0666-9', N'Как построить пример?', 3, 'S', N'Москва', 1, 2016, 80, 2000, NULL)
		, (144, '51(07)', N'22.1,Р24', '978-5-4439-2554-7', N'Логика для всех: от пиратов до мудрецов', 2, 'S', N'Москва', 1, 2017, 208, 2000, NULL)
		, (145, '51(07)', N'22.1,К53', '978-5-4439-2782-4', N'Взвешивания и алгоритмы: от головоломок к задачам', 6, 'S', N'Москва', 1, 2016, 104, 2000, NULL)
		, (146, '51(07)', N'22.1,Б69', '978-5-4439-2783-1', N'Геометрия в негеометрических задачах', 2, 'S', N'Москва', 1, 2018, 160, 2000, NULL)
		, (147, '51(07)', N'22.1,Б69', '978-5-4439-1260-8', N'Последовательности', NULL, NULL, N'Москва', 1, 2018, 160, 3000, NULL)
		, (148, '51(07)', N'22.1,Ч81', '978-5-4439-2781-7', N'Арифметические задачи', 7, 'S', N'Москва', 1, 2018, 64, 2000, NULL)
		, (149, '51(07)', N'22.1,С26', '978-5-4439-1358-2', N'Геометрия на подвижных чертежах', NULL, NULL, N'Москва', 1, 2018, 184, 3000, NULL)
		, (150, '519.17', N'22.176,Г95', '978-5-4439-2528-8', N'Графы', 6, 'S', N'Москва', 1, 2017, 32, 2000, NULL)
		, (151, '51(07)', N'22.1,М52', '978-5-4439-2746-6', N'Длина, площадь, объём', 5, 'S', N'Москва', 1, 2018, 48, 2000, NULL)
		, (152, '51(07)', N'22.1,С26', '978-5-4439-2748-0', N'Делимость и простые числа', 5, 'R', N'Москва', 1, 2018, 120, 2000, NULL)
		, (153, '51(07)', N'22.1,Б69', '978-5-4439-1111-3', N'Геометрические задачи на построение', 4, 'S', N'Москва', 1, 2017, 152, 2000, NULL)
		, (154, '51(07)', N'22.1,Б69', '978-5-4439-2684-1', N'Непрерывность', 2, 'S', N'Москва', 1, 2018, 160, 2000, NULL)
		, (155, '51(07)', N'22.1,Ш24', '978-5-4439-2685-8', N'Математические конструкции: от хижин к дворцам', 2, 'S', N'Москва', 1, 2018, 176, 2000, NULL)
		, (156, '51(07)', N'22.1,З36', '978-5-4439-0601-0', N'Задачи о турнирах', NULL, NULL, N'Москва', 1, 2013, 104, 3000, NULL)
		, (157, '51(07)', N'22.1,Б69', '978-5-4439-0931-8', N'Классические средние в арифметике и геометрии', 3, 'S', N'Москва', 1, 2016, 168, 2000, NULL)
		, (158, '512', N'22.14,В48', '978-5-4439-0209-8', N'Курс алгебры', 3, 'E', N'Москва', 1, 2017, 592, 2000, NULL)
		, (159, '519.2', NULL, NULL, N'Анализ стационарных и однородных случайных систем', NULL, NULL, N'Москва', 7, 1987, 240, 2870, NULL)
		, (160, '51', N'22.1', '978-5-4439-0687-4', N'Как готовиться к математическим боям. 400 задач Турниров имени А.П.Савина', 2, 'R', N'Москва', 1, 2017, 253, 2000, NULL)
		, (161, '51(07)', N'22.1,А53', '978-5-4439-0993-6', N'18 х 18. Вступительные задачи ФМШ при МГУ', 3, 'R&E', N'Москва', 1, 2017, 224, 2000, NULL)
		, (162, '51', N'22.1,А72', '978-5-4439-1020-8', N'Семь шагов. Олимпиады юношеской математической школы 2008-2014 годов', NULL, NULL, N'Москва', 1, 2016, 224, 2000, NULL)
		, (163, '514.7', N'22.151,К55', NULL, N'Группы преобразований в дифференциальной геометрии', NULL, NULL, N'Москва', 5, 1986, 224, 6650, NULL)
		, (164, '501', N'22.1я72', '978-5-4439-1000-0', N'Задачи с параметрами, сложные и нестандартные задачи', NULL, NULL, N'Москва', 1, 2016, 232, 2000, NULL)
		, (165, NULL, NULL, NULL, N'Механико-математический факультет (проспект для поступающих)', 3, NULL, N'Москва', 8, 2008, 80, 500, NULL)
		, (166, NULL, NULL, NULL, N'Избранные задачи и теоремы элементарной математики. Часть 1. Арифметика и алгебра.', NULL, NULL, N'Москва, Ленинград', 23, 1950, 296, 2500, NULL)
		, (167, '512.7', N'22.14,Х 20', '5-03-003399-8', N'Модули кривых. Вводный курс.', NULL, NULL, N'Москва', 2, 2004, 448, 1500, NULL)
		, (168, '513.83', NULL, NULL, N'Гладкие периодические отображения', NULL, NULL, N'Москва', 2, 1969, 340, NULL, NULL)
		, (169, '519.1', N'22.17,Я47', '978-5-4439-2866-1', N'Комбинаторика для олимпиадников', 3, 'S', N'Москва', 1, 2019, 80, 1000, NULL)
		, (170, '515.16', N'22.15,С66', '978-5-4439-2848-7', N'Узлы и косы', 3, 'S', N'Москва', 1, 2019, 24, 2000, NULL)
		, (171, '512.815', N'22.14,Ж51', '978-5-94057-302-9', N'Компактные группы Ли и их представления', 2, 'E', N'Москва', 1, 2007, 552, 1500, NULL)
		, (172, '517.5', N'22.14,Ж50', '5-88688-053-4', N'Введение в теорию представлений', NULL, NULL, N'Москва', 13, 2001, 136, 1000, NULL)
		, (173, '511.3', N'22.132,К53', '5-88688-069-0', N'Эллиптические кривые', NULL, NULL, N'Москва', 13, 2004, 488, 1000, NULL)
		, (174, '512.81', N'22.151,Х40', '978-5-4439-0238-8', N'Геометрия бесконечномерных групп', NULL, NULL, N'Москва', 1, 2014, 368, 1000, NULL)
		, (175, '514.7', N'22.151,Х36', '5-88688-076-3', N'Дифференциальная геометрия, группы Ли и симметрические пространства', NULL, NULL, N'Москва', 13, 2005, 608, 800, NULL)
		, (176, '517.5', '517.2,Ж 51', '5-94057-115-8', N'Основные структуры и методы теории представлений', NULL, NULL, N'Москва', 1, 2004, 488, 1000, NULL)
		, (177, '512', N'22.14,К 89', '5-88688-079-8', N'Гомологическая теория групп', NULL, NULL, N'Москва', 13, 2006, 352, 400, NULL)
		, (178, '514', N'22.151,Р64', '5-94057-032-1', N'Геометрия групп Ли. Симметрические, параболические и переодические пространства', NULL, NULL, N'Москва', 1, 2003, 560, 1000, NULL)
		, (179, '517.56', '517.2,В44', NULL, N'Специальные функции и теория представлений групп', NULL, NULL, N'Москва', 5, 1965, 588, 12225, NULL)
		, (180, '517.955', N'22.161.6,В26', '5-02-013747-2', N'Обобщенные аналитические функции', 2, 'RC', N'Москва', 5, 1988, 512, 5000, NULL)
		, (181, '513.6', N'22.152.4,О-51', NULL, N'Векторные расслоения на комплексных проективных пространствах', NULL, NULL, N'Москва', 2, 1984, 312, 3400, NULL)
		, (182, '513.6', NULL, NULL, N'Абелевы многообразия', NULL, NULL, N'Москва', 2, 1971, 300, NULL, NULL)
		, (183, NULL, NULL, '5-87597-004-9', N'Практическое решение уравнений математической физики. Учебно-методическое пособие для студентов университетов', NULL, NULL, N'Москва', 25, 1993, 155, 5000, NULL)
		, (184, '517.8', N'22.17,Л61', '5-03-000979-5', N'Комбинаторика для программистов', NULL, NULL, N'Москва', 2, 1988, 213, 45000, N'Перевод с польского издания 1982 г.')
		, (185, '530.10(075.4)', '530.1,Б83', NULL, N'Механика. Теория и задачи.', NULL, NULL, N'Москва', 5, 1967, 208, 100000, NULL)
		, (186, '51(075.3)', N'22.1,А94', NULL, N'Сборник задач по математике для техникумов на базе средней школы', NULL, NULL, N'Москва', 5, 1987, 208, 260000, NULL)
		, (187, '512', N'22.14,А 86', '5-88688-071-2', N'Линейная алгебра и выпуклая геометрия', NULL, NULL, N'Москва', 13, 2004, 160, 1000, NULL)
		, (188, '513.83', N'22.15,С 50', '5-88688-054-2', N'Cимплициальные и операдные методы в алгебраической топологии', NULL, NULL, N'Москва', 13, 2002, 272, 500, N'Cимплициальные и операдные методы в теории гомотопий')
		, (189, '513.6+513.7', N'22.14,22.15, М 23', '5-88688-057-7', N'Фробениусовы многообразия, квантовые когомологии и пространства модулей', NULL, NULL, N'Москва', 13, 2002, 334, 500, N'Перевод с английского с издания 1999 г.')
		, (190, '511.331', N'22.13,В 75', '5-02-014120-8', N'Дзета-функция Римана', NULL, NULL, N'Москва', 5, 1994, 376, 1000, NULL)
		, (191, '511.331', N'22.13,В 75', '5-02-014120-8', N'Проективная геометрия', 2, 'R&E', N'Москва', 26, 1963, 344, 25000, NULL)
		, (192, '519.4', NULL, NULL, N'Частично упорядоченные алгебраические системы', NULL, NULL, N'Москва', 2, 1965, 344, NULL, NULL)
		, (193, '517.43+519.55', NULL, NULL, N'Теория обобщенных функций. Секвенциальный подход', NULL, NULL, N'Москва', 2, 1976, 312, NULL, NULL)
		, (194, '517.9', N'22.161.6,Х35', NULL, N'Теория Функционально-дифференциальных уравнений', NULL, NULL, N'Москва', 2, 1984, 421, 5800, NULL)
		, (195, '517+514.84', N'22.16+22.314,О60', '5-03-001422-5', N'Операторы Шрёдингера с приложениями к квантовой механике и глобальной геометрии', NULL, NULL, N'Москва', 2, 1990, 408, 4150, NULL)
		, (196, NULL, '74.58,А65', NULL, N'Эвристическое программирование учебно-исследовательской деятельности', NULL, NULL, N'Москва', 26, 1981, 240, 6000, NULL)
		, (197, NULL, '23-5-4', NULL, N'Теория обобщенных групп', NULL, NULL, N'Харьков, Киев', 27, 1937, 176, 2000, NULL)
		, (198, NULL, NULL, NULL, N'Алгебраическая теория чисел', NULL, NULL, N'Москва', 18, 1947, 228, 2000, NULL)
		, (199, '511.8', NULL, NULL, N'Диофантовы приближения и трансцендентные числа', NULL, NULL, N'Москва', 7, 1982, 264, 2500, NULL)
		, (200, '513.731', N'22.151,Р 86', NULL, N'Дифференциальная геометрия финслеровых пространств', NULL, NULL, N'Москва', 5, 1981, 504, 4000, NULL)
		, (201, '373,167.1:512', N'22.141я71.6,Ш 32', NULL, N'Доказательство неравенств. Математическая индукция. Теория сравнений. Введение в криптографию', NULL, NULL, N'Москва', 1, 2018, 396, 800, NULL)
		, (202, '512.1+517.1+511.1', N'22.141+22.161.6,П70', '978-5-94057-263-3', N'Задачи по алгебре, арифметике и анализу.Учебное пособие.', NULL, NULL, N'Москва', 1, 2007, 608, 2000, NULL)
		, (203, NULL, '74.262.21,Д13', '978-5-940057-360-9', N'Математический анализ в 57-й школе. Четырехгодичный курс.', NULL, NULL, N'Москва', 1, 2008, 176, 3000, NULL)
		, (204, '514.112', N'22.151.0,П70', '978-5-94057-304-3', N'Задачи по планиметрии.', 6, 'S', N'Москва', 1, 2007, 640, 5000, NULL)
		, (205, '514.112', N'22.151.0,П70', '978-5-94057-605-1', N'Задачи по стереометрии.', NULL, NULL, N'Москва', 1, 2010, 352, 2000, NULL)
		, (206, '512.554+517.986', N'22.162, Ж50', '5-02-014249-2', N'Представления редуктивных алгебр Ли', NULL, NULL, N'Москва', 5, 1994, 352, 1000, NULL)
		, (207, '513.836+512.8', NULL, NULL, N'Гомотопически инвариантные алгебраические структуры на топологических пространствах', NULL, NULL, N'Москва', 2, 1977, 408, NULL, NULL)
		, (208, '519.48', NULL, NULL, N'Свободные кольца и их связи', NULL, NULL, N'Москва', 2, 1975, 424, NULL, NULL)
		, (209, '515.12', N'22.152,Э 62', NULL, N'Общая топология', NULL, NULL, N'Москва', 2, 1986, 752, 8000, NULL)
		, (210, '515.14', N'22.152,М15', '978-5-94057-087-5', N'Путеводитель по спектральным последовательностям', NULL, NULL, N'Москва', 1, 1986, 664, 1000, N'Перевод с англ издания 2001-го г.')
		, (211, '515.14+517.95', N'22.152+22.161.6,К28', '5-03-003-116-2', N'Пучки на многообразиях', NULL, NULL, N'Москва', 2, 1997, 656, 1000, NULL)
		, (212, '515.1', N'22.152,Б53', '5-03-002065-9', N'Многообразия Эйнштейна. В 2-х томах. Том I', NULL, NULL, N'Москва', 2, 1990, 318, 4250, NULL)
		, (213, '515.1', N'22.152,Б53', '5-03-002066-7', N'Многообразия Эйнштейна. В 2-х томах. Том II', NULL, NULL, N'Москва', 2, 1990, 384, 4250, NULL)
		, (214, '512.7', N'22.14,Ф94', '5-03-000849-7', N'Теория пересечений', NULL, NULL, N'Москва', 2, 1989, 583, 3200, NULL)
		, (215, '512.547', N'22.144,П71', '5-03-001331-8', N'Группы петель', NULL, NULL, N'Москва', 2, 1990, 456, 3800, NULL)
		, (216, NULL, '11-5-2', NULL, N'Энциклопедия элементарной математики. Книга первая. Арифметика.', NULL, NULL, N'Москва,Ленинград', 30, 1951, 448, 50000, NULL)
		, (217, NULL, '11-5-2', NULL, N'Энциклопедия элементарной математики. Книга вторая. Алгебра.', NULL, NULL, N'Москва,Ленинград', 30, 1951, 424, 50000, NULL)
		, (218, NULL, NULL, NULL, 'Теория меры.', NULL, NULL, N'Москва', 18, 1953, 292, NULL, NULL)
		, (219, '513.83', NULL, NULL, 'Теория гомологий. Введение в алгебраическую топологию', NULL, NULL, N'Москва', 2, 1966, 452, NULL, NULL)
		, (220, '512.7+53', '22.31,К 55', '978-5-4439-0206-7', N'Зеркальная симметрия и алгебраическая геометрия', NULL, NULL, N'Москва', 1, 2012, 576, 1000, NULL)
		, (221, '514+515.1+517', N'22.151+22.152+22.16,Г87', '5-03-001297-4', N'Дифференциальные соотношения с частными производными', NULL, NULL, N'Москва', 2, 1990, 536, 3000, NULL)
		, (222, '517.5', N'22.162,М52', '5-88688-016-X', N'C*-алгебры и теория операторов', NULL, NULL, N'Москва', 13, 1997, 336, 1000, NULL)
		, (223, '517.986.32+515.164+515.168', N'22.15,С 60', '5-88688-009-7', N'C*-алгебры и эллиптические операторы в дифференциальной топологии', NULL, NULL, N'Москва', 13, 1996, 352, 1000, NULL)
		, (224, '513.83', NULL, NULL, N'K-теория. Введение', NULL, NULL, N'Москва', 2, 1981, 360, 5400, NULL)
		, (225, '511.3', N'22.132,М22', '5-03-000745-8', N'Лекции о тэта-функциях', NULL, NULL, N'Москва', 2, 1988, 448, 3900, NULL)
		, (226, '519.3', N'22.161.8,Г85', NULL, N'Внешние дифференциальные системы и вариационное исчисление', NULL, NULL, N'Москва', 2, 1986, 360, 5000, NULL)
		, (227, '515.16', N'22.152,Ц75', '5-02-013728-6', N'Поверхности и разрывные группы', NULL, NULL, N'Москва', 5, 1988, 688, 2150, NULL)
		, (228, '512.9', N'22.144,Б30', NULL, N'Тождества в алгебрах Ли', NULL, NULL, N'Москва', 5, 1985, 448, 4300, NULL)
		, (229, '512.24', N'22.144,О56', '5-02-013916-5', N'Геометрия определяющих соотношений в группах', NULL, NULL, N'Москва', 5, 1989, 448, 2330, NULL)
		, (230, '512.81+517.9', N'22.15+22.16,Х36', NULL, N'Группы и геометрический анализ', NULL, NULL, N'Москва', 2, 1987, 736, 5300, NULL)
		, (231, '517.838', NULL, NULL, N'Геометрия многообразий', NULL, NULL, N'Москва', 2, 1967, 336, NULL, NULL)
		, (232, '512.572', N'22.144,Р17', '5-02-013917-3', N'Тождества алгебр и их представлений', NULL, NULL, N'Москва', 5, 1989, 432, 2000, NULL)
		, (233, '512.8', '517.1,Ш46', NULL, N'Формации конечных групп', NULL, NULL, N'Москва', 5, 1978, 272, 4500, NULL)
		, (234, '519.41/47', N'22.144,Ч 49', NULL, N'Группы с заданными свойствами системы подгрупп', NULL, NULL, N'Москва', 5, 1980, 384, 3300, NULL)
		, (235, '512.86', N'22.14,М52', NULL, N'Рациональные группы', NULL, NULL, N'Москва', 5, 1980, 464, 5400, NULL)
		, (236, '511+512', N'22.144,И97', '5-02-013913-0', N'Задача погружения в теории Галуа', NULL, NULL, N'Москва', 5, 1990, 272, 2100, NULL)
		, (237, NULL, NULL, NULL, N'Полугруппы', NULL, NULL, N'Москва', 5, 1960, 592, 6000, NULL)
		, (238, NULL, NULL, NULL, N'Предельные множества', NULL, NULL, N'Москва', 18, 1963, 256, NULL, NULL)
		, (239, '519.6(075.8)', N'22.19,Б30', NULL, N'Численные методы', NULL, NULL, N'Москва', 5, 1987, 600, 35500, NULL)
		, (240, '517.947', '517.2,П.14', NULL, N'Линейные дифференциальные операторы с постоянными коэффициентами', NULL, NULL, N'Москва', 5, 1967, 488, 10000, NULL)
		, (241, '517.52+518.5', NULL, NULL, N'Специальные математические функции и их аппроксимации', NULL, NULL, N'Москва', 2, 1980, 608, 23000, NULL)
		, (242, '517.7', '517.2,А 95', NULL, N'Элементы теории эллиптических функций', 2, 'RC', N'Москва', 5, 1970, 304, 13000, NULL)
		, (243, '51(023)', N'22.10,В19', NULL, N'Заочные математические олимпиады', 2, 'RC', N'Москва', 5, 1987, 176, 500000, NULL)
		, (244, '51', N'22.1,М82', '5-900916-78-2', N'Московские математические регаты', NULL, NULL, N'Москва', 1, 2001, 96, 5000, NULL)
		, (245, '512+519.9', N'22.14+22.19,Д13', '5-03-001658-9', N'Компьютерная алгебра', NULL, NULL, N'Москва', 2, 1991, 352, 7000, NULL)
		, (246, '513.83+513.73', NULL, NULL, N'Устойчивые отображения и их особенности', NULL, NULL, N'Москва', 2, 1977, 296, NULL, N'Перевод с английского')
		, (247, '517.53', NULL, NULL, N'Избранные проблемы теории исключительных множеств', NULL, NULL, N'Москва', 2, 1971, 128, NULL, NULL)
		, (248, '517.5', N'22.162,Ж 51', NULL, N'Представления групп Ли', NULL, NULL, N'Москва', 5, 1983, 360, 15000, NULL)
		, (249, '517.535.4', NULL, NULL, N'Асимптотические значения голоморфных функций', NULL, NULL, N'Москва', 2, 1966, 104, NULL, NULL)
		, (250, '513.83', NULL, NULL, N'Идеалы дифференцируемых функций', NULL, NULL, N'Москва', 2, 1968, 132, NULL, NULL)
		, (251, '519.95', '518, C22', NULL, N'Комбинаторные методы дискретной математики', NULL, NULL, N'Москва', 5, 1977, 320, 13500, NULL)
		, (252, '517.11(075.8)', '51,Э19', NULL, N'Математическая логика', NULL, NULL, N'Москва', 26, 1975, 176, 25000, NULL)
		, (253, '517.53', '517.2,В68', NULL, N'Сборник задач по теории функций комлексного переменного', NULL, NULL, N'Москва', 5, 1970, 320, 50000, N'Содержит 1425 задач')
		, (254, '517.53/4', '517.2,Б 67', NULL, N'Основы теории аналитических функций комплексного переменного', 2, 'E', N'Москва', 5, 1972, 264, 25000, NULL)
		, (255, '519.4', '517.1,Л 97', NULL, N'Упражнени по теории групп', NULL, NULL, N'Москва', 5, 1967, 264, 20000, NULL)
		, (256, '519.972', '517.3,А 39', NULL, N'Тензорное исчисление', 2, 'S', N'Москва', 5, 1972, 352, 35000, NULL)
		, (257, '51.949', NULL, NULL, N'Особые точки комплексных гиперповерхностей', NULL, NULL, N'Москва', 2, 1971, 128, NULL, NULL)
		, (258, '517.55', '517.2,М21', NULL, N'Лекции по теории функций нескольких комплексных переменных', NULL, NULL, N'Москва', 5, 1969, 120, 14000, NULL)
		, (259, '512(075.8)', N'22.143,К71', '5-9221-0488-8', N'Введение в алгебру. Часть II. Линейная алгебра.', 3, NULL, N'Москва', 5, 2004, 368, 14000, NULL)
		, (260, '513', NULL, NULL, N'Графы и их применение.', NULL, NULL, N'Москва', 2, 1965, 176, NULL, NULL)
		, (261, '512.8', N'22.12,С 74', NULL, N'Справочная книга по математической логике. В 4-х частях. Часть IV. Теория доказательств и конструктивная математика.', NULL, NULL, N'Москва', 5, 1983, 392, 20000, NULL)
		, (262, NULL, NULL, NULL, N'Топология косых произведений', NULL, NULL, N'Москва', 18, 1953, 276, NULL, NULL)
		, (263, '519.443+513.836', NULL, NULL, N'Алгебраическая топология.Введение', NULL, NULL, N'Москва', 2, 1977, 344, NULL, NULL)
		, (264, NULL, NULL, NULL, N'Интегральные инварианты', NULL, NULL, N'Москва,Ленинград', 30, 1940, 344, 9000, NULL)
		, (265, '373:51', N'22.1я72,Г68', '978-5-4439-1326-1', N'ЕГЭ 2019. Математика. Геометрия. Планиметрия. Задача 16 (профильный уровень)', NULL, NULL, N'Москва', 1, 2019, 272, 3000, NULL)
		, (266, '373:51', N'22.1я72,Г68', '978-5-4439-1331-5', N'ЕГЭ 2019. Математика. Решение задачи 16 (профильный уровень)', NULL, NULL, N'Москва', 1, 2019, 448, 2000, NULL)
		, (267, '51', N'22.1,Б24', NULL, N'Россыпи головоломок', 3, 'S', N'Москва', 2, 1987, 415, 250000, NULL)
		, (268, '511', NULL, NULL, N'Последняя теорема Ферма. Генетическое введение в алгебраическую теорию чисел', NULL, NULL, N'Москва', 2, 1980, 488, 8000, NULL)
		, (269, '519+530.1', NULL, NULL, N'Теория групп и ее применение к физическим проблемам', NULL, NULL, N'Москва', 2, 1966, 588, NULL, NULL)
		, (270, '517.43', NULL, NULL, N'Лекции о теоремах Шоке', NULL, NULL, N'Москва', 2, 1968, 112, NULL, NULL)
		, (271, '517.11', N'22.12,Г 47', NULL, N'Основания математики. Логические исчисления и формализация арифметики', 2, NULL, N'Москва', 5, 1982, 560, 10000, NULL)
		, (272, '512.8', '517.1,К 93', NULL, N'Курс высшей алгебры', 9, NULL, N'Москва', 5, 1968, 432, 100000, NULL)
		, (273, '517.11, 519.5', N'22.12, В 74', NULL, N'Математика в альтернативной теории множеств', NULL, NULL, N'Москва', 2, 1983, 152, 6000, NULL)
		, (274, '517', N'22.16, И 46', NULL, N'Основы математического анализа. Часть I', 4, 'RC&E', N'Москва', 5, 1982, 616, 80000, N'Гос. прем. 1980')
		, (275, '11-5-2', NULL, NULL, N'Задачи и упражнения по математическому анализу для ВТУЗов', 3, 'S', N'Москва', 3, 1962, 472, 50000, N'Гос. прем. 1980')
		, (276, '516', N'22.151.5, И 46', NULL, N'Аналитическая геометрия', 3, 'S', N'Москва', 5, 1981, 232, 85000, N'Гос. прем. 1980')
		, (277, '517.53/55', N'22.161.5, Л43', '5-03-001007', N'Целые функции многих комплексных переменных', NULL, NULL, N'Москва', 2, 1989, 348, 3100, NULL)
		, (278, '519.2', NULL, '5-93972-467-1', N'Лекции по дифференциальной геометрии', 2, 'R&E', N'Москва,Ижевск', 16, 2006, 256, NULL, NULL)
		, (279, '514.11', N'22.151.0,С50', '978-5-94057-676-1', N'Четырехмерная геометрия. Элективный курс для учащихся 10-11 классов общеобразовательных учреждений', NULL, NULL, N'Москва', 1, 2010, 184, 1000, NULL)
		, (280, NULL, NULL, '5-94836-083-0', N'Математика-это просто! Доказательства', NULL, NULL, N'Москва', 31, 2006, 304, 1356, NULL)
		, (281, '11-5-2', NULL, NULL, N'Задачи и упражнения по аналитической геометрии', 18, 'S', N'Москва', 30, 1954, 356, 75000, NULL)
		, (282, '516+517(0.76.1)', '517,М 62', NULL, N'Сборник задач по высшей математике', 11, 'S', N'Москва', 5, 1971, 352, 200000, NULL)
		, (283, NULL, '517,Ж 46', NULL, N'Сисиематический сборник задач по интегральному исчислению', 2, NULL, N'Москва', 32, 1937, 160, 20000, N'Для высших педагогических учебных заведений')
		, (284, '51(07)', N'22.1,Б91', '978-5-4439-1096-3', N'Дневник математического кружка: первый год занятий', NULL, NULL, N'Москва', 1, 2017, 368, 2000, NULL)
		, (285, '517.9', '517.2,А 84', NULL, N'Дополнительные главы теории обыкновенных дифференциальных уравнений', NULL, NULL, N'Москва', 5, 1978, 304, 27000, NULL)
		, (286, '512.55+512.62', N'22.144,К 85', '978-5-88688-089-2', N'Задачи по теории колец, модулей и полей', NULL, NULL, N'Москва', 13, 2007, 240, NULL, NULL)
		, (287, '512; 519.46', NULL, NULL, N'Дискретные подгруппы групп Ли', NULL, NULL, N'Москва', 2, 1997, 320, NULL, NULL)
		, (288, '51', '52.1 г,Д15', NULL, N'Эварист Галуа революционер и математик', 2, NULL, N'Москва', 5, 1984, 112, 180000, NULL)
		, (289, '511', N'22.13,К 28', NULL, N'Рациональные квадратичные формы', NULL, NULL, N'Москва', 2, 1982, 440, 4600, NULL)
		, (290, NULL, N'22.151.4 22.152 22.161', '5-484-00341-5', N'Дифференцируемые многообразия', 2, 'S', N'Москва', 33, 2006, 248, NULL, NULL)
		, (291, NULL, N'22.130 22.151', '978-5-382-00146-3', N'Сферическая тригонометрия', 2, NULL, N'Москва', 10, 2007, 96, NULL, NULL)
		, (292, '519.6', N'22.19,И 41', NULL, N'Численное решение матричных уравнений', NULL, NULL, N'Москва', 5, 1984, 192, 21000, NULL)
		, (293, '512.8', N'22.144,К 22', NULL, N'Основы теории групп', 4, 'RC', N'Москва', 5, 1996, 288, 1000, NULL)
		, (294, '512.8', '517.1,Ф 36', NULL, N'Модальная логика', NULL, NULL, N'Москва', 5, 1974, 520, 11000, NULL)
		, (295, '510.51', N'22.12,М21', NULL, N'Алгоритмы и рекурсивные функции', 2, NULL, N'Москва', 5, 1986, 368, 10400, NULL)
		, (296, NULL, NULL, NULL, N'Аналитическая геометрия', 16, NULL, N'Москва,Ленинград', 30, 1949, 312, NULL, NULL)
		, (297, '517', '517.2,М 28', NULL, N'Дифференциальное и интегральное исчисление в примерах и задачах. Функции одной переменной', NULL, NULL, N'Москва', 5, 1970, 400, 110000, 'Посвящается 80-летию со дня рождения М.А.Красносельского. Воронеж, 28 января - 4 февраля 2000 г.')
		, (298, '51', NULL, NULL, N'Воронежская зимняя математическая школа (ВЗМШ-2000) "Современный анализ и его приложения". Тезисы докладов', NULL, NULL, N'Воронеж', 34, 2000, 192, 150, NULL)
		, (299, '517.535.4', '517.2,М 25', NULL, N'Целые функции. Элементарный очерк', 2, 'R&E', N'Москва', 5, 1975, 120, 55000, NULL)
		, (300, NULL, NULL, NULL, N'Интерпретация проективной геометрии с помощью окружностей', NULL, NULL, N'Харьков', 35, 1953, 36, 5000, NULL)
		, (301, '512.1/3(075.4)', '512,Ф15', NULL, N'Алгебра для самообразования', 2, 'R', N'Москва', 5, 1964, 532, 100000, NULL)
		, (302, '513.8', '517.4,Б 19', NULL, N'Введение в дифференциальную геометрию "в целом"', NULL, NULL, N'Москва', 5, 1973, 440, 15000, NULL)
		, (303, '519.50', NULL, NULL, N'Теория множеств и континуум-гипотеза', NULL, NULL, N'Москва', 2, 1969, 348, NULL, NULL)
		, (304, '513', N'22.15,Н 65', NULL, N'Геометрии и группы', NULL, NULL, N'Москва', 5, 1983, 240, 11600, NULL)
		, (305, '517.2', NULL, NULL, N'Множества. Логика. Аксиоматические теории', NULL, NULL, N'Москва', 4, 1968, 231, 70000, NULL)
		, (306, NULL, NULL, NULL, N'Метод тригонометрических сумм и его применение в теории чисел', NULL, NULL, N'Москва', 2, 1964, 192, NULL, NULL)
		, (307, '11-5-4', NULL, NULL, N'Трансцендентные и алгебраические числа', NULL, NULL, N'Москва', 30, 1952, 224, 5000, NULL)
		, (308, '514.112', N'22.151.0,Ш26', '978-5-4439-0136-7', N'Лекции по элемепнтарной геометрии', NULL, NULL, N'Москва', 1, 2014, 216, 1000, NULL)
		, (309, '512.81', N'22.14,Ф94', '978-5-4439-2545-5', N'Теория представлений. Начальный курс', NULL, NULL, N'Москва', 1, 2017, 584, 1500, N'144 ил.')
		, (310, NULL, NULL, 'S-87597-029-4', N'Математическое образование и наука в Соединенных Штатах Америки', NULL, NULL, N'Москва', 11, 1997, 56, 200, NULL)
		, (311, '530', '22.3,А95', '978-5-4439-1307-0', N'Лекции по теории относительности, классической электродинамике и гравитации', NULL, NULL, N'Москва', 1, 2018, 288, 1000, NULL)
		, (312, '530', '22.3,Б43', '978-5-4439-0289-0', N'Лекции по теоретической физике', 3, 'R&E', N'Москва', 1, 2015, 256, 1000, NULL)
		, (313, '517', N'22.161,Л89', '978-5-4439-0611-9', N'Лекции по математическому анализу', 2, 'R', N'Москва', 1, 2013, 296, 1000, N'Читался в 2006/2007 и 1999/2000 годах')
		, (314, '517', N'22.161,Л89', '5-900242-17-x', N'Набор и верстка в пакете LATEX', 2, 'R&E', N'Москва', 36, 1995, 374, 10000, NULL)
		, (315, '512', N'22.14,Г70', '978-5-4439-0217-3', N'Алгебра. Учебник для студентов-математиков. Часть 1', NULL, NULL, N'Москва', 1, 2013, 488, 15000, NULL)
		, (316, '271.21', N'22.15,Н73', '5-94057-102-6', N'Современные геометрические структуры и поля', NULL, NULL, N'Москва', 1, 2005, 584, 2000, NULL)
		, (317, '512.515.14', N'22.152,Х25', '978-5-94057-748-5', N'Алгебраическая топология', NULL, NULL, N'Москва', 1, 2011, 688, 1000, NULL)
		, (318, '513', NULL, '5-211-00310-1', N'Введение в геометрию многообразий с симметриями', NULL, NULL, N'Москва', 7, 1989, 359, 2840, NULL)
		, (319, '512.8', N'22.12,С 74', NULL, N'Справочная книга по математической логике. В 4-х частях. Часть I. Теория моделей', NULL, NULL, N'Москва', 5, 1982, 392, 20000, NULL)
		, (320, '512.8', N'22.12,С 74', NULL, N'Справочная книга по математической логике. В 4-х частях. Часть II. Теория множеств', NULL, NULL, N'Москва', 5, 1982, 376, 20000, NULL)
		, (321, '512.8', N'22.12,С 74', NULL, N'Справочная книга по математической логике. В 4-х частях. Часть III. Теория рекурсии', NULL, NULL, N'Москва', 5, 1982, 360, 20000, NULL)
		, (322, '512.8', N'22.12,С 74', NULL, N'Справочная книга по математической логике. В 4-х частях. Часть IV. Теория доказательств и конструктивная математика', NULL, NULL, N'Москва', 5, 1983, 392, 20000, NULL)
		, (323, '512.71', N'22.144,А37', '978-5-4439-0362-0', N'Коммутативная алгебра с прицелом на алгебраическую геометрию', NULL, NULL, N'Москва', 1, 2017, 752, 1000, NULL)
		, (324, '512.54', N'22.14,О-58', '5-02-014724-9', N'Топология транзитивных групп преобразований', NULL, NULL, N'Москва', 5, 1995, 384, 1000, NULL)
		, (325, '510.22', N'22.14,О-58', NULL, N'Труды по теории множеств', NULL, NULL, N'Москва', 5, 1985, 432, 3450, NULL)
		, (326, '519.164.17', N'22.152,Ф33', '5-02-014230-1', N'Абсолютные ретракты и бесконечномерные многообразия', NULL, NULL, N'Москва', 5, 1992, 232, 1010, NULL)
		, (327, '519.4', NULL, NULL, N'Топологические методы в алгебраической геометрии', NULL, NULL, N'Москва', 2, 1973, 280, NULL, NULL)
		, (328, '513.83', N'22.15,С 24', NULL, N'Алгебраическая топология. Гомотопии и гомологии', NULL, NULL, N'Москва', 5, 1985, 608, 9200, NULL)
		, (329, '513.83', N'22.15,С 80', NULL, N'Когомологические операции', NULL, NULL, N'Москва', 5, 1983, 232, 6000, N'С приложением работы Дж.Мэя "Общий алгебраический подход к операциям Стинрода"')
		, (330, '513.83', NULL, NULL, N'Когомологические операции и их приложения в теории гомотопий', NULL, NULL, N'Москва', 2, 1970, 288, NULL, NULL)
		, (331, '513.33', '517.6,А 46', NULL, N'Введение в гомологическую теорию размерности', NULL, NULL, N'Москва', 5, 1975, 368, 6000, NULL)
		, (332, '518.9+519.9', NULL, NULL, N'Некоторые вопросы теории игр двух лиц', NULL, NULL, N'Москва', 2, 1974, 296, NULL, NULL)
		, (333, NULL, '51(09),И74', NULL, N'"Эварист Галуа. Избранник богов', 3, NULL, N'Москва', 37, 1965, 352, 75000, NULL)
		, (334, NULL, '20г 5(09),Т99', NULL, N'Пуанкаре', NULL, NULL, N'Москва', 37, 1979, 415, 100000, NULL)
		, (335, '517.5+512.8', NULL, NULL, N'Введение в алгебру и анализ с антикоммутирующими переменными', NULL, NULL, N'Москва', 7, 1983, 208, 10600, NULL)
		, (336, '517', '517.2,Х-98', NULL, N'Абстракный гармонический анализ. Том 1', NULL, NULL, N'Москва', 5, 1975, 656, 9000, N'Структура топологических групп. Теория интегрирования. Представления групп.')
		, (337, '513.83', '517.6,А 46', NULL, N'Мемуар о компактных топологических пространствах', 3, NULL, N'Москва', 5, 1971, 144, 9900, NULL)
		, (338, '513.83', '517.6,А 46', NULL, N'Теория ретрактов', 3, NULL, N'Москва', 5, 1971, 144, 9900, NULL)
		, (339, '517', N'22.16,З86', '978-5-4439-0693-5', N'Математический анализ. Часть I', 8, 'R', N'Москва', 1, 2017, 564, 1500, 'Общий для частей 978-5-4439-0692-8')
		, (340, '517', N'22.16,З86', '978-5-4439-0694-2', N'Математический анализ. Часть II', 8, 'R', N'Москва', 1, 2017, 676, 1500, 'Общий для частей 978-5-4439-0692-8')
		, (341, '517.43+519.55', NULL, NULL, N'Анализ. Том I', NULL, NULL, N'Москва', 2, 1972, 824, NULL, NULL)
		, (342, '517.43+519.55', NULL, NULL, N'Анализ. Том II', NULL, NULL, N'Москва', 2, 1972, 528, NULL, NULL)
		, (343, '514.77+515.12(075.8)', N'22.151,Н73', NULL, N'Элементы дифференциальной геометрии и топологии', NULL, NULL, N'Москва', 5, 1987, 432, 18000, NULL)
		, (344, '517', '517.2,Н20', NULL, N'Теория представлений групп', NULL, NULL, N'Москва', 5, 1976, 560, 12000, NULL)
		, (345, '512.64 (053.8)', N'22.143,К72', NULL, N'Теория представлений групп', 2, 'RC', N'Москва', 5, 1986, 304, 22000, NULL)
		, (346, '512.05', NULL, '5-93972-097-8', N'Основные понятия алгебры', 2, 'R&E', N'Москва,Ижевск', 16, 2001, 352, 1200, NULL)
		, (347, '51 (075)', '51, Б43', NULL, N'Теория графов. Учебное пособие для втузов', NULL, NULL, N'Москва', 26, 1976, 392, 20000, NULL)
		, (348, '519', N'22.174, О-65', NULL, N'Теория графов', 2, 'S', N'Москва', 5, 1980, 336, 29000, N'Перевод с англ. издания 1962 года')
		, (349, '62-50', '6Ф6.5,Б 27', NULL, N'Конечные графы и сети', NULL, NULL, N'Москва', 5, 1973, 368, 16000, N'На титульном листе 1974 год издания')
		, (350, '519.1', NULL, NULL, N'Теория графов', NULL, NULL, N'Москва', 2, 1973, 304, NULL, NULL)
		, (351, '511+512+513+514(075.4)', '51,С-23', NULL, N'Сборник задач по элементарной математике. Пособие для самообразования', 16, NULL, N'Москва', 5, 1974, 416, NULL, NULL)
		, (352, NULL, NULL, NULL, N'Лекции по общей алгебре', NULL, NULL, N'Москва', 3, 1962, 396, 20000, NULL)
		, (353, NULL, '517.1,Х 17', NULL, N'Конечномерные векторные пространства', NULL, NULL, N'Москва', 3, 1963, 264, 9000, NULL)
		, (354, '517.5', N'22.16,Л 47', '5-211-015745-6', N'Задачи по теории функций комплексного переменного', NULL, NULL, N'Москва', 7, 1992, 255, 3750, NULL)
		, (355, '517.5', N'22.16,Л 47', '5-03-003692-X', N'Задачи по теории функций комплексного переменного с решениями', 2, 'R&E', N'Москва', 2, 2005, 360, 1500, NULL)
		, (356, NULL, '512,Т-83', NULL, N'Элементарная алгебра. Пособие для самообразования', 3, 'RC&E', N'Москва', 4, 1970, 864, 150000, NULL)
		, (357, '51', N'22.1,П 62', NULL, N'Пособие по математике для поступающих в вузы', 2, NULL, N'Москва', 5, 1985, 480, 400000, NULL)
		, (358, NULL, NULL, NULL, N'Сборник задач по специальному курсу элементарной математики', NULL, NULL, N'Москва', 38, 1957, 668, 50000, NULL)
		, (359, '512.8', '517.1,К 17', NULL, N'Введение в общую алгебру', NULL, NULL, N'Москва', 5, 1973, 448, 11000, NULL)
		, (360, '519.4', NULL, NULL, N'Расслоенные пространства', NULL, NULL, N'Москва', 2, 1970, 444, 11000, NULL)
		, (361, '512.8/075.8', '517.1, М 21', NULL, N'Основы линейной алгебры', NULL, NULL, N'Москва', 5, 1970, 400, 75000, NULL)
		, (362, '531+517', N'22.2+22.16,П 16', '5-03-000498-X', N'Неравенства в механике и их приложения. Выпуклые и невыпуклые функции энергии', NULL, NULL, N'Москва', 2, 1989, 494, 2800, NULL)
		, (363, '517.4', N'22.151,Х 36', NULL, N'Преобразование Радона', NULL, NULL, N'Москва', 2, 1983, 152, 5600, NULL)
		, (364, '372.8:51', '74.262.21,Д15', '5-09-011498-6', N'Методика обучения учащихся доказательству математических предложений. Книга для учителя.', NULL, NULL, N'Москва', 4, 2006, 256, 5000, NULL)
		, (365, NULL, NULL, NULL, N'Геометрические преобразования', NULL, NULL, N'Москва', 7, 1961, 232, 25000, NULL)
		, (366, '373.167.1:514', N'22.151я721,Г68', '978-5-94057-420-0', N'Геометрия. Планиметрия. 7-9 классы', 4, 'S', N'Москва', 1, 2006, 416, 3000, NULL)
		, (367, '512.62', N'22.144,П70', '978-5-4439-0233-3', N'Многочлены', 4, 'R', N'Москва', 1, 2014, 336, 1500, NULL)
		, (368, '372.3/.4:51(072)', '74.102,З42', '978-5-4439-0152-7', N'Малыши и математика. Домашний кружок для дошкольников', 5, 'S', N'Москва', 1, 2014, 240, 3000, NULL)
		, (369, '514.1', N'22.15,С66', '978-5-4439-1168-7', N'Геометрии', NULL, NULL, N'Москва', 1, 2017, 263, 1000, N'Перевод с английского издания 2012 г.')
		, (370, '515.12', N'22.152,В31', '978-5-4439-1036-9', N'Начальный курс топологии в листочках: задачи и теоремы', NULL, NULL, N'Москва', 1, 2017, 352, 1500, NULL)
		, (371, '517.11,517.12,519.4', N'22.12,Г60', NULL, N'Топосы. Категорный анализ логики', NULL, NULL, N'Москва', 2, 1983, 488, 5700, NULL)
		, (372, '510.67,512.57,512.541', N'22.144,Б91', '978-5-4439-0263-0', N'Элементарная и близкие к ней логические эквивалентности классических и универсальных алгебр', NULL, NULL, N'Москва', 1, 2015, 360, 500, NULL)
		, (373, '513', N'22.151,Б52', NULL, N'Геометрия. Том первый', NULL, NULL, N'Москва', 2, 1984, 560, 19000, NULL)
		, (374, '513', N'22.151,Б52', NULL, N'Геометрия. Том второй', NULL, NULL, N'Москва', 2, 1984, 368, 19000, NULL)
		, (375, '514', N'22.151,З15', '5-03-001059', N'Задачи по геометрии с комментариями и решениями', NULL, NULL, N'Москва', 2, 1989, 304, 35000, NULL)
		, (376, '510.2', N'22.12,В44', '978-5-4439-0066-7', N'Рассказы о множествах', 5, 'S', N'Москва', 1, 2013, 152, 2000, NULL)
		, (377, NULL, N'22.1я44 22.152 22.161 22.162', '5-354-00842-5', N'Теория множеств', 2, 'R', N'Москва', 6, 2004, 304, 480, NULL)
		, (378, '514.755', N'22.151, О34', '978-5-94057-365-4', N'Проективная дифференциальная геометрия. Старое и новое: от производной Шварца до когомологий групп диффеоморфизмов.'
			, NULL, NULL, N'Москва', 1, 2008, 280, 1000, N'Перевод с английского издания 2005 года')
		, (379, NULL, N'22.151', '978-5-453-00047-0', N'Современная геометрия: Методы и приложения. Т. 1: Геометрия поверхностей, групп преобразований и полей', 6, NULL, N'Москва', 6, 2013, 336, NULL, NULL)
		, (380, NULL, N'22.151,22.152', '978-5-453-00048-7', N'Современная геометрия: Методы и приложения. Т. 2: Геометрия и топология многообразий', 6, NULL, N'Москва', 6, 2013, 304, NULL, NULL)
		, (381, NULL, N'22.151', '978-5-453-00049-4', N'Современная геометрия: Методы и приложения. Т. 3: Теория гомологий', 6, NULL, N'Москва', 6, 2013, 288, NULL, NULL)
		, (382, '512.7', N'22.147,И86', '978-5-94057-935-9', N'Алгебраические поверхности: геометрия и арифметика', NULL, NULL, N'Москва', 1, 2012, 360, 400, NULL)
		, (383, '512.7', N'22.147,И86', '978-5-4439-0655-3', N'Многомерная геометрия', NULL, NULL, N'Москва', 1, 2016, 616, 800, NULL)
		, (384, '530.1', NULL, NULL, N'Характер физических законов', NULL, NULL, N'Москва', 2, 1968, 232, NULL, NULL)
		, (385, NULL, N'512 513 517,И32', NULL, N'Избранные задачи. Сборник.', NULL, NULL, N'Москва', 2, 1977, 597, NULL, N'Избранные задачи из журнала "American mathematical monthly"')
		, (386, NULL, N'512 513,В29', NULL, N'Венгерские математические олимпиады', NULL, NULL, N'Москва', 2, 1976, 543, NULL, N'Перевод с венгерского')
		, (387, '51(091)', N'22.1Г,В 57', NULL, N'Владимир Андреевич Стеклов - ученый и организатор науки', NULL, NULL, N'Москва', 5, 1981, 96, 45000, NULL)
		, (388, '517.5', N'22.161.5,Т 31', NULL, N'Сборник задач по теории функций действительной переменной', NULL, NULL, N'Москва', 5, 1980, 112, 26000, NULL)
		, (389, '651/512/513517.5', '51,Ш 88', NULL, N'Сто задач', 2, 'R&E', N'Москва', 5, 1976, 168, 200000, NULL)
		, (390, '51:53+52', NULL, NULL, N'Методы математической физики. Выпуск 1', NULL, NULL, N'Москва', 2, 1969, 424, NULL, NULL)
		, (391, '51:53-52', NULL, NULL, N'Методы математической физики. Выпуск 2', NULL, NULL, N'Москва', 2, 1970, 352, NULL, NULL)
		, (392, '51:53+52', NULL, NULL, N'Методы математической физики. Выпуск 3', NULL, NULL, N'Москва', 2, 1970, 344, NULL, NULL)
		, (393, '512.32', N'512,Б 79', NULL, N'Симметрия в алгебре', NULL, NULL, N'Москва', 5, 1967, 284, 50000, NULL)
		, (394, '513.83', N'22.152,Б 87', NULL, N'Перестройки односвязных многообразий', NULL, NULL, N'Москва', 5, 1984, 208, 6200, NULL)
		, (395, '519.7', NULL, NULL, N'Современная прикладная алгебра', NULL, NULL, N'Москва', 2, 1976, 400, NULL, NULL)
		, (396, NULL, NULL, NULL, N'Многолистные функции', NULL, NULL, N'Москва', 18, 1960, 184, NULL, NULL)
		, (397, '513.73', NULL, NULL, N'Исследования по метрической теории поверхностей', NULL, NULL, N'Москва', 2, 1980, 296, 3500, N'Сборник статей. Перевод с английского и французского')
		, (398, '513.1', N'22.151.0,Д 67', NULL, N'Евклидова планиметрия', NULL, NULL, N'Москва', 5, 1978, 272, 20000, NULL)
		, (399, '511.3', N'22.13,А 21', NULL, N'Автоморфные формы, представления и L-функции', NULL, NULL, N'Москва', 2, 1984, 287, 2400, N'Сборник статей. Перевод с английского и французского')
		, (400, '512; 519.46', NULL, NULL, N'Универсальные обертывающие алгебры', NULL, NULL, N'Москва', 2, 1978, 408, NULL, NULL)
		, (401, '512.817.3', N'22.144,М25', '978-5-94057-174-2', N'Дискретные подгруппы полупростых групп Ли', NULL, NULL, N'Москва', 1, 2007, 464, NULL, NULL)
		, (402, '519.41/.47+530.145', NULL, NULL, N'Теория представлений групп и ее приложения. Том 1', NULL, NULL, N'Москва', 2, 1980, 456, 7500, NULL)
		, (403, '519.41/.47+530.145', NULL, NULL, N'Теория представлений групп и ее приложения. Том 2', NULL, NULL, N'Москва', 2, 1980, 400, 7500, NULL)
		, (404, NULL, '512,Т67', NULL, N'Задачи с изюминкой', NULL, NULL, N'Москва', 2, 1975, 302, NULL, NULL)
		, (405, '51', NULL, '5-7036-0109-6', N'Курс математики для студентов-физиков. Том I, главы 1-11', NULL, NULL, N'Москва', 19, 2006, 592, NULL, NULL)
		, (406, '51', NULL, '5-7036-0110-X', N'Курс математики для студентов-физиков. Том II, главы 12-22', NULL, NULL, N'Москва', 19, 2006, 664, NULL, NULL)
		, (407, '512.8', NULL, NULL, N'Универсальная алгебра', NULL, NULL, N'Москва', 2, 1968, 352, NULL, NULL)
		, (408, '519.4', NULL, NULL, N'Теория инвариантов', NULL, NULL, N'Москва', 2, 1981, 192, 7200, NULL)
		, (409, '517.948', NULL, NULL, N'Потоки на однородных пространствах', NULL, NULL, N'Москва', 2, 1966, 208, NULL, NULL)
		, (410, NULL, NULL, NULL, N'Специальный курс элементарной алгебры', 4, 'RC', N'Москва', 38, 1956, 528, 35000, NULL)
		, (411, NULL, NULL, NULL, N'Специальный курс тригонометрии', 2, NULL, N'Москва', 38, 1954, 492, 40000, NULL)
		, (412, '513.838', '517.2', NULL, N'Вариационная теория геодезических', 2, NULL, N'Москва', 5, 1965, 248, 4600, NULL)
		, (413, NULL, NULL, NULL, N'Теория групп', NULL, NULL, N'Москва', 18, 1962, 468, NULL, NULL)
		, (414, '512.54', N'22.144,Б87', NULL, N'Когомологии групп', NULL, NULL, N'Москва', 5, 1987, 384, 3900, NULL)
		, (415, NULL, NULL, NULL, N'Замечательный математик Нильс Хенрик Абель', NULL, NULL, N'Москва', 3, 1961, 344, 15000, NULL)
		, (416, '519.4', '517.1,К 98', NULL, N'Теория представлений конечных групп и ассоциативных алгебр', NULL, NULL, N'Москва', 5, 1969, 668, 7500, NULL)
		, (417, '512.8', '517.1,Д 92', NULL, N'Линейная алгебра и элементарная геометрия', NULL, NULL, N'Москва', 5, 1972, 336, 23000, NULL)
		, (418, '517.1', NULL, NULL, N'Математика и логика. Ретроспектива и перспективы', NULL, NULL, N'Москва', 2, 1971, 256, NULL, NULL)
		, (419, '164', '517,Н 73', NULL, N'Конструктивная математическая логика с точки зрения классической', NULL, NULL, N'Москва', 5, 1977, 328, 14000, NULL)
		, (420, NULL, NULL, NULL, N'Основы теории алгебраических инвариантов', NULL, NULL, N'Москва,Ленинград', 23, 1948, 408, 7000, NULL)
		, (421, '519.50', NULL, NULL, N'Основания теории множеств', NULL, NULL, N'Москва', 2, 1966, 556, NULL, NULL)
		, (422, '513.3(075)', N'22.152,А 46', NULL, N'Общая топология', NULL, NULL, N'Москва', 26, 1979, 336, 19000, NULL)
		, (423, NULL, N'22.152 22.1о 22.3о', '978-5-382-00161-6', N'Первые понятия топологии. Геометрия отображений отрезков, кривых, окружностей и кругов', 2, NULL, N'Москва', 10, 2007, 226, 19000, N'URSS')
		, (424, '513.1', '513,В 26', NULL, N'Симметрия', NULL, NULL, N'Москва', 5, 1968, 192, 75000, NULL)
		, (425, '517.55', NULL, NULL, N'Аналитические функции многих комплексных переменных', NULL, NULL, N'Москва', 2, 1969, 396, NULL, NULL)
		, (426, '517.11', N'22.12,К19', NULL, N'Аксиома выбора и аксиома детерменированности', NULL, NULL, N'Москва', 5, 1984, 64, 23000, NULL)
		, (427, '517', '22.31,К19', NULL, N'Групповые методы интегрирования нелинейных динамических систем', NULL, NULL, N'Москва', 5, 1985, 280, 3200, NULL)
		, (428, '519.49', NULL, NULL, N'Некоммутативные кольца', NULL, NULL, N'Москва', 2, 1972, 192, NULL, NULL)
		, (429, NULL, NULL, NULL, N'Введение в теорию кэлеровых многообразий', NULL, NULL, N'Москва', 18, 1961, 220, NULL, NULL)
		, (430, '512.8', '517.1,М 21', NULL, N'Алгебраические системы', NULL, NULL, N'Москва', 5, 1970, 392, 17500, NULL)
		, (431, '513.83', NULL, NULL, N'Лекции о Q-многообразиях', NULL, NULL, N'Москва', 5, 1981, 160, 5700, NULL)
		, (432, '519.443', NULL, NULL, N'Бесконечные абелевы группы. Том 1', NULL, NULL, N'Москва', 2, 1974, 336, NULL, NULL)
		, (433, '519.443', NULL, NULL, N'Бесконечные абелевы группы. Том 2', NULL, NULL, N'Москва', 2, 1974, 416, NULL, NULL)
		, (434, '519.43', NULL, NULL, N'Гармонический анализ операторов в гильбертовом пространстве', NULL, NULL, N'Москва', 2, 1970, 432, NULL, NULL)
		, (435, '517', NULL, NULL, N'Лекции по функциональному анализу', 2, 'RC&E', N'Москва', 2, 1979, 592, 21000, NULL)
		, (436, '519.45+517.862+511', NULL, NULL, N'Автоморфные формы на GL(2)', NULL, NULL, N'Москва', 2, 1973, 376, NULL, NULL)
		, (437, '510:164', NULL, NULL, N'Заметки по логике', NULL, NULL, N'Москва', 2, 1968, 128, NULL, NULL)
		, (438, '513.83', N'22.144,К71', NULL, N'Начальный курс алгебраической топологии', NULL, NULL, N'Москва', 2, 1983, 304, 10000, NULL)
		, (439, '517.55', N'22.144,К71', NULL, N'Комплексные пространства. Сборник переводов', NULL, NULL, N'Москва', 2, 1965, 320, NULL, NULL)
		, (440, '513.012 (075.4)', '517.3,Г32', NULL, N'Метод координат', NULL, NULL, N'Москва', 5, 1965, 72, 60000, NULL)
		, (441, '51(0.062)', N'22.1,М63', '978-5-9774-0730-4', N'Пока алгебра не разлучит нас. Теория групп и ее применение', NULL, NULL, N'Москва', 41, 2014, 144, 60000, N'ISBN серии 978-5-9774-0682-6')
		, (442, '512.58', N'22.144,М15', '5-9221-0400-4', N'Категории для работающего математика', NULL, NULL, N'Москва', 41, 2004, 352, NULL, N'Перевод со второго английского издания')
		, (443, '515.12', N'22.152,Д 42', NULL, N'Теория топосов', NULL, NULL, N'Москва', 5, 1986, 440, 5270, NULL)
		, (444, '030.8', N'22.1,А 64', '5-03-002952-4', N'Англо-русский словарь математических терминов', 2, 'R&E', N'Москва', 2, 1994, 416, NULL, NULL)
		, (445, '513.836', NULL, NULL, N'Введение в теорию категорий и функторов', NULL, NULL, N'Москва', 2, 1972, 260, NULL, NULL)
		, (446, '51 (023)', N'22.1,Е 15', '978-5-4439-1269-1', N'Сто граней математики', NULL, NULL, N'Москва', 1, 2018, 176, 3000, NULL)
		, (447, '51(07)', N'22.1-22/3ж 74ю04(2),К60', '978-5-4439-0622-5', N'Колмогоровской школе - пятьдесят. Сборник статей.', NULL, NULL, N'Москва', 1, 2014, 144, 900, 'Приложение к журналу "Квант" №3/2014')
		, (448, '379-8 + 51-8', '77.056я92:22.1,Б73', '978-5-4439-1348-3', N'Логические головоломки', NULL, NULL, N'Москва', 1, 2019, 132, 3000, NULL)
		, (449, '379-8 + 51-8', '77.056я92:22.1,Б73', '978-5-4439-1364-3', N'Геометрические головоломки', NULL, NULL, N'Москва', 1, 2019, 160, 3000, NULL)
		, (450, NULL, NULL, '5-87660-004-0', N'Задачи с параметрами', NULL, NULL, N'Киев', 44, 1992, 290, NULL, NULL)
		, (451, '517.545, 512.54', N'22.144,А47', '978-5-4439-1149-6', N'Теорема Абеля в задачах и решениях', NULL, NULL, N'Москва', 1, 2017, 216, 2000, 'Б-чка "Квант"; Вып. 137')
		, (452, '512(075.8)', N'22.14,К72', '5-02-014644-7', N'Введение в алгебру. Основы алгебры', NULL, NULL, N'Москва', 42, 1994, 320, 10000, NULL)
		, (453, '510.2 + 510.5 + 510.6', N'22.12,Л13', '5-02-014844-X', N'Задачи по теории множеств, математической логике и теории алгоритмов', 3, NULL, N'Москва', 42, 1995, 256, 2000, NULL)
		, (454, NULL, NULL, NULL, N'Как решать задачу', 2, NULL, N'Москва', 32, 1961, 208, 100000, N'Пособие для учителей')
		, (455, '510', '51,П 47', NULL, N'Математическое открытие. Решение задач: основные понятия, изучение и преподавание', 2, 'S', N'Москва', 5, 1976, 448, 95000, NULL)
		, (456, '510', '51,П 47', NULL, N'Математика и правдоподобные рассуждения', 2, 'R', N'Москва', 5, 1975, 464, 100000, NULL)
		, (457, '51(092)', N'22.1г', '978-5-4439-1250-9', N'Арнольд В. И. К восьмидесятилетию', NULL, NULL, N'Москва', 1, 2018, 496, 2000, NULL)
		, (458, '519.2+531.19+517', NULL, NULL, N'Методы символической динамики', NULL, NULL, N'Москва', 2, 1979, 248, 4200, N'Сборник статей')
		, (459, '514.76', N'22.151,Я64', NULL, N'CR-подмногообразия в келеровом и сасакиевом многообразиях', NULL, NULL, N'Москва', 5, 1990, 192, 1420, NULL)
		, (460, NULL, NULL, NULL, N'Уравнения математической физики', NULL, NULL, N'Москва,Ленинград', 30, 1947, 440, 10000, NULL)
		, (461, '530.12', NULL, NULL, N'Основы релятивистской теории гравитации', NULL, NULL, N'Москва', 7, 1986, 308, 1000, NULL)
		, (462, NULL, NULL, '5-80100-134-7', N'Математический анализ на многообразиях', NULL, NULL, N'Волгоград', 9, 1996, 164, NULL, NULL)
		, (463, NULL, N'22.12,В31', '5-900916-36-7', N'Лекции по математической логике и теории алгоритмов. Часть 1. Начала теории множеств', 2, 'R', N'Москва', 1, 2002, 128, 3000, NULL)
		, (464, '510.6', N'22.12,В31', '978-5-94057-322-7', N'Лекции по математической логике и теории алгоритмов. Часть 2. Языки и исчисления', 3, 'E', N'Москва', 1, 2008, 288, 1000, NULL)
		, (465, NULL, N'22.12,В31', '5-900916-39-1', N'Лекции по математической логике и теории алгоритмов. Часть 3. Вычислимые функции', 2, 'R', N'Москва', 1, 2002, 192, 1000, NULL)
		, (466, '511.3', N'22.13,А36', NULL, N'Классическое введение в современную теорию чисел', NULL, NULL, N'Москва', 2, 1987, 416, 10000, NULL)
		, (467, '511', '122.130,М23', '978-5-94057-511-5', N'Введение в современную теорию чисел', NULL, NULL, N'Москва', 1, 2009, 552, 1500, NULL)
		, (468, '519.4', NULL, NULL, N'Алгебраическая топология', NULL, NULL, N'Москва', 2, 1971, 680, NULL, NULL)
		, (469, NULL, N'22.172', '978-5-382-01477-7', N'Введение в математическую статистику', NULL, 'S', N'Москва', 10, 2014, 600, NULL, NULL)
		, (470, NULL, N'22.172', '978-5-397-04141-6', N'Математическая статистика', NULL, NULL, N'Москва', 39, 2014, 352, NULL, NULL)
		, (471, '519.2', N'22.172,И 25', '5-06-002317-6', N'Математическая статистика', 2, 'E', N'Москва', 26, 1992, 304, 4000, NULL)
		, (472, NULL, N'22.1о 22.3о', '978-5-484-00922-0,5-484-00922-7', N'Этот правый левый, мир', 2, 'S', N'Москва', 33, 2007, 272, NULL, NULL)
		, (473, NULL, NULL, NULL, N'Пространства римановых поверхностей и квазиконформные отображения', NULL, NULL, N'Москва', 18, 1961, 180, NULL, NULL)
		, (474, NULL, NULL, NULL, N'Элементарная теория обобщенных функций I', NULL, NULL, N'Москва', 18, 1959, 80, NULL, NULL)
		, (475, NULL, NULL, NULL, N'Элементарная теория обобщенных функций II', NULL, NULL, N'Москва', 18, 1963, 72, NULL, NULL)
		, (476, '512; 519.46', NULL, NULL, N'Алгебры Ли и группы Ли', NULL, NULL, N'Москва', 2, 1969, 376, NULL, NULL)
		, (477, '513.83', N'22.15,Б 79', NULL, N'Наглядная топология', NULL, NULL, N'Москва', 5, 1982, 160, 120000, NULL)
		, (478, '513.83', NULL, NULL, N'Топология слоений', NULL, NULL, N'Москва', 2, 1979, 320, 6800, NULL)
		, (479, '539.1', '22.31,Ф 33', NULL, N'Группа лоренца', NULL, NULL, N'Москва', 5, 1979, 384, 4950, NULL)
		, (480, '512.80', '517,П 39', NULL, N'Группы автоморфизмов алгебраических систем', NULL, NULL, N'Москва', 5, 1966, 604, 6000, NULL)
		, (481, '513.83', '517.6,А 46', NULL, N'Введение в теорию множеств и общую топологию', NULL, NULL, N'Москва', 5, 1977, 368, 35000, NULL)
		, (482, '517.53', N'22.16,Л 89', '978-5-4439-1137-3', N'Принципы комплексного анализа', NULL, NULL, N'Москва', 1, 2017, 304, 1500, NULL)
		, (483, '517.5', N'22.161.5,Л-47', '5-89176-255-2', N'Лекции по теории функций комплексного переменного', NULL, NULL, N'Москва', 24, 2004, 216, 500, NULL)
		, (484, '517.5', N'22.16,Д 27', '5-9221-0595-7', N'Действительный анализ в задачах', NULL, NULL, N'Москва', 42, 2005, 416, NULL, NULL)
		, (485, '519.5', N'22.174,А 36', NULL, N'Действительный анализ в задачах', NULL, NULL, N'Москва', 2, 1982, 558, 12000, N'Перевод с английского издания')
		, (486, '519.95(075.8)', 'ББК 518,Г12', N'5-02-013991-2', N'Задачи и упражнения по курсу дискретной математики', 2, 'RC&E', N'Москва', 5, 1992, 408, 4830, N'Перевод с английского издания')
		, (487, '517', N'22.16,Э 18', NULL, N'Ряды Фурье в современном изложении. В 2-х томах. Том 1', NULL, NULL, N'Москва', 2, 1985, 264, 12000, N'Перевод со 2-го английского издания')
		, (488, '517', N'22.16,Э 18', NULL, N'Ряды Фурье в современном изложении. В 2-х томах. Том 2', NULL, NULL, N'Москва', 2, 1985, 400, 12000, N'Перевод со 2-го английского издания')
		, (489, '514', NULL, '5-211-00959-2', N'Дифференциальная геометрия. Первое знакомство', NULL, NULL, N'Москва', 7, 1990, 384, 8600, NULL)
		, (490, '517', NULL, NULL, N'Линейные пространства и отображения', NULL, NULL, N'Москва', 7, 1987, 311, 4720, NULL)
		, (491, '512', N'22.14,А 89', '978-5-88688-091-5', N'Грани алгебры', NULL, NULL, N'Москва', 13, 2008, 328, NULL, NULL)
		, (492, '515.14', N'22.15,П70', '978-5-4439-0241-8', N'Элементы комбинаторной и дифференциальной топологии', 2, 'R&E', N'Москва', 1, 2014, 360, 1500, NULL			)
		, (493, '515.14', N'22.152,П70', '5-94057-245-6', N'Элементы теории гомологий', NULL, NULL, N'Москва', 1, 2006, 448, 1000, N'Непосредственное продолжение книги "Элементы комбинаторной и дифференциальной топологии" того же автора 2004 года')
		, (494, '513.73', N'22.151,M71', '5-9221-0442-X', N'Краткий курс дифференциальной геометрии и топологии', NULL, NULL, N'Москва', 42, 2004, 304, NULL, NULL)
		, (495, '[512.8+516.0](075.8)', N'22.12я73,И45', '978-5-482-01216-1', N'Линейная алгебра и аналитическая геометрия', 3, 'RC&E', N'Москва', 45, 2007, 400, NULL, NULL)
		, (496, NULL, N'22.151 22.152 22.1я73', '978-5-9710-1366-2', N'Курс наглядной геометрии и топологии', NULL, NULL, N'Москва', 46, 2015, 360, NULL, NULL)
		, (497, NULL, N'22.1я73 22.151.4 22.152', '978-5-9710-2448-1', N'Сборник задач по дифференциальной геометрии и топологии', NULL, NULL, N'Москва', 46, 2016, 416, 1000, NULL)
		, (498, NULL, N'22.152 22.1я73', '978-5-9710-1250-4', N'Введение в топологии', 3, 'R&E', N'Москва', 46, 2015, 448, NULL, NULL)
		, (499, '512.66', N'22.114,Г32', '5-02-014414-2', N'Методы гомологической алгебры. В 2-х т. Т.1. Введение в теорию когомологий и производные категории', NULL, NULL, N'Москва', 5, 1988, 416, 4900, NULL)
		, (500, '512.7,512.667', N'22.147,M23', '978-5-94057-635-8', N'Введение в теорию схем и квантовые группы', NULL, NULL, N'Москва', 1, 2012, 256, 1000, NULL)
		, (501, NULL, NULL, NULL, N'Элементарная геометрия. Часть первая. Планиметрия', 3, 'E', N'Москва', 32, 1948, 608, NULL, N'Перевод с 11-го издания. С приложением составленных проф. Д.И.Перепелкиным решений всех помещенных в тексте задач')
		, (502, NULL, NULL, NULL, N'Элементарная геометрия. Часть вторая. Стереометрия', 2, 'E', N'Москва', 32, 1951, 760, NULL, N'Перевод с 7-го издания. С приложением составленных проф. Д.И.Перепелкиным решений всех помещенных в тексте задач')
		, (503, '519.2 517.5', N'22.162я7,Б 733', '978-5-93972-911-6', N'Действительный и функциональный анализ. Университетский курс.', 2, 'R&E', N'Москва,Ижевск', 16, 2011, 728, NULL, NULL)
		, (504, '517.5', N'22.162,Д 93', '5-88688-55-0', N'Мера и интеграл', NULL, NULL, N'Москва', 13, 2002, 1000, NULL, NULL)
		, (505, '513.83', '517.6,А 87', NULL, N'Основы общей топологии в задачах и упражнениях', NULL, NULL, N'Москва', 5, 1974, 424, 14000, NULL)
		, (506, '512.5', N'22.144,Б 30', '5-02-014290-5', N'Основные структуры современной алгебры', NULL, NULL, N'Москва', 5, 1990, 320, 4800, NULL)
		, (507, '517.98', N'22.16,Х36', '978-5-4439-0141-1', N'Лекции по функциональному анализу', 2, 'R&E', N'Москва', 1, 2014, 560, 1500, NULL)
		, (508, '517.443', N'22.161.1,С34', '978-5-97060-111-2', N'Занимательная математика. Анализ Фурье. Манга', NULL, NULL, N'Москва', 47, 2014, 256, NULL, N'Перевод с японского')
		, (509, '530.145', '22.314,И85', '978-5-97060-133-4', N'Занимательная физика. Квантовая механика. Манга', NULL, NULL, N'Москва', 47, 2016, 256, NULL, N'Перевод с японского')
		, (510, '513.6 + 513.8', N'22.14,М 60', NULL, N'Этальные когомологии', NULL, NULL, N'Москва', 2, 1983, 392, 3300, NULL)
		, (511, '513.6', N'22.14,Г 85', NULL, N'Принципы алгебраической геометрии. Т. 1', NULL, NULL, N'Москва', 2, 1982, 496, 8000, N'Сплошная нумерация 1-496. Главы 0-3')
		, (512, '513.6', N'22.14,Г 85', NULL, N'Принципы алгебраической геометрии. Т. 2', NULL, NULL, N'Москва', 2, 1982, 366, 8000, N'Сплошная нумерация 497-864. Главы 4-6')
		, (513, '513.836', NULL, NULL, N'Теория гомологий и когомологий. Подход, основанный на применении коцепей Александера-Спеньера', NULL, NULL, N'Москва', 2, 1981, 392, 7000, NULL)
		, (514, '515 142.21', N'22.15,Б87', NULL, N'Теория пучков', NULL, NULL, N'Москва', 5, 1988, 312, 3550, NULL)
		, (515, '517.518', N'22.161.1,Ф32', NULL, N'Геометрическая теория меры', NULL, NULL, N'Москва', 5, 1987, 760, 4500, NULL)
		, (516, '512.62', N'22.144,Л55', '5-03-000065-8', N'Конечные поля. В 2-х томах. Том 1.', NULL, NULL, N'Москва', 2, 1988, 432, 4800, N'Сплошная нумерация 1-432. Главы 1-6.')
		, (517, '512.62', N'22.144,Л55', '5-03-000066-6', N'Конечные поля. В 2-х томах. Том 2.', NULL, NULL, N'Москва', 2, 1988, 822, 4800, N'Сплошная нумерация 433-824. Главы 7-10.')
		, (518, '519.17', N'22.17,Т23', '5-03-001001-7', N'Теория графов', NULL, NULL, N'Москва', 2, 1988, 424, 5000, NULL)
		, (519, '513.83', NULL, NULL, N'Первые понятия топологии. Геометрия отображений отрезков, кривых, окружностей и кругов', NULL, NULL, N'Москва', 2, 1967, 224, NULL, NULL)
		, (520, '512.7', N'22.147,П50', '978-5-94057-621-1', N'Абелевы многообразия, тэта-функция и преобразование Фурье', NULL, NULL, N'Москва', 1, 2010, 312, 1000, N'Перевод с английского')
		, (521, '519.15', NULL, NULL, N'Перечисление графов', NULL, NULL, N'Москва', 2, 1977, 328, NULL, NULL)
		, (522, '513.836', NULL, NULL, N'Теория гомотопий', NULL, NULL, N'Москва', 2, 1964, 468, NULL, NULL)
		, (523, '517.55;513.73', NULL, NULL, N'Дифференциальное исчисление на комплексных многообразиях', NULL, NULL, N'Москва', 2, 1976, 288, NULL, NULL)
		, (524, '513.7', N'22.15,М 24', NULL, N'Калибровачные поля и комплексная геометрия', NULL, NULL, N'Москва', 5, 1984, 336, 6000, NULL)
		, (525, '513.83', N'22.15,Ф 76', NULL, N'Вариационные методы в топологии', NULL, NULL, N'Москва', 5, 1982, 344, 8000, NULL)
		, (526, '517.43:519.55', NULL, NULL, N'Методы современной математической физики. Том 1. Функциональный анализ.', NULL, NULL, N'Москва', 2, 1977, 360, NULL, NULL)
		, (527, '517.43:519.55', NULL, NULL, N'Методы современной математической физики. Том 2. Гармонический анализ. Самосопряженность', NULL, NULL, N'Москва', 2, 1978, 400, NULL, NULL)
		, (528, '517.43:519.55', '22.31,Р 49', NULL, N'Методы современной математической физики. Том 3. Теория рассеяния', NULL, NULL, N'Москва', 2, 1982, 443, 15000, N'ББК 22.31 517.2 530.1. 448 стр.')
		, (529, '517.43:519.55', '22.31,Р 49', NULL, N'Методы современной математической физики. Том 4. Анализ операторов', NULL, NULL, N'Москва', 2, 1982, 428, 15000, N'ББК 22.31 517.2 530.1. 432 стр.')
		, (530, '517 + 514.7', N'22.16 + 22.151,Б89', '5-03-001194-3', N'Кривые и особенности', NULL, NULL, N'Москва', 2, 1988, 262, 14000, '264 cтр.')
		, (531, '517.5', '517.2,К 43', NULL, N'Элементы теории представлений', 2, NULL, N'Москва', 5, 1978, 344, 10000, NULL)
		, (532, '517', '517.2,Г46', NULL, N'Геометрические асимптотики', NULL, NULL, N'Москва', 2, 1981, 504, 8000, NULL)
		, (533, '517', NULL, NULL, N'Многообразия с замкнутыми геодезическими', NULL, NULL, N'Москва', 2, 1981, 328, 5200, NULL)
		, (534, '517', N'22.161.6,К 79', NULL, N'Лекции о замкнутых геодезических', NULL, NULL, N'Москва', 2, 1982, 416, 6200, NULL)
		, (535, '513.013:513.731:513.838', NULL, NULL, N'Лекции по дифференциальной геометрии', NULL, NULL, N'Москва', 2, 1970, 412, NULL, NULL)
		, (536, '517.5', N'22.161.5,Ш 12', NULL, N'Распределение значений голоморфных отображений', NULL, NULL, N'Москва', 5, 1982, 288, 4000, NULL)
		, (537, '512.54+519.1+519.813', N'22.141,К 17', NULL, N'Преобразования и перестановки', 2, 'RC&E', N'Москва', 5, 1985, 160, 143000, N'Перевод с украинского')
		, (538, '512.743+512.75', N'22.132+22.147,В76', '978-5-94057-522-1', N'Бирациональная геометрия линейных алгебраических групп', NULL, NULL, N'Москва', 1, 2009, 408, 400, NULL)
		, (539, '514.112', N'22.151.0,П70', '978-5-4439-1370-4', N'Задачи по планиметрии', 7, 'R&E', N'Москва', 1, 2019, 640, 2000, NULL)
		, (540, '51(07)', N'22.1,Т12', '978-5-4439-0922-6', N'Математический дивертисмент. 30 лекций по классической математике', 2, 'S', N'Москва', 1, 2016, 512, 2000, N'Перевод с английского')
		, (541, '515.7', N'22.15,Н33', '5-94057-058-5', N'Модули римановых поверхностей, вещественных алгебраических кривых и их супераналоги', NULL, NULL, N'Москва', 1, 2003, 176, 1000, NULL)
		, (542, '512.547', N'22.114,С32', '5-94057-005-4', N'Кэлерова геометрия пространств петель', NULL, NULL, N'Москва', 1, 2001, 128, NULL, NULL)
		, (543, '512.64', N'22.143,П70', '978-5-4439-0220-3', N'Задачи и теоремы линейной алгебры', NULL, 'NRC', N'Москва', 1, 2015, 576, 2000, NULL)
		, (544, '511.5', N'22.13,С79', '5-02-014607-2', N'Арифметика алгебраических кривых', NULL, NULL, N'Москва', 5, 1991, 368, 2000, NULL)
		, (545, '513.813', NULL, NULL, N'Риманова геометрия в целом', NULL, NULL, N'Москва', 2, 1971, 344, NULL, N'Перевод с немецкого издания 1968 г.')
		, (546, '514.764', N'22.151.1,Б91', '5-02-024606-9', N'Введение в риманову геометрию', NULL, NULL, N'Санкт-Петербург', 5, 1994, 318, 620, NULL)
		, (547, '511.33', N'22.13,Ч18', '978-5-4439-1394-0', N'Методы аналитической теории чисел', NULL, NULL, N'Москва', 1, 2019, 208, 1000, NULL)
		, (548, '519.4', N'22.14,Г 80', NULL, N'Общая теория решеток', NULL, NULL, N'Москва', 2, 1981, 456, 6000, NULL)
		, (549, '519.49', NULL, NULL, N'Гомология', NULL, NULL, N'Москва', 2, 1966, 544, NULL, NULL)
		, (550, '512.5', N'22.14,К 85', '5-88688-086-0', N'Модули над областями дискретного нормирования', NULL, NULL, N'Москва', 13, 2007, 384, NULL, NULL)
		, (551, '512.541; 512.552; 512.553', N'22.144,К 85', '5-88688-080-1', N'Абелевы группы и их кольца эндоморфизмов', NULL, NULL, N'Москва', 13, 2006, 512, 400, NULL)
		, (552, NULL, NULL, NULL, N'Теоремы замкнутости и теоремы композиции', NULL, NULL, N'Москва', 18, 1962, 156, NULL, NULL)
		, (553, '517.55', NULL, NULL, N'Анализ на действительных и комплексных многообразиях', NULL, NULL, N'Москва', 2, 1971, 232, NULL, NULL)
		, (554, '517.5', N'22.1,М 24', '5-88688-052-6', N'C*-гильбертовы модули', NULL, NULL, N'Москва', 13, 2001, 224, 500, NULL)
		, (555, '51', N'22.1,Г 47', '5-88688-039-5', N'Д. Гильберт. Избранные труды. Т. II. Анализ. Физика. Проблемы. Personalia', NULL, NULL, N'Москва', 13, 1998, 608, 1000, NULL)
		, (556, '517', N'22.16,А 86', '5-88688-082-8', N'Принцип максимума Понтрягина. Доказательство и приложения', NULL, NULL, N'Москва', 13, 2006, 144, 1000, NULL)
		, (557, '513.83', NULL, NULL, N'Характеристические классы', NULL, NULL, N'Москва', 2, 1979, 376, 6500, N'С приложением работы Дж. Манкрса "Элементарная дифференциальная топология"')
		, (558, '515.162.8', N'22.152,К28', '978-5-4439-0245-6', N'Группы кос', NULL, NULL, N'Москва', 1, 2014, 422, 1000, NULL)
		, (559, '512.64', N'22.143,Ш 30', '978-5-9221-1139-3', N'Линейная алгебра и геометрия', NULL, NULL, N'Москва', 42, 2009, 512, 1000, NULL)
		, (560, NULL, '5,П 27', NULL, N'Занимательные задачи и опыты', NULL, NULL, N'Москва', 48, 1972, 464, 100000, N'Сборник материалов из разных книг Я. И. Перельмана')
		, (561, NULL, NULL, NULL, N'К теории общих дифференциальных операторов в частных производных', NULL, NULL, N'Москва', 18, 1959, 132, NULL, NULL)
		, (562, '519.45 + 517.862', NULL, NULL, N'Арифметические группы и автоморфные функции', NULL, NULL, N'Москва', 2, 1969, 224, NULL, N'Сборник статей')
		, (563, '519.4', NULL, NULL, N'Линейные представления конечных групп', NULL, NULL, N'Москва', 2, 1970, 132, NULL, N'Перевод с французского издания 1967 года')
		, (564, '530.1', NULL, NULL, N'Гомология и феймановские интегралы', NULL, NULL, N'Москва', 2, 1969, 224, NULL, NULL)
		, (565, '519.4', NULL, NULL, N'А.И.Мальцев. Избранные труды. Т.I. Классическая алгебра', NULL, NULL, N'Москва', 5, 1976, 485, 4200, N'В двух томах')
		, (566, '517.1', NULL, NULL, N'А.И.Мальцев. Избранные труды. Т.II. Математическая логика и общая теория алгебраических систем', NULL, NULL, N'Москва', 5, 1976, 388, 4200, N'В двух томах')
		, (567, '517.5', '517.2,П 38', NULL, N'Спектральная теория линейных операторов', NULL, NULL, N'Москва', 5, 1965, 624, 9000, NULL)
		, (568, '519.4 + 513.19', NULL, NULL, N'Группы и их графы', NULL, NULL, N'Москва', 2, 1971, 248, NULL, N'Перевод с английского издания 1964 года')
		, (569, '519.2', NULL, NULL, N'Вероятность', NULL, NULL, N'Москва', 2, 1969, 432, NULL, N'Перевод с английского издания 1961 года')
		, (570, '512', N'22.14 В 48', NULL, N'Линейные представления групп', NULL, NULL, N'Москва', 5, 1985, 144, 7500, NULL)
		, (571, '510 (023)', '511+512+513,Д 69', NULL, N'Пособие по математике для поступающих в ВУЗЫ. Избранные вопросы элементарной математики', NULL, NULL, N'Москва', 5, 1968, 608, 100000, N'Допечатка тиража')
		, (572, NULL, '74.262,Я85', NULL, N'Задачи с параметрами. Книга для учителя', NULL, NULL, N'Москва', 4, 1986, 128, 95000, NULL)
		, (573, '530.1(023)', '22.31,Ф 53', NULL, N'Многоликий солитон', NULL, NULL, N'Москва', 5, 1986, 224, 82000, NULL)
		, (574, '512.98', '517.2,D 39', NULL, N'Руководство к практическому применению преобразования Лапласса и Z-преобразования', NULL, NULL, N'Москва', 5, 1971, 288, 18500, N'Перевод с третьего немецкого издания 1967')
		, (575, '51(07)', N'22.1,Б69', '978-5-4439-1391-9', N'Учимся на чужих ошибках', NULL, NULL, N'Москва', 1, 2019, 168, 2000, NULL)
		, (576, '517.5(083)', '517.23(083),Б 41', NULL, N'Высшие трансцендентные функции. Гипергеометрическая функция. Функции Лежандра', NULL, NULL, N'Москва', 5, 1965, 296, 14000, N'Volume 1. Перевод с английского издания 1953 года')
		, (577, '519.95', '51:16,К 17', NULL, N'Что такое математическая логика', NULL, NULL, N'Москва', 5, 1964, 152, 42000, NULL)
		, (578, '512.1+517.1+511.1', N'22.141+22.161,П 70', '978-5-4439-1395-7', N'Задачи по алгебре. 7 класс.', NULL, NULL, N'Москва', 1, 2019, 80, 2000, NULL)
		, (579, '512.7+519.1', N'22.147+22.176,Ф94', '5-94057-165-4', N'Таблицы Юнга и их приложения к теории представлений и геометрии', NULL, NULL, N'Москва', 1, 2006, 328, 1000, NULL)
		, (580, '512.554.38', N'22.14,Ж51', '978-5-94057-937-3', N'Гауссовы алгебры', NULL, NULL, N'Москва', 1, 2012, 244, 400, NULL)
		, (581, '512', N'22.14,К64', '978-5-4439-2902-6', N'О кватернионах и октавах, об их геометрии, арифметике и симметриях', 2, 'S', N'Москва', 1, 2019, 184, 1000, N'1-е издание вышло в 2009 году')
		, (582, '530.1', '22.31,С50', '978-5-4439-1365-0', N'Квантовая теория поля на обед', NULL, NULL, N'Москва', 1, 2019, 432, 1000, N'Авторский перевод книги Digestible Quantum Field Theory 2016 года Из-ва Springer.')
		, (583, '53 + 51', '22.31,Г85', '5-03-001565-5', N'Теория суперструн. В двух томах. Том 1. Введение', NULL, NULL, N'Москва', 2, 1990, 518, 5500, NULL)
		, (584, '53 + 51', '22.31,Г85', '5-03-001566-3', N'Теория суперструн. В двух томах. Том 2. Петлевые амплитуды, аномалии и феноменология', NULL, NULL, N'Москва', 2, 1990, 656, 5500, NULL)
		, (585, '533.9.01', '22.31,П25', NULL, N'Спиноры и пространство-время. Два-спинорное исчисление и релятивистские поля', NULL, NULL, N'Москва', 2, 1987, 528, 5000, N'Volume 1')
		, (586, '533.9.01', '22.31,П25', N'5-03-001049-1', N'Спиноры и пространство-время. Спинорные и твисторные методы в геометрии пространства-времени', NULL, NULL, N'Москва', 2, 1988, 572, 5000, N'Volume 2')
		, (587, '513.6 + 530.1', '22.314,Т26', NULL, N'Твисторы и калибровочные поля', NULL, NULL, N'Москва', 2, 1983, 368, 4000, N'Сборник статей')
		, (588, '519.1 + 681.3', N'22.143+22.174,П17', NULL, N'Комбинаторная оптимизация. Алгоритмы и сложность', NULL, NULL, N'Москва', 2, 1985, 512, 7500, NULL)
		, (589, '510.2, 510.6', N'22.12,Б 24', NULL, N'Ламбда-исчисление. Его синтаксис и семантика', NULL, NULL, N'Москва', 2, 1985, 606, 4800, NULL)
		, (590, '513', N'22.161,Л 47', '5-211-04054-6', N'Задачи по теории функций действительного переменного', NULL, NULL, N'Москва', 7, 1997, 208, 3000, NULL)
		, (591, NULL, NULL, NULL, N'Элементарная теория аналитических функций одного и нескольких комплексных переменных', NULL, NULL, N'Москва', 18, 1963, 296, NULL, NULL)
		, (592, '517(075.8)', N'22.161,М15', '5-02-013951-3', N'Избранные задачи по вещественному анализу', NULL, NULL, N'Москва', 5, 1992, 432, 3680, NULL)
		, (593, '513.73+513.83(076)', NULL, NULL, N'Сборник задач по дифференциальной геометрии и топологии', NULL, NULL, N'Москва', 7, 1981, 184, 9050, NULL)
		, (594, '512', N'22.14,З93', '978-5-94057-128-X', N'Алгебра и геометрия. Т. 1. Введение', NULL, NULL, N'Москва', 1, 2004, 408, 2000, NULL)
		, (595, '512', N'22.14,З93', '978-5-94057-351-7', N'Алгебра и геометрия. Т. 2. Модули и алгебры', NULL, NULL, N'Москва', 1, 2008, 336, 1000, NULL)
		, (596, '51', N'22.1,А45', '978-5-94057-550-4', N'Алгебра и теория чисел. Сборник задач', 3, 'R&E', N'Москва', 1, 2009, 336, 3000, NULL)
		, (597, NULL, NULL, '978-5-91559-147-8', N'Комбинаторика и теория вероятностей', NULL, NULL, N'Долгопрудный', 49, 2013, 104, 3000, NULL)
		, (598, '517', N'22.1,З86', '978-5-94057-392-0', N'Математический анализ задач естествознания', NULL, NULL, N'Москва', 1, 2008, 136, 1500, NULL)
		, (599,	'515.1', N'22.15,П70', '978-5-94057-903-8', N'Наглядная топология', 3, 'S', N'Москва', 1, 2012, 112, 1000, NULL)
		, (600,	NULL, N'22.141,Г32', '978-5-94057-450-7', N'Алгебра', 2, 'R&E', N'Москва', 1, 2009, 144, 3000, NULL)
		, (601,	'51.001.8', ',А84', '978-5-94057-427-9', N'"Жесткие" и "мягкие" математические модели', 2, 'S', N'Москва', 1, 2008, 32, 1000, NULL)
		, (602,	'512.7', N'22.147,А84', '978-5-94057-443-9', N'Вещественная алгебраическая геометрия', NULL, NULL, N'Москва', 1, 2009, 88, 1000, NULL)


		, (604,	'51', N'22.1, 74.200.58,Я97', '5-94057-182-4', N'Приглашение на Математический праздник', 2, 'E', N'Москва', 1, 2005, 104, 10000, NULL)
		, (605,	'513', N'22.151,Б17', '5-06-000462-7', N'Геометрия дифференцируемых многообразий', NULL, NULL, N'Москва', 26, 1989, 221, 9650, NULL)
		, (606,	'514.11', N'22.151.0,С50', '978-5-4439-0046-9', N'Геометрия. Стереометрия: Пособие для подготовки к ЕГЭ', 2, 'S', N'Москва', 1, 2013, 272, 5000, N'Разработано МИОО')
		, (607,	'517.53/4 (075.8)', N'22.151.0,С50', NULL, N'Аналитические функции', NULL, NULL, N'Москва', 5, 1965, 424, 17000, NULL)
		, (608,	'515.1', N'22.152,Т 583', '978-5-4344-0021-3', N'Кобордизмы в Советском Союзе, 1967-1979', NULL, NULL, N'Москва,Ижевск', 16, 2011, 584, NULL, NULL)
		, (609,	NULL, NULL, NULL, N'Расходящиеся ряды', NULL, NULL, N'Москва', 18, 1951, 504, NULL, NULL)
		, (610,	NULL, NULL, NULL, N'Функциональный анализ и полугруппы', NULL, NULL, N'Москва', 18, 1951, 636, NULL, NULL)
		, (611,	NULL, NULL, NULL, N'Функциональный анализ и полугруппы', NULL, NULL, N'Москва', 18, 1962, 832, NULL, NULL)
		, (612,	NULL, NULL, NULL, N'Дифференцируемые многообразия', NULL, NULL, N'Москва', 18, 1956, 252, NULL, NULL)
		, (613,	NULL, NULL, NULL, N'Теория структур', NULL, NULL, N'Москва', 18, 1952, 408, NULL, NULL)
		, (614,	'517', NULL, NULL, N'Введение в гармонический анализ на евклидовых пространствах', NULL, NULL, N'Москва', 2, 1974, 336, NULL, NULL)
		, (615,	NULL, NULL, NULL, N'Интегрирование в топологических группах и его применение', NULL, NULL, N'Москва', 18, 1950, 224, NULL, N'Перефод с французского издания 1940 года')
		, (616,	'512.542', N'22.144,Ф36', '5-02-014330-8', N'Теория представлений конечных групп', NULL, NULL, N'Москва', 5, 1990, 464, 3070, NULL)
		, (617,	'514.11', N'22.151.0,Г61', '978-5-4439-1389-6', N'Индукция в геометрии', NULL, 'N', N'Москва', 1, 2019, 96, 2000, N'Воспроизводится по изданию из-ва Физматгиз 1961')
		, (618,	'512.81', N'22.14,В24', '978-5-4439-1399-5', N'Введение в теорию представлений', NULL, NULL, N'Москва', 1, 2019, 224, 1000, NULL)
		, (619,	'514.7', N'22.151,Ш26', '978-5-4439-1367-4', N'Дифференциальная геометрия. Обобщение Картана Эрлангенской программы Клейна', NULL, NULL, N'Москва', 1, 2019, 496, 1000, NULL)
		, (620,	'51(07)', N'22.1,И26', '978-5-94057-281-7', N'Игорь Федорович Шарыгин. К 70-летию со дня рождения', NULL, NULL, N'Москва', 1, 2007, 304, 1000, NULL)
		, (621,	'519.4', NULL, NULL, N'Многообразия групп', NULL, NULL, N'Москва', 2, 1969, 304, NULL, NULL)
		, (622,	'517.1+517.8', N'22.144+22.174,Л20', NULL, N'Полугруппы и комбинаторгые приложения', NULL, NULL, N'Москва', 2, 1985, 440, 4200, NULL)
		, (623,	NULL, NULL, NULL, N'Инварианты дифференциальных квадратичных форм', NULL, NULL, N'Москва', 18, 1948, 140, NULL, NULL)
		, (624,	'512.542', N'22.144,Г 68', NULL, N'Конечные простые группы. Введение в их классификацию', NULL, NULL, N'Москва', 2, 1985, 352, 5250, NULL)
		, (625,	'517.53', N'22.161.5,М22', '978-5-94057-800-0', N'Ожерелье Индры. Видение Феликса Клейна', NULL, NULL, N'Москва', 1, 2011, 440, 1000, NULL)
		, (626,	'512.7', N'22.147,В88', '978-5-94057-514-6', N'Теория Ходжа и комплексная алгебраическая геометрия. Том 1.', NULL, NULL, N'Москва', 1, 2010, 344, 1000, N'Перевод с английского издания 2002 г.')
		, (627,	'512.7', N'22.147,В88', '978-5-94057-747-8', N'Теория Ходжа и комплексная алгебраическая геометрия. Том 2.', NULL, NULL, N'Москва', 1, 2011, 368, 1000, N'Перевод с английского издания 2003 г.')
		, (628,	NULL, NULL, NULL, N'Геометрическая теория дифференциальных уравнений', NULL, NULL, N'Москва', 18, 1961, 388, NULL, NULL)
		, (629,	'512.7', N'22.14,К 78', NULL, N'Геометрические методы в теории инвариантов', NULL, NULL, N'Москва', 2, 1987, 312, 5000, NULL)
		, (630,	'512.7', N'22.147,Ш30', '978-5-4439-1253-0', N'Основы алгебраической геометрии', 4, 'R', N'Москва', 1, 2018, 589, 1000, NULL)
		, (631,	'517.5', N'22.162,К60', '5-02-013993-9', N'Элементы теории функций и функционального анализа', 6, 'R', N'Москва', 5, 1989, 624, 35000, NULL)
		, (632,	'514.14', N'22.151.3,П56', '978-5-94057-401-9', N'Афинная и проективная геометрия', NULL, NULL, N'Москва', 1, 2009, 288, 2000, NULL)
		, (633,	'514.112', N'22.151.0,П56', '978-5-94057-398-2', N'Элементарная геометрия. Том 1. Планиметрия, преобразования плоскости', 2, 'S', N'Москва', 1, 2008, 312, 2000, NULL)
		, (634,	'514.112', N'22.151.0,П56', '978-5-94057-223-5', N'Элементарная геометрия. Том 2. Стереометрия, преобразования пространства', NULL, NULL, N'Москва', 1, 2006, 256, 2000, NULL)
		, (635,	'514.112', N'22.151.0,П56', '978-5-94057-400-2', N'Элементарная геометрия. Том 3. Треугольники и тетраэдры', NULL, NULL, N'Москва', 1, 2009, 192, 2000, NULL)
		, (636,	'513', ',М74', NULL, N'Геометрия.', NULL, NULL, N'Москва', 4, 1972, 624, 40000, NULL)
		, (637,	NULL, NULL, NULL, N'Обобщенные функции. Выпуск 3. Некоторые вопросы теории дифференциальных уравнений', NULL, NULL, N'Москва', 3, 1958, 276, 8000, NULL)
		, (638,	'511.2', '517.1,Ч 18', NULL, N'Арифметические функции', NULL, NULL, N'Москва', 5, 1975, 272, 10000, NULL)
		, (639,	NULL, '517.2,Ф 94', NULL, N'Введение в теорию аналитических функций многих комплексных переменных', 2, 'RC&E', N'Москва', 3, 1962, 420, 9000, NULL)
		, (640,	'517.5', N'22.161.5,Ш 12', NULL, N'Введение в комплексный анализ. Часть I', 3, 'RC&E', N'Москва', 5, 1985, 336, 13400, NULL)
		, (641,	'517.5', N'22.161.5,Ш12', NULL, N'Введение в комплексный анализ. Часть II', 3, 'RC&E', N'Москва', 5, 1985, 464, 13400, NULL)
		, (642,	'51.949', NULL, NULL, N'Элементы топологии и дифференцируемые многообразия', NULL, NULL, N'Москва', 2, 1967, 392, NULL, N'Перевод с румынского издания 1964 г.')
		, (643,	NULL, '17.2.2,Ф88', NULL, N'Элементарное введение в абстрактную алгебру', NULL, NULL, N'Москва', 2, 1979, 260, 75000, N'Перевод с венгерского издания 1972 г.')
		, (644,	'511.2', '517.1,Б 82', NULL, N'Теория чисел', 2, NULL, N'Москва', 5, 1972, 496, 12000, NULL)
		, (645,	'517', '517.2,К 79', NULL, N'Линейные уравнения в банаховом пространстве', NULL, NULL, N'Москва', 5, 1971, 104, 12500, NULL)
		, (646,	'512', NULL, NULL, N'Булевы алгебры', NULL, NULL, N'Москва', 2, 1969, 376, NULL, NULL)
		, (647,	'554.31', N'22.144,Х18', '5-900916-79-0', N'Введение в теорию алгебр Ли и их представлений', NULL, NULL, N'Москва', 1, 2003, 216, 1000, NULL)
		, (648,	'517', '517,2,К96', NULL, N'Лекции по конструктивному математическому анализу', NULL, NULL, N'Москва', 5, 1973, 448, 7800, NULL)
		, (649,	'519.4', NULL, NULL, N'Модули и кольца', NULL, NULL, N'Москва', 2, 1981, 368, 6000, NULL)
		, (650,	'513.83', N'22.15,М 71', NULL, N'Векторные расслоения и их применение', NULL, NULL, N'Москва', 5, 1984, 208, 7000, NULL)
		, (651,	'512 ; 519.46', NULL, NULL, N'Полупростые алгебры Ли', NULL, NULL, N'Москва', 2, 1981, 336, 6000, NULL)
		, (652,	'517.11; 519.50', NULL, NULL, N'Очерки по конструктивной математике', NULL, NULL, N'Москва', 2, 1975, 136, NULL, NULL)
		, (653,	'512 ; 519.46', NULL, NULL, N'Алгебры Ли и локально компактные группы', NULL, NULL, N'Москва', 2, 1974, 152, NULL, NULL)
		, (654,	'519.10', NULL, NULL, N'Комбинаторная математика', NULL, NULL, N'Москва', 2, 1966, 156, NULL, NULL)
		, (655,	'513.88', NULL, NULL, N'Топологические векторные пространства', NULL, NULL, N'Москва', 2, 1967, 260, NULL, NULL)
		, (656,	'513.83', NULL, NULL, N'Введение в теорию узлов', NULL, NULL, N'Москва', 2, 1967, 348, NULL, NULL)
		, (657,	'513.6', NULL, NULL, N'Геометрическая теория инвариантов', NULL, NULL, N'Москва', 2, 1974, 280, NULL, NULL)
		, (658, '517.43+519.4+513.013', N'22.162,Р56', NULL, N'Принципы современной математической физики. 2', NULL, NULL, N'Москва', 2, 1984, 381, 12000, N'Перевод с изд. 1981 г.')
		, (659, '512.8', N'22.144,Х 18', NULL, N'Линейные алгебраические группы', NULL, NULL, N'Москва', 5, 1980, 400, 8300, NULL)
		, (660, NULL, NULL, NULL, N'Три жемчужины теории чисел', NULL, NULL, N'Ленинград', 23, 1947, 72, 25000, NULL)
		, (661, NULL, N'22.161 22.162', '5-484-00384-9', N'Дифференцирование отображений в бесконечномерных векторных пространствах', NULL, NULL, N'Москва', 33, 2006, 176, 500, NULL)
		, (662, '51(091)', N'22.1,Ф43', '5-02-014121-6', N'Исследования по теории чисел и диофантову анализу', NULL, NULL, N'Москва', 5, 1992, 320, 1295, NULL)
		, (663, '519.1', N'22.152,Г12', '5-03-001850-6', N'Стратифицированная теория Морса', NULL, NULL, N'Москва', 2, 1991, 351, 2150, NULL)
		, (664, '517.53', N'22.161.5,К94', NULL, N'Введение в теорию пространств H^p', NULL, NULL, N'Москва', 2, 1984, 368, 4200, NULL)
		, (665, '519.5', NULL, NULL, N'Прикладная комбинаторная математика. Сборник статей', NULL, NULL, N'Москва', 2, 1968, 364, NULL, NULL)

		, (666, '513.6', NULL, NULL, N'Алгебраическая геометрия', NULL, NULL, N'Москва', 2, 1981, 600, 8000, N'Перевод с английского издания 1977')
		, (667, '51-7(0.062)', '22,К47', '5-03-00918-3', N'Математика. Поиск истины', NULL, NULL, N'Москва', 2, 1988, 295, 100000, NULL)
		, (668, NULL, NULL, NULL, N'Современная алгебра. Часть I', NULL, NULL, N'Москва,Ленинград', 30, 1947, 340, 8000, NULL)
		, (669, '511.334', N'22.13,А65', '5-02-014234-4', N'Модулярные формы и операторы Гекке', NULL, NULL, N'Москва', 5, 1990, 448, 1500, NULL)
		, (670, '517.1', N'22.132,К55', NULL, N'p-адические числа, p-адический анализ и дзета-функции', NULL, NULL, N'Москва', 2, 1981, 192, 7900, N'Перевод с английского издания 1977 г.')
		, (671, '512.8', N'22.144,Б64', NULL, N'Теория решеток', NULL, NULL, N'Москва', 5, 1984, 568, 9400, N'Перевод с английского издания 1967 г.')
		, (672, '512.54', N'22.144,Ч12', NULL, N'Развитие комбинаторной теории групп. Очерк истории развития идей', NULL, NULL, N'Москва', 2, 1985, 255, 4150, NULL)
		, (673, '513.6', N'22.14,К48', NULL, N'Мозаика теории комплексных кривых', NULL, NULL, N'Москва', 2, 1984, 160, 7000, N'Перевод с англ. издания 1980 г.')
		, (674, '512:513.19', NULL, NULL, N'n-угольники', NULL, NULL, N'Москва', 2, 1973, 248, 7000, N'Перевод с англ. издания 1980 г.')
		, (675, '515.14', N'22.14,М60', NULL, N'Симметрические билинейные формы', NULL, NULL, N'Москва', 5, 1986, 176, 6400, N'Перевод с англ. издания 1973 г.')
		, (676, '519.46', N'22.14,Д 40', NULL, N'Теория представлений симметрических групп', NULL, NULL, N'Москва', 2, 1982, 216, 4000, NULL)
		, (677, '513.83', NULL, NULL, N'Четырехмерная топология', NULL, NULL, N'Москва', 2, 1981, 288, 5800, NULL)
		, (678, '519.4', NULL, NULL, N'Изоморфизмы классических групп над целостными кольцами', NULL, NULL, N'Москва', 2, 1980, 272, 2900, NULL)
		, (679, '512.81+511.7', '222.14+22.13,А45', NULL, N'Алгебра и теория чисел (с приложениями). Избранные доклады семинара Н. Бурбаки. Сб. статей. 1976-1985 гг.', NULL, NULL, N'Москва', 2, 1987, 272, 4800, N'Перевод с английского и французкого')
		, (680, NULL, NULL, NULL, N'Оценки вблизи границы решений эллиптических уравнений в частных производных при общих граничных условиях. I', NULL, NULL, N'Москва', 18, 1962, 208, NULL, N'На обложке "Оценки решений эллиптических уравнений вблизи границы"')
		, (681, '519.45, 517.862', NULL, NULL, N'Автоморфные формы на полупростых группах Ли', NULL, NULL, N'Москва', 18, 1971, 247, NULL, NULL)
		, (682, '517.11', N'22.12,Г 47', NULL, N'Основания математики. Теория доказательств', NULL, NULL, N'Москва', 5, 1982, 656, 18000, NULL)
		, (683, '517.947', NULL, NULL, N'Лекции по линейным уравнениям в частных производных с постоянными коэффициентами', NULL, NULL, N'Москва', 2, 1965, 296, NULL, NULL)
		, (684, '519.2+531,19+517', NULL, NULL, N'Евклидова квантовая теория поля. Марковский подход. Сборник статей', NULL, NULL, N'Москва', 2, 1978, 288, 5400, NULL)
		, (685, '517', NULL, NULL, N'Дифференцирование интегралов в R^n', NULL, NULL, N'Москва', 2, 1978, 200, NULL, NULL)
		, (686, '513.83+519.49', NULL, NULL, N'Теория шейпов', NULL, NULL, N'Москва', 2, 1976, 192, NULL, NULL)
		, (687, '51(023)', N'22.1,Г20', NULL, N'Математические чудеса и тайны', 5, 'S', N'Москва', 5, 1986, 128, 700000, N'Математические фокусы и головоломки')
		, (688, '519.21(075.8)', N'22.171', '978-5-4439-1392-6', N'Курс лекций по теории вероятностей и математической статистике', NULL, NULL, N'Москва', 1, 2019, 144, 1000, NULL)
		, (689, '514.76', N'22.151,Н33', '978-5-4439-1451-0', N'Введение в теорию гладких многообразий', NULL, NULL, N'Москва', 1, 2020, 96, 800, NULL)
		, (690, '517', NULL, NULL, N'SL2(R)', NULL, NULL, N'Москва', 2, 1977, 432, NULL, NULL)
		, (691, '513', N'22.15,В72', NULL, N'Пространства постоянной кривизны', NULL, NULL, N'Москва', 5, 1982, 480, 8000, NULL)
		, (692, NULL, NULL, NULL, N'Алгебраическая топология', NULL, NULL, N'Москва', 18, 1949, 504, NULL, N'Перевод с английского издания 1942 г.')
		, (693, '513.814', N'22.151.2,Б61', NULL, N'Глобальная лоренцева геометрия', NULL, NULL, N'Москва', 2, 1985, 400, 4500, N'Перевод с английского издания 1981 г.')
		, (694, '512.7+512.817+512.7+514.174.5+515.179+517.54', N'22.152,А76', '5-02-014289-1', N'Геометрия дискретных групп и многообразий', NULL, NULL, N'Москва', 5, 1991, 432, 2100, NULL)
		, (695, '512', NULL, NULL, N'Алгебра', NULL, NULL, N'Москва', 2, 1968, 564, NULL, N'Перевод с английского издания 1965 г.')
		, (696, NULL, NULL, NULL, N'Коммутативная алгебра. Том 1', NULL, NULL, N'Москва', 18, 1963, 376, NULL, N'Перевод с английского издания 1958 г.')
		, (697, NULL, NULL, NULL, N'Коммутативная алгебра. Том 2', NULL, NULL, N'Москва', 18, 1963, 440, NULL, N'Перевод с английского издания 1960 г.')
		, (698, NULL, NULL, NULL, N'Методы алгебраической геометрии. Том I', NULL, NULL, N'Москва', 18, 1954, 464, NULL, N'Перевод с английского издания 1947 г.')
		, (699, NULL, NULL, NULL, N'Методы алгебраической геометрии. Том II', NULL, NULL, N'Москва', 18, 1954, 432, NULL, N'Перевод с английского издания 1952 г.')
		, (700, NULL, NULL, NULL, N'Методы алгебраической геометрии. Том III', NULL, NULL, N'Москва', 18, 1955, 376, NULL, N'Перевод с английского издания 1954 г.')
		, (701, '513.6', NULL, NULL, N'Алгебраическая геометрия 1 Комплексные проективные многообразия', NULL, NULL, N'Москва', 2, 1979, 256, 8000, N'Перевод с английского издания 1976 г.')
		, (702, '512.7', N'22.14,Р49', '5-03-001792-5', N'Алгебраическая геометрия для всех', NULL, NULL, N'Москва', 2, 1991, 151, 19000, N'Перевод с английского издания 1988 г.')
		, (703, '512.7', N'22.147,Х21', '5-94057-084-4', N'Алгебраическая геометрия. Начальный курс', NULL, NULL, N'Москва', 1, 2005, 400, 1000, N'Перевод с английского издания 1992 г.')
		, (704, '512.7', N'22.147,М22', '978-5-4439-0127-5', N'Красная книга о многообразиях и схемах', 2, 'E', N'Москва', 1, 2014, 400, 1000, N'Перевод с английского издания 1999 г.')
		, (705, '512+513.836', NULL, NULL, N'Алгебраическая K-теория', NULL, NULL, N'Москва', 2, 1973, 592, NULL, N'Перевод с английского издания 1968 г.')
		, (706, '513.731', N'22.151, К 55', NULL, N'Основы дифференциальной геометрии. Том 1', NULL, NULL, N'Москва', 5, 1981, 344, 15000, N'Перевод с английского издания 1963 г.')
		, (707, '513.731', N'22.151, К 55', NULL, N'Основы дифференциальной геометрии. Том 2', NULL, NULL, N'Москва', 5, 1981, 416, 15000, N'Перевод с английского издания 1969 г.')
		, (708, '513.83', N'22.151,Ф76', '5-211-00083-8', N'Симплектическая геометрия. Методы и приложения', NULL, NULL, N'Москва', 7, 1988, 413, 4450, NULL)
		, (709, NULL, N'22.151.4, 22.311, 22.312*, 22.313', '5-354-00256-7', N'Риманова геометрия и тензорный анализ', 4, 'S', N'Москва', 6, 2003, 664, 1500, NULL)
		, (710, '512.05 (083)', N'22.144,О28', '5-02-014426-6', N'Общая алгебра. Том 1', NULL, NULL, N'Москва', 5, 1990, 592, 30000, NULL)
		, (711, '512.05 (083)', N'22.144,О28', '5-02-014427-4', N'Общая алгебра. Том 2', NULL, NULL, N'Москва', 5, 1991, 480, 25500, NULL)
		, (712, '513.015.7', NULL, NULL, N'Лекции о кривых на алгебрической поверхности', NULL, NULL, N'Москва', 2, 1968, 236, NULL, N'Перевод с английского издания 1966 г.')
		, (713, '519.49', NULL, NULL, N'Кольца и модули', NULL, NULL, N'Москва', 2, 1971, 280, NULL, N'Перевод с английского издания 1966 г.')
		, (714, '519.44', NULL, NULL, N'Когомологии Галуа', NULL, NULL, N'Москва', 2, 1968, 208, NULL, N'Перевод с французского издания 1964 г.')
		, (715, NULL, NULL, NULL, N'Группы Ли и дифференциальная геометрия', NULL, NULL, N'Москва', 18, 1960, 128, NULL, N'Перевод с английского издания 1956 г.')
		, (716, NULL, NULL, NULL, N'Строение группы и строение структуры ее подгрупп', NULL, NULL, N'Москва', 18, 1960, 160, NULL, N'Перевод с английского издания 1956 г.')
		, (717, NULL, NULL, NULL, N'Дифференциальное и интегральное исчисления на комплексном аналитическом многообразии', NULL, NULL, N'Москва', 18, 1961, 144, NULL, N'Перевод с французского издания 1959 г.')
		, (718, '513.88', NULL, NULL, N'Топологические векторные пространства', NULL, NULL, N'Москва', 2, 1971, 360, NULL, N'Перевод с английского издания 1966 г.')
		, (719, NULL, NULL, NULL, N'Внешние дифференциальные системы и их геометрические приложения', NULL, NULL, N'Москва', 7, 1962, 240, 5000, NULL)
		, (720, '517.5', 'Ф00', '5-87597-016-2', N'Теория функций и функциональный анализ. Часть первая. Теория функций', NULL, NULL, N'Москва', 11, 2000, 184, 400, NULL)
		, (721, '517.5', 'Ф00', '5-87597-016-2', N'Теория функций и функциональный анализ. Часть вторая. Функциональный анализ', NULL, NULL, N'Москва', 11, 2000, 192, 400, NULL)
		, (722, '513.7;514.7', NULL, NULL, N'Теория дифференциально-геометрических структур', NULL, NULL, N'Москва', 7, 1987, 190, 4360, NULL)
		, (723, '514.172.4+519.1', N'22.151+22.176,Ц58', '978-5-4439-0123-7', N'Теория многогранников', NULL, NULL, N'Москва', 1, 2014, 568, 400, NULL)
		, (724, '512.7,512.667', N'22.147,M23', '978-5-4439-1455-8', N'Введение в теорию схем и квантовые группы', 2, 'EX', N'Москва', 1, 2020, 320, 1000, NULL)
		, (725, '511.6+514.13', N'22.132+22.151.2,Г90', '5-94057-034-8', N'Группы, действующие на гиперболическом пространстве: гармонический анализ и теория чисел', NULL, NULL, N'Москва', 1, 2003, 640, 1000, NULL)
		, (726, '512', N'22.14,З93', '978-5-4439-1357-5', N'Алгебра и геометрия. Т. 3. Проективные геометрии и геометрии Кэли-Клейна', NULL, NULL, N'Москва', 1, 2020, 512, 1000, NULL)
		, (727, NULL, NULL, NULL, N'Основания алгебраической топологии', NULL, NULL, N'Москва', 3, 1958, 404, 4000, N'11-5-4,Перевод с английского издания 1952 г.')
		, (728, NULL, NULL, NULL, N'Топология', NULL, NULL, N'Москва', 50, 1938, 400, 5000, N'Перевод с немецкого')
		, (729, '513.013:513.731:513.838', NULL, NULL, N'Дифференциальная геометрия и расслоения', NULL, NULL, N'Москва', 2, 1975, 352, NULL, N'Перевод с немецкого издания 1972 г.')
		, (730, '519.7', '32.816,Ш23', NULL, N'Решение логических и игровых задач (логико-психологические этюды)', NULL, NULL, N'Москва', 51, 1984, 152, 15000, NULL)
		, (731, '513.83', N'22.1522,А 28', NULL, N'Бесконечнократные пространства петель', NULL, NULL, N'Москва', 2, 1982, 200, 5300, NULL)
		, (732, '513.836:513:838', NULL, NULL, N'Теория Морса', NULL, NULL, N'Москва', 2, 1965, 184, NULL, N'Перевод с английского издания 1963 г.')
		, (733, '513.836', NULL, NULL, N'Геометрическая топология. Локализация, периодичность и симметрия Галуа', NULL, NULL, N'Москва', 2, 1975, 288, NULL, N'Перевод с английского издания 1970 г.')
		, (734, '512.552', N'22.144,П 33', NULL, N'Ассоциативные алгебры', NULL, NULL, N'Москва', 2, 1986, 543, NULL, N'Перевод с английского издания 1982 г.')
		, (735,	'515.1', NULL, '5-93972-389-6', N'Кобордизмы и их приложения. Том I', NULL, NULL, N'Москва,Ижевск', 16, 2005, 506, NULL, NULL)
		, (736,	'515.1', NULL, '5-93972-390-X', N'Характеристические классы и гладкие структуры на многообразиях. Том II', NULL, NULL, N'Москва,Ижевск', 16, 2005, 400, NULL, NULL)
		, (737,	'515.1', NULL, '5-93972-484-1', N'Спектральные последовательности в топологии. Том III', NULL, NULL, N'Москва,Ижевск', 16, 2005, 640, NULL, NULL)
		, (738,	'514.17', N'22.151,Л 42', NULL, N'Выпуклые множества', NULL, NULL, N'Москва', 5, 1985, 336, 4650, N'Перевод с немецкого издания 1980 г.')
		, (739,	'517.2', ',Г32', NULL, N'Обобщенные функции. Выпуск 5. Интегральная геометрия и связанные с ней вопросы теории представлений', NULL, NULL, N'Москва', 3, 1962, 656, 8500, NULL)
		, (740,	'517.9', N'22.161.6,Э81', NULL, N'Обыкновенные дифференциальные уравнения. Качественная теория с приложениями', NULL, NULL, N'Москва', 2, 1986, 243, 12900, N'Перевод с английского издания 1982 г.')
		, (741,	'517', NULL, NULL, N'Дифференцируемые ростки и катастрофы', NULL, NULL, N'Москва', 2, 1977, 208, NULL, N'Перевод с английского издания 1975 г.')
		, (742,	'513', NULL, NULL, N'Геометрические неравенства', NULL, NULL, N'Ленинград', 5, 1980, 288, 2800, N'На обложке первый автор Д.М.Бураго')
		, (743,	'514.75', N'22.15,Л76', NULL, N'Симметрические пространства', NULL, NULL, N'Москва', 5, 1985, 208, 7200, N'Перевод с английского издания 1969 г.')
		, (744,	'513', N'22.151.0,Б 50', NULL, N'Циклоида', 3, NULL, N'Москва', 5, 1980, 112, 108000, NULL)
		, (745,	'511', NULL, NULL, N'Введение в аналитическую теорию чисел', NULL, NULL, N'Москва', 2, 1974, 188, NULL, N'Перевод с английского издания 1968 г.')
		, (746,	'511.92', '517.1,В75', '5-02-014637-4', N'Числа фибоначчи', 6, 'E', N'Москва', 5, 1992, 192, 8800, NULL)
		, (747,	'513.0', '513,Л93', NULL, N'Кинематический метод в геометрических задачах', 2, 'R', N'Москва', 5, 1976, 48, NULL, NULL)
		, (748,	'511(023)', N'22.131,В75', '5-02-013731-6', N'Признаки делимости', 4, 'R', N'Москва', 5, 1988, 96, 165000, N'3-е издание - 1980 г.')
		, (749,	'517.43, 517.5/9', NULL, NULL, N'Возмущение спектра операторов в гильбертовом пространстве', NULL, NULL, N'Москва', 2, 1969, 232, NULL, N'Перевод с английского издания 1965 г.')
		, (750,	'511.6+519.4+518.5', NULL, NULL, N'Вычисления в алгебре и теории чисел', NULL, NULL, N'Москва', 2, 1976, 305, NULL, NULL)
		, (751, '513.8; 517.9; 531.3', NULL, NULL, N'Введение в дифференциальную динамику', NULL, NULL, N'Москва', 2, 1975, 304, NULL, N'Перевод с английского издания 1971 г.')
		, (752, '681.142.1 + 621.316', '32.97,С 24', NULL, N'Графы, сети и алгоритмы', NULL, NULL, N'Москва', 2, 1984, 455, 11000, N'Перевод с английского')
		, (753, '512.772', N'22.147, К14', '978-5-4439-1353-7', N'Алгебраические кривые. По направлению к пространствам модулей', NULL, NULL, N'Москва', 2, 2019, 272, 1500, NULL)
		, (754, '513.73', N'22.151,М71', '5-88688-048-8', N'Курс дифференциальной геометрии и топологии', NULL, NULL, N'Москва', 13, 2000, 448, 3000, NULL)
		, (755, '512.77+517.912+517.958', NULL, '5-93972-459-0', N'Интегрируемые системы в методе разделения переменных', NULL, NULL, N'Москва-Ижевск', 16, 2005, 384, NULL, NULL)
		, (756, '517.53/.55', N'22.152.4,В24', '978-5-93972-697-9', N'Введение в программу Ленглендса', NULL, NULL, N'Москва-Ижевск', 16, 2008, 368, NULL, N'Сборник работ авторов D.Bump, L.W.Cogdel, E.de Shalit, D.Gaitsgory, E.Kowalski, S.S.Kudla')
		, (757, '517', NULL, '5-93972-262-8', N'Интегрируемые системы. Теоретико-групповой подход', NULL, NULL, N'Москва-Ижевск', 16, 2003, 352, 700, NULL)
		, (758, '514.74+512.64', N'22.15,Ф33', '5-93196-105-4', N'Курс аналитической геометрии и линейной алгебры', 2, 'R', N'Москва', 52, 2003, 328, 5000, NULL)
		, (759, '51(07)', N'22.1,К59', '978-5-4439-2958-3', N'Сказки и подсказки. Задачи для математического кружка', 13, 'S', N'Москва', 2, 2019, 168, 2000, NULL)
		, (760, '512.1+517.1+511.1', N'22.141+22.161,П70', '978-5-4439-2540-0', N'Задачи по алгебре, арифметике и анализу', 3, 'S', N'Москва', 1, 2017, 608, 2000, NULL)
		, (761, '517.91', '517.2,В 57', NULL, N'Обобщенные функции в математической физике', NULL, NULL, N'Москва', 5, 1976, 280, 12000, NULL)
		, (762, NULL, NULL, NULL, N'Алгебра. Топология. Геометрия 1967', NULL, NULL, N'Москва', 53, 1969, 228, 1000, NULL)
		, (763, NULL, NULL, NULL, N'Алгебра. Топология. Геометрия. Том 13', NULL, NULL, N'Москва', 53, 1975, 344, 1400, NULL)
		, (764, NULL, NULL, NULL, N'Вариационное исчисление в целом', NULL, NULL, N'Москва', 18, 1947, 148, NULL, N'Перевод с немецкого издания 1938 г.')
		, (765, '517.43', NULL, '5-211-03475-9', N'Метод сжатых отображений в симметричной проблеме собственных значений', NULL, NULL, N'Москва', 7, 1995, 143, 500, NULL)
		, (766, '51+007(023)', '62.81,Я 27', NULL, N'Булева структура и ее модели', NULL, NULL, N'Москва', 54, 1980, 192, 25000, NULL)
		, (767, NULL, N'22.151,К63', NULL, N'Многообразие геометрии', NULL, NULL, N'Москва', 55, 1981, 208, 50000, N'Перевод с японского издания 1977 г.')
		, (768, '501(09)', '20г,Г49', NULL, N'Рассказы о физиках и математиках', NULL, NULL, N'Москва', 5, 1982, 192, 150000, N'Допечатка 150000')
		, (769, NULL, NULL, '5-03000535-8', N'Elements of Higer Mathematics For High-School Students', NULL, NULL, N'Москва', 2, 1989, 368, NULL, N'Перевод с русского издания 1987 г. издательства Наука: Элементы высшей математики для школьников')
		, (770, '517.5(083)', '517.2(083),Б 41', NULL, N'Высшие трансцендентные функции. Том 1. Гипергеометрическая функция. Функции Лежандра', 2, 'S', N'Москва', 5, 1973, 296, 14000, NULL)
		, (771, '517.5(083)', '517.2(083),Б 41', NULL, N'Высшие трансцендентные функции. Том 2. Функции Бесселя. Функции параболического цилиндра. Ортогональные многочлены.', 2, 'S', N'Москва', 5, 1974, 296, 13500, NULL)
		, (772, '519.6', N'22.18,А 48', NULL, N'Оптимальное управление', NULL, NULL, N'Москва', 5, 1979, 432, 24000, NULL)
		, (773, '519.4', N'22.144,А 46', NULL, N'Введение в теорию групп', NULL, NULL, N'Москва', 5, 1980, 144, 100000, NULL)
		, (774, '517.944', NULL, NULL, N'Лекции по современной теории уравнений в частных производных', NULL, NULL, N'Москва', 2, 1967, 132, NULL, N'Перевод с японского издания ')
		, (775, '517.9', N'22.161.6,Д26', '5-02-014208-5', N'Многомерный анализ и дискретные модели', NULL, NULL, N'Москва', 5, 1990, 240, 2750, NULL)
		, (776, '517', N'22.16,Д 26', NULL, N'Общие вопросы теории граничных задач', NULL, NULL, N'Москва', 5, 1980, 208, 5800, NULL)
		, (777, '511+512+514+515.1+517', N'22.1,Т78', '5-03-001707-0', N'Труды семинара Н.Бурбаки за 1988 г.', NULL, NULL, N'Москва', 2, 1990, 304, 2300, N'Сборник статей')
		, (778, '517+514', N'22.16+22.151,Т77', '5-03-02680-0', N'Труды семинара Н.Бурбаки за 1988 г.', NULL, NULL, N'Москва', 2, 1996, 348, 1000, N'Сборник статей')
		, (779, '52+53', NULL, NULL, N'Эллипсоидальные фигуры равновесия', NULL, NULL, N'Москва', 2, 1973, 288, NULL, N'Перевод с английского издания 1969 г.')
		, (780, '517.53(075.8)', NULL, NULL, N'Теория функций комплексного переменного и ее приложения', NULL, NULL, N'Москва', 56, 1986, 248, 4906, NULL)
		, (781, '513.0 (03)', '51.3 (03)', NULL, N'Энциклопедия элементарной математики. Книга пятая. Геометрия', NULL, NULL, N'Москва', 5, 1966, 624, 25000, NULL)
		, (782, '513.73', N'22.151,Т61', NULL, N'Начальные главы дифференциальной геометрии', NULL, NULL, N'Москва', 2, 1982, 360, 10000, NULL)
		, (783, '515.0', NULL, NULL, N'Основы проективной геометрии', NULL, NULL, N'Москва', 2, 1970, 160, NULL, N'Перевод с английского с издания 1967 г.')
		, (784, '11-5-2', NULL, NULL, N'Энциклопедия элементарной математики. Книга третья. Функции и пределы.', NULL, NULL, N'Москва,Ленинград', 30, 1952, 560, 50000, NULL)
		, (785, '519.4', NULL, NULL, N'Линейные алгебраические группы', NULL, NULL, N'Москва', 2, 1972, 272, NULL, N'Перевод с английского с издания 1969 г.') --Борель
		, (786, '513.6', NULL, NULL, N'Алгебраические группы и поля классов', NULL, NULL, N'Москва', 2, 1968, 288, NULL, N'Перевод с французского издания 1959 г.') --Серр
		, (787, '517.1', NULL, NULL, N'Римановы поверхности', NULL, NULL, N'Москва', 2, 1980, 248, 8800, N'Перевод с немецкого издания 1977 г.') --Форстер
		, (788, '517.5', N'22.161,Л 44', NULL, N'Эллиптические функции', NULL, NULL, N'Москва', 5, 1984, 312, 5500, N'Перевод с английского с издания 1973 г.') --Ленг
		, (789, '513.83+517.42', NULL, NULL, N'Гомотопическая теория дифференциальных форм', NULL, NULL, N'Москва', 2, 1981, 192, 4700, NULL)
		, (790, '513.83', N'22.152,М 13', NULL, N'Классифицирующие пространства для перестроек и кобордизмов многообразий', NULL, NULL, N'Москва', 2, 1984, 280, 2780, N'Перевод с английского с издания 1979 г.') -- Мадсен, Милгрэм
		, (791, '515.1(075.8)', N'22.152,Т81', '5-02-014811-3', N'Элементы геометрии и топологии минимальных поверхностей', NULL, NULL, N'Москва', 5, 1991, 176, 5750, NULL) 
		, (792, NULL, '17.2.2,Л72', NULL, N'Математическая мозаика', NULL, NULL, N'Москва', 2, 1980, 344, 100000, NULL) 
		, (793, NULL, '51,К98', NULL, N'История с узелками', NULL, NULL, N'Москва', 2, 1973, 408, NULL, NULL) 
		, (794, NULL, NULL, '5-87597-061-8', N'Уравнения с частными производными первого порядка. (Учебное пособие)', NULL, NULL, N'Москва', 8, 1999, 96, 500, NULL) 			--Горицкий и др.
		, (795, '512.2 512.3', '512,М 89', NULL, N'Математические соревнования Геометрия', NULL, NULL, N'Москва', 5, 1974, 80, 350000, NULL) 
		, (796, '519.2', N'22.171,П 84', NULL, N'Задачи по теории вероятностей. Основные понятия. Предельные теоремы. Случайные процессы.', NULL, NULL, N'Москва', 5, 1986, 328, 23000, NULL) 	--Прохоров и др.
		, (797, '517.11', NULL, NULL, N'Прикладной нестандартный анализ', NULL, NULL, N'Москва', 2, 1980, 240, 10700, NULL) 														--Девис
		, (798, '519.7', N'22.18,К88', '5-02-014266-2', N'Основы теории однородных структур', NULL, NULL, N'Москва', 5, 1990, 296, 2060, NULL) 										--Кудрявцев и др.
		, (799, '517.9', N'22.161,Б87', '5-02-015168-8', N'Степенная геометрия в алгебраических и дифференциальных уравнениях', NULL, NULL, N'Москва', 42, 1998, 288, 1500, NULL)	--Брюно
		, (800, '514.7+517.977.1;517.971.1+514.7;517.977.1+514.7;517.974+515.164.152+515.164.174', NULL, NULL, N'Итоги науки и техники. Современные проблемы математики. Новейшие достижения. Том 35', 
			NULL, NULL, N'Москва', 53, 1989, 240, 800, NULL)
		, (801, '087.5:511.1', N'22.130,П 27', '985-09-0020-2', N'Занимательная арифметика. Загадки и диковинки в мире чисел', NULL, NULL, N'Минск', 57, 1996, 175, 10000, NULL) --Перельман
		, (802, '517.925', N'22.161.6+22.152,Ж73', '978-5-4439-0213-5', N'Топологическая сопряженность псевдоаносовских гомеоморфизмов', NULL, NULL, N'Москва', 1, 2013, 368, 400, NULL) 							--Жиров
		, (803, '51', N'22.10,З-29', NULL, N'Заочные математические олимпиады', NULL, NULL, N'Москва', 5, 1981, 128, 300000, NULL)
		, (804, '539.123.01', NULL, NULL, N'Групповые методы в теории элементарных частиц', NULL, NULL, N'Москва', 58, 1965, 176, 3900, NULL)
		, (805, '531/535', N'22.3,Г63', '5-06-002686-8', N'Сборник вопросов и задач по физике', 6, 'S', N'Москва', 26, 1993, 352, 50000, NULL) 									--Гольдфарб
		, (806, '512', N'22.10,Б 33', NULL, N'Задачи по математике. Алгебра и анализ', NULL, NULL, N'Москва', 5, 1982, 192, 150000, NULL) 
		, (807, '51', N'22.11,А 46', NULL, N'Аналитические функции комплексного переменного', NULL, NULL, N'Москва', 26, 1984, 192, 10000, NULL) 
		, (808, NULL, NULL, NULL, N'Однолистные функции и конформные отображения', NULL, NULL, N'Москва', 18, 1962, 268, 6000, NULL)											-- Дж. Дженкинс
		, (809, '51', N'74.200.58:22.1,М82', '5-94057-232-4', N'Московские математические олимпиады 1993-2005 г.', NULL, NULL, N'Москва', 1, 2006, 456, 5000, NULL) 			-- Федоров,Канель-Белов,Ковальджи,Ященко
		, (810, '373.167.1:512', N'22.141я71.6', NULL, N'Дробно-рациональные неравенства', NULL, NULL, N'Москва', 1, 2008, 248, 3000, NULL)									-- Шахмейстер
		, (811, '512/512', N'511/512,Ш 66', NULL, N'Избранные задачи и теоремы элементарной математики. Арифметика и алгебра', 5, 'RC', N'Москва', 5, 1976, 384, 100000, NULL)				-- Шкляровский
		, (812, '517.98', N'22.162,А35', NULL, N'Основы теории линейных операторов в пространствах с индефинитной метрикой', NULL, NULL, N'Москва', 5, 1986, 352, 3730, NULL)			-- Азизов
		, (813, '519.195', N'518,Б 89', NULL, N'Интегральные преобразования обобщенных функций', NULL, NULL, N'Москва', 5, 1977, 288, 19000, NULL)										-- Брычков
		, (814, NULL, NULL, NULL, N'Введение в дифференциальную алгебру', NULL, NULL, N'Москва', 18, 1959, 88, NULL, NULL)				-- Капланский
		, (815, '517.1', NULL, NULL, N'Математический анализ на многообразиях', NULL, NULL, N'Москва', 2, 1968, 164, NULL, N'1965')			-- Спивак
		, (816, '51383', NULL, NULL, N'Введение в теорию дифференцируемых многообразий', NULL, NULL, N'Москва', 2, 1967, 204, NULL, N'1962')	-- Ленг
		, (817, '512.8', N'517.1,А 86', NULL, N'Геометрическая алгебра', NULL, NULL, N'Москва', 5, 1969, 284, 15000, N'1957')				-- Артин
		, (818, '517.55', NULL, NULL, N'Лекции по квазиконформным отображениям', NULL, NULL, N'Москва', 2, 1969, 136, 4906, N'1966')		-- Альфорс
		, (819, NULL, NULL, NULL, N'Введение в теорию диофантовых приближений', NULL, NULL, N'Москва', 18, 1961, 216, NULL, N'1957')		-- Касселс
		, (820, '511.7', NULL, NULL, N'Введение в теорию диофантовых приближений', NULL, NULL, N'Москва', 2, 1970, 104, NULL, N'1966')		-- Ленг
		, (821, '11-4-1', NULL, NULL, N'Простые числа', NULL, NULL, N'Москва', 3, 1959, 136, 15000, NULL)										-- Трост
		, (822, '517.5+517.9', NULL, NULL, N'Теория гиперфункций', NULL, NULL, N'Москва', 2, 1972, 248, 4906, N'Перевод с французского издания 1970 г.')	-- Шапира
		, (823, '51-007', N'32.81,М23', NULL, N'Доказуемое и недоказуемое', NULL, NULL, N'Москва', 54, 1979, 168, 40000, NULL)								-- Манин
		, (824, '515.14', N'22.152,В44', '978-5-94057-894-9', N'Элементарная топология', 2, 'R', N'Москва', 1, 2012, 358, 1500, NULL)								-- Виро
		, (825, '519.3', N'517.6,П 63', NULL, N'Введение в теорию Морса', NULL, NULL, N'Москва', 5, 1971, 568, 10000, NULL)								-- Постников
		, (826, '51(023)', N'2210,К48', NULL, N'Элементарная математика с точки зрения высшей. Т.1. Арифметика. Алгебра. Анализ.', 4, NULL, N'Москва', 5, 1987, 432, 98000, N'1924')				-- Клейн
		, (827, '514.11(023)', N'22.151.0,К48', NULL, N'Элементарная математика с точки зрения высшей. Т.2. Геометрия.', 2, NULL, N'Москва', 5, 1987, 416, 95000, N'1925')							-- Клейн
		, (828, '519.1', N'22.17,В44', '5-89492-014-0', N'Комбинаторика', NULL, NULL, N'Москва', 59, 2006, 400, 3000, NULL)																			-- Виленкин
		, (829, '519.1', N'22.174,К64', '5-03-002368-2', N'Упаковки шаров, решетки и группы. Том 1', NULL, NULL, N'Москва', 2, 1990, 415, 5100, NULL)												-- Конвей
		, (830, '519.1', N'22.174,К64', '5-03-002369-0', N'Упаковки шаров, решетки и группы. Том 2', NULL, NULL, N'Москва', 2, 1990, 376, 5100, NULL)												-- Конвей
		, (831, '519.46', N'22.14,А 28', NULL, N'Лекции по группам Ли', NULL, NULL, N'Москва', 5, 1979, 144, 12500, N'1969')																		-- Адамс
		, (832, '512+519.6', N'22.14+22.19,Н72', '5-03-003318-1', N'Алгебраическая алгоритмика. С упражнениями и решениями', NULL, NULL, N'Москва', 2, 1999, 720, 5000, N'фр 1992')					-- Ноден
		, (833, '517.5', N'22.162,К43', N'5-02-013797-9', N'Теоремы и задачи функционального анлиза', 2, 'RC&E', N'Москва', 5, 1988, 400, 14000, NULL)												-- Кириллов
		, (834, '517.98', N'22.162,Б83', N'978-5-4439-1092-5', N'Задачи по функциональному анализу', NULL, 'NE', N'Москва', 1, 2017, 336, 2000, NULL)												-- Бородин
		, (835, '519.46', NULL, NULL, N'Группы преобразований и теория представлений', NULL, NULL, N'Москва', 2, 1982, 232, 4500, N'1979')															-- Таммо том Дик
		, (836, '519.1', N'22.176,Л22', '978-5-4439-0205-0', N'Введение в дискретную математику', NULL, NULL, N'Москва', 1, 2012, 265, 2000, NULL)													-- Ландо
		, (837, '515.14', N'22.152,С66', '978-5-4439-1463-3', N'Введение в топологию. Лекционный курс', NULL, NULL, N'Москва', 1, 2020, 224, 1000, NULL)											-- Сосинский
		, (838, '517.53', N'22.16,Н33', '978-5-4439-1267-7', N'Комплексный анализ, римановы поверхности и интегрируемые системы', NULL, NULL, N'Москва', 1, 2018, 139, 1000, NULL)					-- Натанзон
		, (839, '519.1', N'22.15,Р18', '978-5-4439-0275-3', N'Линейно-алгебраический метод в комбинаторике', 2, 'E', N'Москва', 1, 2015, 144, 1000, NULL)											-- Райгородский
		, (840, '51(07)', N'22.1,Р15', '978-5-4439-1470-1', N'Числа и фигуры. Опыты математического мышления', NULL, NULL, N'Москва', 1, 2020, 276, 3000, N'Новое изд. Перевод с немецкого')		-- Радемахер
		, (841, '511.6+512.647.2', N'22.132+22.14,К64', '978-5-94057-268-8', N'Квадратичные формы данные нам в ощущениях', NULL, NULL, N'Москва', 1, 2008, 144, 1000, N'Перевод с английского')		-- Конвей
		, (842, '51', N'74.200.58:58.22.1,З315', '978-5-4439-1467-1', N'Задачи Санкт-Петербургской олимпиады школьников по математике 2019 года', NULL, NULL, N'Москва', 1, 2020, 160, 2000, NULL)	-- Кохась
		, (843, '514+515.1', N'22.151+22.152', '5-94057-126-3', N'Введение в h-принцип', NULL, NULL, N'Москва', 1, 2004, 232, 1000, N'Перевод с английского издания 2002 г.')						-- Мишачев
		, (844, '51(07)', N'22.1,Р24', '978-5-4439-1465-7', N'Комбинаторика', NULL, NULL, N'Москва', 1, 2020, 132, 3000, NULL)																		-- Раскина
		, (845, '51(07)', N'22.1,Т 48', '978-5-4439-4045-8', N'Математика абитуриенту', 20, 'R&E', N'Москва', 1, 2020, 944, 3000, NULL)																-- Ткачук
		, (846, NULL, N'22.1,Т 48', '978-5-94057-298-5', N'Математика абитуриенту', 14, 'R&E', N'Москва', 1, 2007, 976, 5000, NULL)																	-- Ткачук
		, (847, '519.4', NULL, NULL, N'Абелевы l-адические представления и эллиптические кривые', NULL, NULL, N'Москва', 2, 1973, 192, NULL, N'Перевод с английского издания 1968 г.')				-- Серр
		, (848, NULL, '22.174 22.18 22.1o', '978-5-9710-6387-2', N'Незнайка в стране графов. Книга для школьников... И НЕ ТОЛЬКО!', 8, 'S', N'Москва', 46, 2019, 160, NULL, NULL)					-- Мельников
		, (849, '51(07)', N'22.1,Б69', '978-5-4439-2868-5', N'Вписанные углы', 2, 'R', N'Москва', 1, 2019, 168, 2000, NULL)																			-- Блинков
		, (850, '515.14', N'22.152,В44', '978-5-4439-2680-3', N'Элементарная топология', 3, 'E', N'Москва', 1, 2018, 358, 1000, NULL)																-- Виро
		, (851, '512', N'22.144.12,Ц181', '978-5-7042-2317-7', N'Основы теории абелевых групп. Учебное пособие', NULL, NULL, N'Москва', 60, 2012, 66, 210, NULL)									-- Царев
		, (852, '515.12', N'22.152я73,И265', '978-5-9907453-1-5', N'Топология для бакалавров математики. Учебное пособие', NULL, NULL, N'Москва', 60, 2016, 88, 500, NULL)							-- Игнаточкина
		, (853, '519.1', N'22.176,Э45', '978-5-4439-1024-6', N'Элементы дискретной математики в задачах', NULL, NULL, N'Москва', 1, 2016, 176, 2000, NULL)											-- Глибичук
		, (854, '512.53+512.7+517.951', N'22.14,Х68', '5-94057-243-X', N'Геометрия полугруппы Z^n>=2', NULL, NULL, N'Москва', 1, 2006, 128, 1000, NULL)												-- Хованский		
		, (855, '513', N'22.15,П. 63', NULL, N'Лекции по геометрии. Семестр V. Группы и алгебры Ли', NULL, NULL, N'Москва', 5, 1982, 448, 22000, NULL)												-- Постников
		, (856, '514.76 (075.8)', N'22.151.2,П 63', '5-88688-020-8', N'Лекции по геометрии. Семестр V. Риманова геометрия', NULL, NULL, N'Москва', 13, 1998, 496, 1000, N'В предисловии упоминается как семестр VI') -- Постников
		, (857, '514.7 (075.8)', N'22.151,П63', '5-02-013741-1', N'Лекции по геометрии. Семестр IV. Дифференциальная геометрия', NULL, NULL, N'Москва', 5, 1988, 496, 14000, NULL)					-- Постников
		, (858, '515.12 (075.8)', N'22.182,П63', NULL, N'Лекции по геометрии. Семестр III. Гладкие многообразия', NULL, NULL, N'Москва', 5, 1987, 480, 14000, NULL)									-- Постников
		, (859, '512.64 (075.8)', N'22.143,П63', NULL, N'Лекции по геометрии. Семестр II. Линейная алгебра', 2, 'RC&E', N'Москва', 5, 1986, 400, 27500, N'1-е изд. 1979 г.')						-- Постников
		, (860, '514.12 (075.8)', N'22.151.5,П63', NULL, N'Лекции по геометрии. Семестр I. Аналитическая геометрия', 2, 'RC', N'Москва', 5, 1986, 416, 27500, N'1-е изд. 1979 г.')					-- Постников
		, (861, '513.83', N'517.6,Р79', NULL, N'Начальный курс топологии. Геометрические главы', NULL, NULL, N'Москва', 5, 1977, 488, 25000, NULL)													-- Рохлин
		, (862, '513', N'22.151,М 57', '5-94052-075-2', N'Сборник задач по дифференциальной геометрии и топологии', 2, 'RC&E', N'Москва', 42, 2004, 412, 3000, NULL)								-- Мищенко
		, (863, '513.83', N'22.152,П 63', NULL, N'Лекции по алгебраической топологии. Основы теории гомотопий', NULL, NULL, N'Москва', 5, 1984, 416, 9500, NULL)									-- Постников
		, (864, '513.83', N'22.15,П 63', NULL, N'Лекции по алгебраической топологии. Теория гомотопий клеточных пространств', NULL, NULL, N'Москва', 5, 1985, 336, 5000, NULL)						-- Постников
		, (865, '515.12', N'22.152,Ф 33', '5-9221-0618-X', N'Общая топология. Основные конструкции', 2, 'RC&E', N'Москва', 42, 2006, 336, 2000, NULL)												-- Федорчук
		, (866, '513.83', NULL, NULL, N'Топология. Том 1', NULL, NULL, N'Москва', 2, 1966, 596, NULL, N'Титульная страница на английском также датирована 1966 г.')									-- Куратовский
		, (867, '513.83', NULL, NULL, N'Топология. Том 2', NULL, NULL, N'Москва', 2, 1969, 624, NULL, N'Титульная страница на английском также датирована 1968 г.')									-- Куратовский
		, (868, '515', NULL, '5-93972-068-4', N'Топология', 2, NULL, N'Москва', 16, 2001, 448, 1000, NULL)																							-- Зейферт
		, (869, '513.83', N'22.15,К 34', NULL, N'Общая топология', 2, NULL, N'Москва', 5, 1981, 432, 21000, NULL)																					-- Келли
		, (870, NULL, NULL, NULL, N'Алгебраическая топология и теория пучков', NULL, NULL, N'Москва', 18, 1961, 320, NULL, N'1958')																	-- Годеман
		, (871, '519.4', NULL, NULL, N'Лекции по алгебраической топологии', NULL, NULL, N'Москва', 2, 1976, 464, NULL, N'1972')																		-- Дольд
		, (872, NULL, N'22.147,22.151,22.152', '5-354-00670-8', N'Теория гомотопий', 2, 'S', N'Москва', 61, 2004, 472, 500, NULL)																	-- Ху Сы-цзян
		, (873, '515.4', N'22.152,А28', '978-5-4439-0207-4', N'Стабильные гомотопии и обобщенные гомологии', NULL, NULL, N'Москва', 1, 2013, 432, 800, NULL)										-- Адамс
		, (874, '515.1 + 514.18', N'22.152 + 22.151.3,Ф 83', '5-03-001424-1', N'Книжка с картинками по топологии', NULL, NULL, N'Москва', 2, 1991, 240, 1400, NULL)									-- Франсис
		, (875, '22.152', N'515.14,В43', '5-94057-086-0', N'Теория гомологий. Введение в алгебраическую топологию', NULL, NULL, N'Москва', 1, 2005, 288, 1000, N'Перевод со второго издания 1994 г.')	-- Вик
		, (876, '511.52', N'517.1,П63', NULL, N'Теорема Ферма. Введение в теория алгебраических чисел', NULL, NULL, N'Москва', 5, 1978, 128, 50000, NULL)											-- Постников
		, (877, '517.55', NULL, NULL, N'Введение в теорию функций нескольких комплексных переменных', NULL, NULL, N'Москва', 2, 1968, 128, NULL, '1966')											-- Хёрмандер
		, (878, '517.5', N'22.161.5,Ч-65', NULL, N'Комплексные аналитические множества', NULL, NULL, N'Москва', 2, 1985, 272, 3400, NULL)															-- Чирка
		, (879, NULL, NULL, NULL, N'Основы анализа. Действия над целыми, рациональными, иррациональными, комплексными числами. Дополнение к учебникам по дифференциальному и интегральному исчислению', NULL, NULL, N'Москва', 18, 1947, 184, NULL, '1930')	-- Ландау
		, (880, NULL, NULL, NULL, N'Введение в дифференциальное и интегральное исчисление', NULL, NULL, N'Москва', 18, 1948, 462, NULL, '1934')														-- Ландау
		, (881, '519.4', NULL, NULL, N'АЛГЕБРА: КОЛЬЦА, МОДУЛИ И КАТЕГОРИИ 1', NULL, NULL, N'Москва', 2, 1977, 688, NULL, '1973')																	-- Фейс
		, (882, '519.4', NULL, NULL, N'АЛГЕБРА: КОЛЬЦА, МОДУЛИ И КАТЕГОРИИ 2', NULL, NULL, N'Москва', 2, 1979, 464, 8000, '1976')																	-- Фейс
		, (883, NULL, NULL, NULL, N'Теория групп Ли I', NULL, NULL, N'Москва', 18, 1948, 316, NULL, '1946')																							-- Шевалле
		, (884, NULL, NULL, NULL, N'Теория групп Ли II. Алгебраические группы', NULL, NULL, N'Москва', 18, 1958, 276, NULL, '1951')																	-- Шевалле
		, (885, NULL, NULL, NULL, N'Теория групп Ли III. Общая теория алгебр Ли', NULL, NULL, N'Москва', 18, 1958, 308, NULL, '1955')																-- Шевалле
		, (886, NULL, NULL, NULL, N'Введение в теорию алгебраических функций', NULL, NULL, N'Москва', 3, 1959, 336, 7000, '1951')																	-- Шевалле
		, (887, NULL, NULL, NULL, N'Строение колец', NULL, NULL, N'Москва', 18, 1961, 392, NULL, '1956')																							-- Джекобсон
		, (888, NULL, NULL, NULL, N'Теория колец', NULL, NULL, N'Москва', 18, 1947, 288, NULL, '1943')																								-- Джекобсон
		, (889, '512.8', N'22.14,В 17', NULL, N'Теория колец', 2, NULL, N'Москва', 5, 1979, 624, 30000, N'Перевод с немецких изданий томов первого и второго соответственно 1971 и 1967 г.г.')		-- Варден
		, (890, '519.1', N'22.152,В11', '5-03-001002-5', N'В поисках утраченной топологии', NULL, NULL, N'Москва', 2, 1989, 294, 4150, N'1986')														-- Гийу (под ред.)
		, (891, '515.14', N'22.152,Б86', '5-02-013909-2', N'Дифференциальные формы в алгебраической топологии', NULL, NULL, N'Москва', 5, 1989, 336, 4600, N'1982')									-- Бот
		, (892, '512.7', N'22.14,Л44', NULL, N'Основы диофантовой геометрии', NULL, NULL, N'Москва', 2, 1986, 446, 4100, N'1982')																	-- Ленг
		, (893, '513.83', NULL, NULL, N'Заметки по теории кобордизмов', NULL, NULL, N'Москва', 2, 1973, 376, NULL, N'1968')																			-- Стонг
		, (894, '513', N'22.15,Г 47', NULL, N'Наглядная геометрия', 3, NULL, N'Москва', 5, 1981, 344, 100000, N'Перевод с немецкого издания 1936 г.')												-- Гильберт
		, (895, '516', N'22.151.5,А 46', NULL, N'Курс аналитической геометрии и линейной алгебры', NULL, NULL, N'Москва', 5, 1979, 512, 60000, NULL)												-- Александров
		, (896, '516', N'517.3, П 63', NULL, N'Аналитическая геометрия', NULL, NULL, N'Москва', 5, 1973, 752, 34500, NULL)																			-- Постников
		, (897, '512.552', '22.144,Х21', N'5-03-02484-0', N'Строение конечных алгебр', NULL, NULL, N'Москва', 2, 1993, 287, 1000, N'1988')															-- Хобби
		, (898, '519', NULL, '5-93972-103-6', N'Гиперболические группы', NULL, NULL, N'Москва-Ижевск', 16, 2002, 160, 600, N'Перевод с английского')												-- Громов
		, (899, NULL, NULL, NULL, N'Геометрическая теория интегрирования', NULL, NULL, N'Москва', 18, 1960, 536, NULL, N'Перевод с английского издания 1957 г.')									-- Уитни
		, (900, '517.948,513.88', NULL, NULL, N'Гильбертово пространство в задачах', NULL, NULL, N'Москва', 2, 1970, 352, NULL, N'Перевод с английского издания 1967 г.') -- Халмош



		, (901, '', NULL, NULL, N'Проблемы теории диофантовых приближений', NULL, NULL, N'Москва', 2, 1974, 168, NULL, N'Перевод с ') --Сборник переводов/БСМ
		, (902, '', NULL, NULL, N'Случайные функциональные ряды', NULL, NULL, N'Москва', 2, 1973, 304, NULL, N'Перевод с английского издания 1968 г.') --Ж.-П. Кахан/БСМ
		, (903, '', NULL, NULL, N'Введение в топологическое исследование особенностей Ландау', NULL, NULL, N'Москва', 2, 1970, 184, NULL, N'Перевод с английского издания 1967 г.') --Ф. Фам/БСМ
		, (904, '', NULL, NULL, N'Линейные продолжения, линейные усреднения и их применения к линейной топологической классификации пространств непрерывных функций', NULL, NULL, N'Москва', 2, 1970, 144, NULL, N'Перевод с английского издания 1968 г.') --А. Пелчинский/БСМ
		, (905,	NULL, NULL, NULL, N'Обобщенные функции. Выпуск 4. Некоторые применения гармонического анализа. Оснащенные гильбертовы пространства', NULL, NULL, N'Москва', 3, 1961, 472, 10150, NULL) --И М Гельфанд Н Я Виленкин
		, (906, '', NULL, NULL, N'Ядерные локально выпуклые пространства', NULL, NULL, N'Москва', 2, 1967, 268, NULL, N'Перевод с английского издания 1965 г.') --А. Пиx/БСМ
		, (907, '', NULL, NULL, N'Семинар по алгебраическим группам', NULL, NULL, N'Москва', 2, 1973, 320, NULL, N'Перевод с 1970') --Сборник переводов/БСМ
		, (908, '', NULL, NULL, N'Основы классической теории потенциала', NULL, NULL, N'Москва', 2, 1961, 216, NULL, N'Перевод с английского издания 1964 г.') --М.Брело/БСМ
		, (909, '', NULL, NULL, N'Основы классической теории потенциала', NULL, NULL, N'Москва', 2, 1964, 192, NULL, N'Перевод с английского издания 1959 г.') --Хуа-Логен/БСМ
		, (910, '', NULL, NULL, N'Лекции по K-теории', NULL, NULL, N'Москва', 2, 1967, 264, NULL, N'Перевод с английского издания  г.') --М. Атья/БСМ
		, (911, '', NULL, NULL, N'Целочисленнные потоки и минимальные поверхности', NULL, NULL, N'Москва', 2, 1973, 204, NULL, N'Перевод с английского издания  г.') --Сборник статей/БСМ
		, (912, '', NULL, NULL, N'Введение в теорию модулярных форм', NULL, NULL, N'Москва', 2, 1979, 256, 6500, N'Перевод с английского издания  1976 г.') --С.Ленг
		, (913, '', NULL, NULL, N'Введение в эллиптические кривые и модулярные формы', NULL, NULL, N'Москва', 0, 0, 0, 0, N'') -- Коблиц Н.
		, (914, '', NULL, NULL, N'Рациональная теория гомотопий и дифференциальные формы', NULL, NULL, N'Москва', 0, 1990, 0, 0, N'') -- Ф.А.Гриффитс  Д.В.Морган
		, (915, '', NULL, NULL, N'Коды исправляющие ошибки', NULL, NULL, N'Москва', 2, 1976, 0, 0, N'') -- У. Питерсон, Э.Уэлдон
		, (916, '', NULL, NULL, N'Теория линейных операций', NULL, NULL, N'Москва', 16, 2001, 0, 0, N'') -- С. Банах
		, (917, '', NULL, NULL, N'Введение в теорию целых функций многих переменных', NULL, NULL, N'Москва', 0, 1971, 0, 0, N'') -- Л.И.Ронкин
		, (918, '', NULL, NULL, N'Введение в аналитическую теорию чисел', NULL, NULL, N'Москва', 0, 1971, 0, 0, N'') -- А Г Постников
		, (919, '', NULL, NULL, N'Лекции по математическому анализу. Часть 1', NULL, NULL, N'Москва', 0, 1995, 0, 0, N'') -- Архипов, Садовничий, Чубариков
		, (920, '', NULL, NULL, N'Сергей Петрович Новиков. К семидесятилетию со дня рождения. Интервью, статьи, выступления.', NULL, NULL, N'Москва', 1, 2008, 0, 0, N'') -- 
		, (921, '', NULL, NULL, N'Элементарные методы в аналитической теории чисел', NULL, NULL, N'Москва', 0, 1962, 0, 0, N'') -- Гельфонд, Линник
		, (922, '', NULL, NULL, N'Топологическая теория Галуа', NULL, NULL, N'Москва', 1, 2008, 0, 0, N'') -- Хованский
		, (923, '', NULL, NULL, N'Ошибки в геометрических доказательствах', NULL, NULL, N'Москва', 0, 1961, 0, 0, N'') -- Я С Дубнов
		, (924, '', NULL, NULL, N'Равномерные алгебры', NULL, NULL, N'Москва', 2, 1973, 0, 0, N'') -- Гамелин Т.
		, (925, '', NULL, NULL, N'Homotopy Theory', NULL, NULL, N'Москва', 2, 1973, 0, 0, N'') -- G W Whitehead
		, (926, '', NULL, NULL, N'Теория инвариантов', NULL, NULL, N'Москва', 2, 1974, 0, 0, N'') -- Э. Спенсер
		, (927, '', NULL, NULL, N'Прикладная топология', NULL, NULL, N'Москва', 0, 1970, 0, 0, N'') -- А. М. Виноградов
		, (928, '', NULL, NULL, N'Этюды по комбинаторной геометрии и теории выпуклых тел', NULL, NULL, N'Москва', 0, 1971, 0, 0, N'') -- Б. Грюнбаум
		, (929, '', NULL, NULL, N'Специальные главы теории аналитических функций многих комплексных переменных', 2, NULL, N'Москва', 0, 1963, 0, 0, N'') -- Б. А. Фукс
		, (930, '', NULL, NULL, N'Интеграл Лебега-Стилтьеса', 2, NULL, N'Москва', 0, 1959, 0, 0, N'') -- Е. Камке
		, (931, '', NULL, NULL, N'Кубические формы: алгебра, геометрия, арифметика', NULL, NULL, N'Москва', 0, 1972, 304, 8000, N'') -- Манин Ю. И.
		, (932, '', NULL, NULL, N'Введение в комбинаторный анализ', NULL, NULL, N'Москва', 0, 1963, 0, 0, N'') -- Риордан Дж.
		, (933, '', NULL, NULL, N'Комбинаторные тождества', 2, NULL, N'Москва', 0, 1982, 0, 0, N'') -- Риордан Дж.
		, (934, '', NULL, NULL, N'Теория функций', NULL, NULL, N'Москва', 0, 1980, 0, 0, N'') -- Е. Титчмарш
		, (935, '', NULL, NULL, N'Автоморфные формы и клейновы группы', NULL, NULL, N'Москва', 2, 1975, 0, 0, N'') -- И Кра
		, (936, '', NULL, NULL, N'Введение в прикладную комбинаторику', NULL, NULL, N'Москва', 2, 1975, 0, 0, N'') -- А. Кофман
		, (937, '', NULL, NULL, N'Вычислимое и невычислимое', NULL, NULL, N'Москва', 0, 1980, 0, 0, N'') -- Манин Ю. И.
		, (938, '', NULL, NULL, N'Теория групп', 3, NULL, N'Москва', 0, 1967, 0, 0, N'') -- Курош А Г
		, (939, '', NULL, NULL, N'Математика. Периодический сборник переводов иностранных статей 16:5 сентябрь-октябрь 1972 16-й год издания', NULL, NULL, N'Москва', 2, 1972, 0, 0, N'') 
		, (940, '', NULL, NULL, N'Математика. Периодический сборник переводов иностранных статей 16:1 январь-февраль 1972 16-й год издания', NULL, NULL, N'Москва', 2, 1972, 0, 0, N'') 
		, (941, '', NULL, NULL, N'Математика. Периодический сборник переводов иностранных статей 16:3 май-июнь 1972 16-й год издания', NULL, NULL, N'Москва', 2, 1972, 0, 0, N'') 
		, (942, '', NULL, NULL, N'Пространство с симметриями', NULL, NULL, N'Минск', 0, 1977, 0, 0, N'') --Феденко
		, (943, '', NULL, NULL, N'Дифференциальная геометрия и топология', NULL, NULL, N'Москва', 2, 1970, 0, 0, N'') --Дж Шварц
		, (944, '', NULL, NULL, N'Теорема Пифагора', NULL, NULL, N'Москва', 0, 1960, 0, 0, N'') --В Литцман
		, (945, '', NULL, NULL, N'Метод тригонометрических сумм в теории чисел', NULL, NULL, N'Москва', 0, 1980, 0, 0, N'') --И М Виноградов
		, (946, '', NULL, NULL, N'Особые варианты метода тригонометрических сумм', NULL, NULL, N'Москва', 0, 1976, 0, 0, N'') --И М Виноградов
		, (947, '', NULL, NULL, N'Полимино', NULL, NULL, N'Москва', 2, 1975, 0, 0, N'') --С В Голомб
		, (948, '', NULL, NULL, N'Комбинаторные алгоритмы теория и практика', NULL, NULL, N'Москва', 2, 1980, 480, 16300, N'') --Рейнгольд, Нивергельт, Део
		, (949, '', NULL, NULL, N'Групповой анализ дифференциальных уравнений', NULL, NULL, N'Москва', 2, 1978, 400, 0, N'') --Л В Овсянников
		, (950, '', NULL, NULL, N'Модулярные формы и их приложения', NULL, NULL, N'Москва', 0, 1998, 0, 0, N'') --П Сарнак
		, (951, '', NULL, NULL, N'Теория автоморфизмов поверхностей по Нильсену и Тёрстону', NULL, NULL, N'Москва', 0, 1998, 0, 0, N'') --Э. Кэссон, С.Блейлер
		, (952, '', NULL, NULL, N'Прямая и обратная теоремы', NULL, NULL, N'Москва', 0, 1965, 0, 0, N'') --Градштейн И С
		, (953, '', NULL, NULL, N'Начала алгебры', NULL, NULL, N'Москва', 0, 1998, 0, 0, N'') --Винберг Э Б
		, (954, '', NULL, NULL, N'Математика и психология', NULL, NULL, N'Москва', 0, 1998, 0, 0, N'') --Биркгофф Г.
		, (955, '', NULL, NULL, N'Теория спиноров', NULL, NULL, N'Москва', 0, 1947, 0, 0, N'') --Э. Картан
		, (956, '', NULL, NULL, N'Новый обскурантизм и российское просвещение', NULL, NULL, N'Москва', 0, 1947, 0, 0, N'') --В. И. Арнольд
		, (957, '', NULL, NULL, N'Абстрактная теория группъ', NULL, NULL, N'Киевъ', 0, 1916, 0, 0, N'') --О. Ю. Шмидт
		, (958, '', NULL, NULL, N'Путешествие во времени', NULL, NULL, N'Москва', 2, 1990, 0, 0, N'') --Мартин Гарднер
		, (959, '', NULL, NULL, N'Теорема Гёделя о неполноте', NULL, NULL, N'Москва', 0, 1982, 0, 0, N'') --В А Успенский
		, (960, '', NULL, NULL, N'Что такое нестандартный анализ?', NULL, NULL, N'Москва', 0, 1987, 0, 0, N'') --В А Успенский
		, (961, '', NULL, NULL, N'Стереографическая проекция', NULL, NULL, N'Москва', 0, 1973, 0, 0, N'') --Б А Розенфельд, Н Д Сергеева
		, (962, '', NULL, NULL, N'Лекции по линейной алгебре', 4, NULL, N'Москва', 0, 1973, 0, 0, N'') --И М Гельфанд
		, (963, '', NULL, NULL, N'Математическая смекалка', NULL, NULL, N'Москва', 0, 1973, 0, 0, N'') --Б А Кордемский
		, (964, '', NULL, NULL, N'Симметрия и разделение переменных', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') --У. Миллер

		, (965, '', NULL, NULL, N'Геометрия дискретных групп', NULL, NULL, N'Москва', 2, 1986, 0, 0, N'') -- Бердон
		, (966, '', NULL, NULL, N'Непрерывные дроби', NULL, NULL, N'Москва', 2, 1985, 0, 0, N'') -- Джоунс, Трон
		, (967, '', NULL, NULL, N'Московские математические олимпиады', NULL, NULL, N'Москва', 2, 1986, 303, 0, N'') --Гальперин, Толпыго
		, (968, '', NULL, NULL, N'Классические диофантовы уравнения от двух неизвестных', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') --  Спринджук
		, (969, '', NULL, NULL, N'Геометрическая рапсодия', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') -- Карл Левитин
		, (970, '', NULL, NULL, N'Старинные занимательные задачи', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') -- Олехник
		, (971, '', NULL, NULL, N'Введение в диаграммы Феймана и физику электрослабого взаимодействия', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') --
		, (972, '', NULL, NULL, N'Лекции по математической логике', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') -- Мощенский
		, (973, '', NULL, NULL, N'Математика в московском университете', NULL, NULL, N'Москва', 2, 1992, 0, 0, N'') --под ред Рывбникова
		, (974, '', NULL, NULL, N'Гамильтонова динамика', NULL, NULL, N'Москва', 2, 2006, 0, 0, N'') -- Вилази
		, (975, '', NULL, NULL, N'Математические основы теории симметрий', NULL, NULL, N'Москва', 2, 2001, 0, 0, N'') -- Голод< Климык
		, (976, '', NULL, NULL, N'Международные математические олимпиады', NULL, NULL, N'Москва', 2, 1976, 0, 0, N'') -- Морозова, Петраков, Скворцов
		, (977, '', NULL, NULL, N'Лекции об икосаэдре и решении уравнений пятой степени', NULL, NULL, N'Москва', 2, 1989, 0, 0, N'') -- Клейн
		, (978, '', NULL, NULL, N'Математические досуги', NULL, NULL, N'Москва', 2, 1972, 0, 0, N'') -- Гарднер
		, (979, '', NULL, NULL, N'Графы на повехностях и их приложения', NULL, NULL, N'Москва', 1, 2010, 0, 0, N'') -- Звонкин, Ландо
		, (980, '', NULL, NULL, N'Задачи по арифметике и наглядной геометрии. 5 класс.', NULL, NULL, N'Москва', 1, 2020, 118, 0, N'') -- Прасолов В В
		, (981, '', NULL, NULL, N'Неравенства в задачах', NULL, NULL, N'Москва', 1, 2020, 118, 0, N'') --Бибиков П В
		, (982, '', NULL, NULL, N'Что такое аксиоматический метод', NULL, NULL, N'Москва', 0, 2001, 118, 0, N'') --Успенский В А
		, (983, '51(07)', N'22.1,Б91', '975-5-4439-1508-1', N'Дневник математического кружка: второй год занятий', NULL, NULL, N'Москва', 1, 2020, 488, 0, NULL) --Бураго Анна
		, (984, NULL, NULL, '', N'Задачи на комбинации многогранников', NULL, NULL, N'Москва', 1, 2020, 0, 0, NULL) --Смирнов Смирнова
		, (985, NULL, NULL, '', N'Задачи по геометрии (cтереометрия)', NULL, NULL, N'Москва', 0, 1984, 0, 0, NULL) --Шарышин  Библиотечка Квант 31
		, (986, NULL, NULL, '', N'Задачи по геометрии (Планиметрия)', 2, NULL, N'Москва', 0, 1986, 0, 0, NULL) --Шарышин  Библиотечка Квант 17
		, (987, NULL, NULL, '', N'Многомерные квадратурные формулы и функции Хаара', NULL, NULL, N'Москва', 0, 1986, 0, 0, NULL) --Соболь И М
		, (988, NULL, NULL, '', N'Геометрические преобразования графиков функций', NULL, NULL, N'Москва', 1, 2012, 152, 0, NULL) --Танатар И Я
		, (989, NULL, NULL, '', N'Аксиома выбора и аксиома детерминированности', NULL, NULL, N'Москва', 1, 2012, 152, 0, NULL) --Кановей В Г
		, (990, NULL, NULL, '', N'Вероятностные методы в комбинаторике', NULL, NULL, N'Москва', 1, 1976, 152, 0, NULL) --Эрдёш, Спенсер
		, (991, NULL, NULL, '', N'Математика-наука и профессия', NULL, NULL, N'Москва', 1, 1988, 152, 0, NULL) --Колмогоров  Библиотечка Квант 64
		, (992, NULL, NULL, '', N'Теория групп и квантованные поля', NULL, NULL, N'Москва', 1, 1977, 152, 0, NULL) --Румер, Фет
		, (993, NULL, NULL, '', N'Математические головоломки и развлечения', NULL, NULL, N'Москва', 0, 1994, 0, 0, NULL) --Гарднер
		, (994, NULL, NULL, '', N'Обобщения чисел', NULL, NULL, N'Москва', 1, 1988, 152, 0, NULL) --Понтрягин  Библиотечка Квант 54
		, (995, NULL, NULL, '', N'Лекции по алгебраической геометрии. Часть I. Афинные схемы', 0, 1970, 152, 0, NULL) --Манин
		, (996, NULL, NULL, '', N'Лекции по алгебраической геометрии. Часть II. K-функтор в алгебраической геометрии', 0, 1971, 152, 0, NULL) --Манин
		, (997, NULL, NULL, '', N'Введение в геометрию чисел', 0, 1965, 152, 0, NULL)  -- Касселс Дж. 
		, (998, '', NULL, NULL, N'Международные математические олимпиады', 3, NULL, N'Москва', 2, 1971, 0, 0, N'') -- Морозова, Петраков
		, (999, '', NULL, NULL, N'Устойчивые многочлены', NULL, NULL, N'Москва', 2, 1981, 0, 0, N'') -- Постников М М
		, (1000, '', NULL, NULL, N'Комбинаторная геометрия плоскости', NULL, NULL, N'Москва', 2, 1965, 0, 0, N'') -- Хадвигер, Дебруннер
		, (1001, '', NULL, NULL, N'Теорема Хелли', NULL, NULL, N'Москва', 2, 1968, 0, 0, N'') -- Данцер Л   Библ сб матем-ка
		, (1002, '', NULL, NULL, N'Инвариантные средние на топологических группах', NULL, NULL, N'Москва', 2, 1973, 0, 0, N'') -- Гринлиф Ф   Библ сб матем-ка
		, (1003, '', NULL, NULL, N'Лекции о группах Шевалле', NULL, NULL, N'Москва', 2, 1975, 0, 0, N'') -- Стейнберг Р.  Библ сб матем-ка
		, (1004, '', NULL, NULL, N'Дедекиндовы структуры с дополнениями и регулярные кольца', NULL, NULL, N'Москва', 2, 1961, 0, 0, N'') -- Скорняков Л.А.
		, (1005, '', NULL, NULL, N'Метрическая теория диофантовых приближений', NULL, NULL, N'Москва', 2, 1961, 0, 0, N'')  --Спринджук В.Г.
		, (1006, '', NULL, NULL, N'Мультипликативная теория чисел', NULL, NULL, N'Москва', 2, 1974, 0, 0, N'') -- Монтгомери Г. 
		, (1007, '', NULL, NULL, N'Абелевы группы и модули', NULL, NULL, N'Москва', 2, 1969, 0, 0, N'')    --Мишина А.П. 
		, (1008, '', NULL, NULL, N'Распределение простых чисел', NULL, NULL, N'Москва', 2, 1967, 0, 0, N'')   --Прахар К.
		, (1009, '', NULL, NULL, N'Поиски решения задачи', NULL, NULL, N'Москва', 0, 1969, 280, 0, N'')    --Туманов С.И.
		, (1010, '', NULL, NULL, N'Сборник задач по специальному курсу элементарной математики', NULL, NULL, N'Москва', 0, 1957, 280, 0, N'')    --Моденов П С
		, (1011, '', NULL, NULL, N'Аналитические функции', NULL, NULL, N'Москва', 0, 1957, 280, 0, N'')    --Валирон Ж
		, (1012, '', NULL, NULL, N'Лекции по математическим основам квантовой механики', NULL, NULL, N'Москва', 0, 1975, 0, 0, N'') -- Макки Дж.  Библ сб матем-ка
		, (1013, '', NULL, NULL, N'Мероморфные функции', NULL, NULL, N'Москва', 0, 1966, 0, 0, N'') -- Хейман
		, (1014, '', NULL, NULL, N'Когомологии бесконечномерных алгебр Ли', NULL, NULL, N'Москва', 0, 1984, 0, 0, N'') -- Фукс Д Б
		, (1015, '', NULL, NULL, N'Геометрии на трёхмерных многообразиях', NULL, NULL, N'Москва', 2, 1986, 0, 0, N'') -- П. Скотт  МНЗН
		, (1016, '', NULL, NULL, N'Введение в теорию графов', NULL, NULL, N'Москва', 2, 1977, 0, 0, N'') -- Р. Уилсон  Совр м-ка Вводные курсы
		, (1017, '', NULL, NULL, N'Гладкие функции и отображения', NULL, NULL, N'Москва', 1, 2020, 0, 0, N'') -- Макаров, Подкорытов
		, (1018, '', NULL, NULL, N'Алгебраическая топология с геометрической точки зрения', 2, NULL, N'Москва', 1, 2020, 0, 0, N'') -- Скопенков А Б
		, (1019, '', NULL, NULL, N'Введение в теорию дифференциальных уравненний с частными производными', 0, NULL, N'Москва', 1, 2021, 0, 0, N'') -- Россовский Скубачевский  Совр лекционные курсы
		, (1020, '', NULL, NULL, N'Индукция без формальностей', 0, NULL, N'Москва', 1, 2021, 0, 0, N'') -- Шаповалов А В   Школьные математические кружки
		, (1021, '', NULL, NULL, N'Geometries', 0, NULL, N'Москва', 1, 2020, 0, 0, N'') -- A. B. Sossinsky  Math in Moscow
		, (1022, '', NULL, NULL, N'Algebraic geometry', 0, NULL, N'Москва', 1, 2010, 0, 0, N'') -- A. L. Gorodentsev  Math in Moscow
		, (1023, '', NULL, NULL, N'Topology-I', 0, NULL, N'Москва', 1, 2018, 0, 0, N'') -- A. B. Sossinsky  Math in Moscow
		, (1024, '', NULL, NULL, N'Topology-II', 0, NULL, N'Москва', 1, 2015, 0, 0, N'') -- A. B. Sossinsky  Math in Moscow
		, (1025, '', NULL, NULL, N'Basic representation theory', 0, NULL, N'Москва', 1, 2018, 0, 0, N'') -- O. K. Sheinman  Math in Moscow

		, (1026, '514.11', '22.151.0,С50', '978-5-44390046-9', N'Геометрия. Стереометрия: Пособие для подготовки к ЕГЭ', 2, 'S', N'Москва', 1,  2013, 272, 5000, NULL) -- Смирнов В.А. Под ред Семеногва, Ященко
		, (1027, '', NULL, NULL, N'Практика конформных отображений', NULL, NULL, N'Москва', 18,  1963, 408, NULL, 'Перевод с нем. издания 1959 г.') -- В. Коппенфельс, Ф. Штальман
		, (1028, '517', '517.2,Д 48', NULL, N'С*-алгебры и их приложения', NULL, NULL, N'Москва', 5,  1974, 400, 7000, 'Перевод с франц. издания 1969 г.') -- Жак Диксмье, Перевод с франц А.И.Штерн под ред А.А.Кириллова
		, (1029, '517.53-517.55', '22.161.5 Г 20', NULL, N'Ограниченные аналитические функции', NULL, NULL, N'Москва', 2,  1984, 469, 4100, 'Перевод с англ. издания 1981 г.') -- Джон Б. Гарнетт Перев. с англ. Е. М. Дынькина под ред В. П. Хавина
		, (1030, '11-5-4', NULL, NULL, N'Функциональный анализ в полуупорядоченных пространствах', NULL, NULL, N'Ленинград', 23,  1950, 469, 550, NULL) -- Л. В. Канторович, Б. З. Вулих, А. Г. Пинскер
		, (1031, '', NULL, NULL, N'Введение в конечную математику', NULL, NULL, N'Москва', 18,  1963, 488, NULL, N' Перев. с англ. изд. 1957 г.') -- Дж. Кемени, Дж. Снелл, Дж. Томпсон

		, (1032, '', NULL, NULL, N'Теория моделей', NULL, NULL, N'Москва', 2,  1977, 0, NULL, N' Перев. с англ. изд. 1973 г.') -- Г Кейслер, Ч Ч Чэн
		, (1033, '511', NULL, NULL, N'Основы теории чисел', NULL, NULL, N'Москва', 2,  1972, 0, NULL, N' Перев. с англ. изд. 1967 г.') -- Андрэ Вейль
		, (1034, '519.63', '22.193,М 31', N'5-02-014325-1', N'Нелинейные скобки Пуассона', NULL, NULL, N'Москва', 5,  1991, 368, 3100, N'') -- Карасев, Маслов
		, (1035, '', '', N'', N'О теории множеств', NULL, NULL, N'Москва', 4, 1966, 64, 52000, N'') -- Серпинский
		, (1036, '', '', N'', N'250 задач по элементарной теории чисел', NULL, NULL, N'Москва', 4, 1968, 160, 75000, N'') -- В. Серпинский
		, (1037, '', '', N'0-07-003881-3`', N'College algebra, trigonometry and analytic geometry', NULL, NULL, N'Москва', 4, 1968, 160, 75000, N'') -- Raymond A. Barnett


		, (1038, '', '', NULL, N'Дифференциальное и интегральное исчисление', NULL, NULL, N'Москва', 2, 1971, NULL, NULL, N'') -- Грауэрт, Либ, Фишер
		, (1039, '', '', NULL, N'Приложения функционального анализа и теория операторов', NULL, NULL, N'Москва', 2, 1983, NULL, NULL, N'') -- Хатсон, Пим
		, (1040, '', '', NULL, N'Неприводимые и индуцированные представления и копредставленияфедоровских групп', NULL, NULL, N'Москва', NULL, 1986, NULL, NULL, N'') -- Ковалев
		, (1041, '', '', NULL, N'Многомерные таубертовы теоремы для обобщенных функций', NULL, NULL, N'Москва', NULL, 1986, NULL, NULL, N'') -- Владимиров Дрожжинов Завьялов


		, (1042, '', '', NULL, N'Интуиционизм', NULL, NULL, N'Москва', 2, 1965, NULL, NULL, N'') -- Гейтинг
		, (1043, '', '', NULL, N'Функции многих комплексных переменных', NULL, NULL, N'Москва', 2, 1965, NULL, NULL, N'') -- Эрве
		, (1044, '', '', NULL, N'Оценки для операторов инвариантных относительно сдвига', NULL, NULL, N'Москва', NULL, 1962, NULL, NULL, N'') -- Хёрмандер Л.
		, (1045, '', '', NULL, N'Лекции по эргодической теории', NULL, NULL, N'Москва', NULL, 1959, NULL, NULL, N'') -- Халмош П.
		, (1046, '', '', NULL, N'Введение в теорию моделей и метаматематику алгебры', NULL, NULL, N'Москва', NULL, 1976, NULL, NULL, N'') -- Робинсон
		, (1047, '', '', NULL, N'Введение в теорию внешних форм', NULL, NULL, N'Москва', NULL, 1977, NULL, NULL, N'') -- Ефимов Н В
		, (1048, '', '', NULL, N'Теория алгебр Ли. Топология групп Ли. Семинар "Софус Ли"', NULL, NULL, N'Москва', NULL, 1962, NULL, NULL, N'') -- БСМ
		, (1049, '', '', NULL, N'Теория Галуа p-расширений', NULL, NULL, N'Москва', 2, 1973, NULL, NULL, N'') -- БСМ
		, (1050, '', '', NULL, N'Нормированные линейные пространства', NULL, NULL, N'Москва', NULL, 1961, NULL, NULL, N'') -- Дэй М М



								  
-- ред. Гис, Э Де Ля Арп, П. Гиперболические группы по Михаилу Громову
-- Спрингер Дж. - Введение в теорию римановых поверхностей
-- Эндрюс Г. - Теория разбиений
-- Ватсон Г.Н. - Теория бесселевых функций
-- Мурнаган - Теория представлений групп
-- Чеботарев - Теория алгебраических функций
-- Гекке Э. - Лекции по теории алгебраических чисел
-- Хассе - Лекции по теории чисел
-- Титчмарш - Теория дзета функции Римана
-- Ленг Математические беседы для студентов
-- Ленг Алгебраические числа
-- Шимура Введение в арифметическую теорию автоморфных функций 
-- Сян Когомологическая теория топологических групп преобразований
-- Под ред.Дж.Касселса и А.Фрелиха 1969 Алгебраическая теория чисел 
-- Серр, Ботт Расслоенные пространства и их приложения 
-- Успехи математических наук, т.34, вып.3, (май-июнь 1979)
-- Платонов В.П., Рапинчук А.С Алгебраические группы и теория чисел. М. Наука, Главная редакция физ.-мат. литературы 1991г. 656 с
-- Введение в теорию гомотопий. Гомологии и когомологии. Серия: Итоги науки и техники: Современные проблемы математики. Фундаментальные направления: Топология-2 Т.24



-- Вып.1. Гельфанд И.М., Шилов Г.И. Обобщенные функции и действия над ними 1959 (второе издание)
-- Вып.2. Гельфанд И.М., Шилов Г.И. Пространства основных и обобщенных функций 1958
-- Вып.6. Гельфанд И.М., Граев М.И., Пятецкий-Шапиро И.И. Теория представлений и автоморфные функции. 1966


	)
	AS Source (
		[Id], 
		[Udk], 
		[Bbk], 
		[Isbn], 
		[Title], 
		[EditionNo], 
		[EditionTypeId], 
		[PubCity], 
		[PublisherId], 
		[PubYear], 
		[Pages], 
		[Copies],
		[Remarks]) 
	ON Target.[Id] = Source.[Id] 
	WHEN MATCHED THEN 
		UPDATE SET 
			[Isbn] = Source.[Isbn],
			[Udk] = Source.[Udk],
			[Bbk] = Source.[Bbk],
			[Title] = Source.[Title], 
			[EditionNo] = Source.[EditionNo],
			[EditionTypeId] = Source.[EditionTypeId],
			[PubCity] = Source.[PubCity],
			[PublisherId] = Source.[PublisherId] ,
			[PubYear] = Source.[PubYear],
			[Pages] = Source.[Pages],
			[Copies] = Source.[Copies],
			[Remarks] = Source.[Remarks]
	WHEN NOT MATCHED BY TARGET THEN 
		INSERT (
			[Id], 
			[Udk], 
			[Bbk], 
			[Isbn], 
			[Title],
			[EditionNo],
			[EditionTypeId],
			[PubCity],
			[PublisherId],
			[PubYear],
			[Pages],
			[Copies],
			[Remarks]) 
		VALUES (
			Source.[Id], 
			Source.[Udk], 
			Source.[Bbk], 
			Source.[Isbn], 
			Source.[Title], 
			Source.[EditionNo], 
			Source.[EditionTypeId], 
			Source.[PubCity], 
			Source.[PublisherId], 
			Source.[PubYear], 
			Source.[Pages], 
			Source.[Copies],
			Source.[Remarks]) 
	WHEN NOT MATCHED BY SOURCE THEN 
		DELETE;

	SET IDENTITY_INSERT [dbo].[Title] OFF

	RETURN @@ROWCOUNT



